[
  {
    "id": 1,
    "title": "A New Dawn",
    "sort_title": "New Dawn",
    "group1": null,
    "group2": null,
    "author": "John Jackson Miller",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "09/02/2014",
    "pub_date_all": "September 2, 2014 (Hardcover, eBook)\r\nMarch 31, 2015 (Paperback)",
    "pub_summary": "Ever since the Jedi were marked for death and forced to flee Coruscant, Kanan Jarrus has devoted himself to staying alive rather than serving the Force. Wandering the galaxy alone, from one anonymous job to another, he avoids trouble—especially with the Empire—at all costs. So when he discovers a deadly conflict brewing between ruthless Imperial forces and desperate revolutionaries, he’s not about to get caught in the crossfire. Then the brutal death of a friend at the Empire’s hands forces the ex-Jedi to make a choice: bow down to fear, or stand up and fight.\r\n\r\nBut Jarrus won’t be fighting alone. Unlikely allies, including a bomb-throwing radical, a former Imperial surveillance agent, a vengeful security officer, and the mysterious Hera Syndulla—an agent provocateur with motives of her own—team up with Jarrus to challenge the Empire. As a crisis of apocalyptic proportions unfolds on the planet Gorse, they must stand together against one of the Empire’s most fearsome enforcers—for the sake of a world and its people.",
    "pages": 400,
    "isbn": "9780553392869",
    "asin": "B00IWTSGKC",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 750,
    "audio_asin": "B00M0OZZTK",
    "timeline_text": "11 BBY",
    "sort_timeline_yavin": -11,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 2,
    "title": "Tarkin",
    "sort_title": "Tarkin",
    "group1": null,
    "group2": null,
    "author": "James Luceno",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "11/04/2014",
    "pub_date_all": "November 4, 2014 (Hardcover, eBook)\r\nJune 30, 2015 (Paperback)",
    "pub_summary": "He’s the scion of an honorable and revered family. A dedicated soldier and distinguished legislator. Loyal proponent of the Republic and trusted ally of the Jedi Order. Groomed by the ruthless politician and Sith Lord who would be Emperor, Governor Wilhuff Tarkin rises through the Imperial ranks, enforcing his authority ever more mercilessly… and zealously pursuing his destiny as the architect of absolute dominion.\r\n\r\nRule through the fear of force rather than force itself, he advises his Emperor. Under Tarkin’s guidance, an ultimate weapon of unparalleled destruction moves ever closer to becoming a terrifying reality. When the so-called Death Star is completed, Tarkin is confident that the galaxy’s lingering pockets of Separatist rebellion will be brought to heel—by intimidation… or annihilation.\r\n\r\nUntil then, however, insurgency remains a genuine threat. Escalating guerrilla attacks by resistance forces and newfound evidence of a growing Separatist conspiracy are an immediate danger the Empire must meet with swift and brutal action. And to bring down a band of elusive freedom fighters, the Emperor turns to his most formidable agents: Darth Vader, the fearsome new Sith enforcer as remorseless as he is mysterious; and Tarkin—whose tactical cunning and cold-blooded efficiency will pave the way for the Empire’s supremacy… and its enemies’ extinction.",
    "pages": 288,
    "isbn": "9780345511522",
    "asin": "B00KAFX85Y",
    "audio_narrator": "Euan Morton",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 570,
    "audio_asin": "B00O4IDJDE",
    "timeline_text": "14 BBY",
    "sort_timeline_yavin": -14,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 3,
    "title": "Heir to the Jedi",
    "sort_title": "Heir to the Jedi",
    "group1": null,
    "group2": null,
    "author": "Kevin Hearne",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "03/03/2015",
    "pub_date_all": "March 3, 2015 (Hardcover, eBook)\r\nNovember 24, 2015 (Paperback)",
    "pub_summary": "Luke Skywalker’s game-changing destruction of the Death Star has made him not only a hero of the Rebel Alliance but a valuable asset in the ongoing battle against the Empire. Though he’s a long way from mastering the power of the Force, there’s no denying his phenomenal skills as a pilot—and in the eyes of Rebel leaders Princess Leia Organa and Admiral Ackbar, there’s no one better qualified to carry out a daring rescue mission crucial to the Alliance cause.\r\n\r\nA brilliant alien cryptographer renowned for her ability to breach even the most advanced communications systems is being detained by Imperial agents determined to exploit her exceptional talents for the Empire’s purposes. But the prospective spy’s sympathies lie with the Rebels, and she’s willing to join their effort in exchange for being reunited with her family. It’s an opportunity to gain a critical edge against the Empire that’s too precious to pass up. It’s also a job that demands the element of surprise. So Luke and the ever-resourceful droid R2-D2 swap their trusty X-wing fighter for a sleek space yacht piloted by brash recruit Nakari Kelen, daughter of a biotech mogul, who’s got a score of her own to settle with the Empire.\r\n\r\nChallenged by ruthless Imperial bodyguards, death-dealing enemy battleships, merciless bounty hunters, and monstrous brain-eating parasites, Luke plunges head-on into a high-stakes espionage operation that will push his abilities as a Rebel fighter and would-be Jedi to the limit. If ever he needed the wisdom of Obi-Wan Kenobi to shepherd him through danger, it’s now. But Luke will have to rely on himself, his friends, and his own burgeoning relationship with the Force to survive.",
    "pages": 304,
    "isbn": "9780345544858",
    "asin": "B00MKZ3VMW",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 542,
    "audio_asin": "B00RDN6628",
    "timeline_text": "0 ABY",
    "sort_timeline_yavin": 0,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 4,
    "title": "Lords of the Sith",
    "sort_title": "Lords of the Sith",
    "group1": null,
    "group2": null,
    "author": "Paul S. Kemp",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "04/28/2015",
    "pub_date_all": "April 28, 2015 (Hardcover, eBook)\r\nJanuary 26, 2016 (Paperback)",
    "pub_summary": "Anakin Skywalker, Jedi Knight, is just a memory. Darth Vader, newly anointed Sith Lord, is ascendant. The Emperor’s chosen apprentice has swiftly proven his loyalty to the dark side. Still, the history of the Sith Order is one of duplicity, betrayal, and acolytes violently usurping their Masters—and the truest measure of Vader’s allegiance has yet to be taken. Until now.\r\n\r\nOn Ryloth, a planet crucial to the growing Empire as a source of slave labor and the narcotic known as “spice,” an aggressive resistance movement has arisen, led by Cham Syndulla, an idealistic freedom fighter, and Isval, a vengeful former slave. But Emperor Palpatine means to control the embattled world and its precious resources—by political power or firepower—and he will be neither intimidated nor denied. Accompanied by his merciless disciple, Darth Vader, he sets out on a rare personal mission to ensure his will is done.\r\n\r\nFor Syndulla and Isval, it’s the opportunity to strike at the very heart of the ruthless dictatorship sweeping the galaxy. And for the Emperor and Darth Vader, Ryloth becomes more than just a matter of putting down an insurrection: When an ambush sends them crashing to the planet’s surface, where inhospitable terrain and an army of resistance fighters await them, they will find their relationship tested as never before. With only their lightsabers, the dark side of the Force, and each other to depend on, the two Sith must decide if the brutal bond they share will make them victorious allies or lethal adversaries.",
    "pages": 320,
    "isbn": "9780345511447",
    "asin": "B00MKZ3VUY",
    "audio_narrator": "Jonathan Davis",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 657,
    "audio_asin": "B00VQO3GPU",
    "timeline_text": "14 BBY",
    "sort_timeline_yavin": -14,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 5,
    "title": "Dark Disciple",
    "sort_title": "Dark Disciple",
    "group1": null,
    "group2": null,
    "author": "Christie Golden",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "07/07/2015",
    "pub_date_all": "July 7, 2015 (Hardcover)\r\nMarch 1, 2016 (Paperback)",
    "pub_summary": "In the war for control of the galaxy between the armies of the dark side and the Republic, former Jedi Master turned ruthless Sith Lord Count Dooku has grown ever more brutal in his tactics. Despite the powers of the Jedi and the military prowess of their clone army, the sheer number of fatalities is taking a terrible toll. And when Dooku orders the massacre of a flotilla of helpless refugees, the Jedi Council feels it has no choice but to take drastic action: targeting the man responsible for so many war atrocities, Count Dooku himself.\r\n\r\nBut the ever-elusive Dooku is dangerous prey for even the most skilled hunter. So the Council makes the bold decision to bring both sides of the Force’s power to bear—pairing brash Jedi Knight Quinlan Vos with infamous one-time Sith acolyte Asajj Ventress. Though Jedi distrust for the cunning killer who once served at Dooku’s side still runs deep, Ventress’s hatred for her former master runs deeper. She’s more than willing to lend her copious talents as a bounty hunter—and assassin—to Vos’s quest.\r\n\r\nTogether, Ventress and Vos are the best hope for eliminating Dooku—as long as the emerging feelings between them don’t compromise their mission. But Ventress is determined to have her retribution and at last let go of her dark Sith past. Balancing the complicated emotions she feels for Vos with the fury of her warrior’s spirit, she resolves to claim victory on all fronts—a vow that will be mercilessly tested by her deadly enemy . . . and her own doubt.",
    "pages": 336,
    "isbn": "9780345511539",
    "asin": "B00PP36DYO",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 660,
    "audio_asin": "B00ZAURNZA",
    "timeline_text": "19 BBY\t",
    "sort_timeline_yavin": -19,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 6,
    "title": "Lost Stars",
    "sort_title": "Lost Stars",
    "group1": null,
    "group2": null,
    "author": "Claudia Gray",
    "publisher": "Disney Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "09/04/2015",
    "pub_date_all": "September 4, 2015 (Hardcover)\r\nAugust 1, 2017 (Paperback)",
    "pub_summary": "The reign of the Galactic Empire has reached the Outer Rim planet of Jelucan, where aristocratic Thane Kyrell and rural villager Ciena Ree bond over their love of flying. Enrolling at the Imperial Academy together to become fighter pilots for the glorious Empire is nothing less than a dream come true for the both of them. But Thane sours on the dream when he sees firsthand the horrific tactics the Empire uses to maintain its ironclad rule.\r\n\r\nBitter and disillusioned, Thane joins the fledgling Rebellion—putting Ciena in an unbearable position to choose between her loyalty to the Empire and her love for the man she’s known since childhood.\r\nNow on opposite sides of the war, will these friends turned foes find a way to be together, or will duty tear them—and the galaxy—apart?",
    "pages": 551,
    "isbn": "9781484724989",
    "asin": "B00YB2HK42",
    "audio_narrator": "Pierce Cravens",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 702,
    "audio_asin": null,
    "timeline_text": "11 BBY – 5 ABY",
    "sort_timeline_yavin": -11,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 0,
    "released": 1,
    "canon": 1
  },
  {
    "id": 7,
    "title": "Aftermath",
    "sort_title": "Aftermath",
    "group1": "Aftermath",
    "group2": null,
    "author": "Chuck Wendig",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "09/04/2015",
    "pub_date_all": "September 4, 2015 (Hardcover, eBook)\r\nMarch 29, 2016 (Paperback)",
    "pub_summary": "As the Empire reels from its critical defeats at the Battle of Endor, the Rebel Alliance—now a fledgling New Republic—presses its advantage by hunting down the enemy’s scattered forces before they can regroup and retaliate. But above the remote planet Akiva, an ominous show of the enemy’s strength is unfolding. Out on a lone reconnaissance mission, pilot Wedge Antilles watches Imperial Star Destroyers gather like birds of prey circling for a kill, but is taken captive before he can report back to the New Republic leaders.\r\n\r\nMeanwhile, on the planet’s surface, former Rebel fighter Norra Wexley has returned to her native world—war weary, ready to reunite with her estranged son, and eager to build a new life in some distant place. But when Norra intercepts Wedge Antilles’s urgent distress call, she realizes her time as a freedom fighter is not yet over. What she doesn’t know is just how close the enemy is—or how decisive and dangerous her new mission will be.\r\n\r\nDetermined to preserve the Empire’s power, the surviving Imperial elite are converging on Akiva for a top-secret emergency summit—to consolidate their forces and rally for a counterstrike. But they haven’t reckoned on Norra and her newfound allies—her technical genius son, a Zabrak bounty hunter, and a reprobate Imperial defector—who are prepared to do whatever they must to end the Empire’s oppressive reign once and for all.",
    "pages": 320,
    "isbn": "9780345511447",
    "asin": "B00MKZ3VUY",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 750,
    "audio_asin": "B011PVXPO0",
    "timeline_text": "14 BBY",
    "sort_timeline_yavin": -14,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 8,
    "title": "Battlefront: Twilight Company",
    "sort_title": "Battlefront: Twilight Company",
    "group1": "Battlefront",
    "group2": null,
    "author": "Alexander Freed",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "11/03/2015",
    "pub_date_all": "November 3, 2015 (Hardcover, eBook)\r\nJune 28, 2016 (Paperback)",
    "pub_summary": "Among the stars and across the vast expanses of space, the Galactic Civil War rages. On the battlefields of multiple worlds in the Mid Rim, legions of ruthless stormtroopers—bent on crushing resistance to the Empire wherever it arises—are waging close and brutal combat against an armada of freedom fighters. In the streets and alleys of ravaged cities, the front-line forces of the Rebel Alliance are taking the fight to the enemy, pushing deeper into Imperial territory and grappling with the savage flesh-and-blood realities of war on the ground.\r\n\r\nLeading the charge are the soldiers—men and women, human and nonhuman—of the sixty-first mobile infantry, better known as Twilight Company. Hard-bitten, war-weary, and ferociously loyal to one another, the members of this renegade outfit doggedly survive where others perish, and defiance is their most powerful weapon against the deadliest odds. When orders come down for the Rebels to fall back in the face of superior opposition numbers and firepower, Twilight reluctantly complies. Then an unlikely ally radically changes the strategic equation—and gives the Alliance’s hardest-fighting warriors a crucial chance to turn retreat into resurgence.\r\n\r\nOrders or not, alone and outgunned but unbowed, Twilight Company locks, loads, and prepares to make its boldest maneuver—trading down-and-dirty battle in the trenches for a game-changing strike at the ultimate target: the very heart of the Empire’s military machine.",
    "pages": 397,
    "isbn": "9780345511218",
    "asin": "B00R04OX20",
    "audio_narrator": "Jonathan Davis",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 838,
    "audio_asin": "B011PVWSGQ",
    "timeline_text": "6 BBY – 3 ABY",
    "sort_timeline_yavin": -6,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 9,
    "title": "Bloodline",
    "sort_title": "Bloodline",
    "group1": null,
    "group2": null,
    "author": "Claudia Gray",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "05/03/2016",
    "pub_date_all": "May 3, 2016 (Hardcover, eBook)\r\nJanuary 31, 2017 (Paperback)",
    "pub_summary": "WITNESS THE BIRTH OF THE RESISTANCE\r\n\r\nWhen the Rebellion defeated the Empire in the skies above Endor, Leia Organa believed it was the beginning to a lasting peace. But after decades of vicious infighting and partisan gridlock in the New Republic Senate, that hope seems like a distant memory.\r\n\r\nNow a respected senator, Leia must grapple with the dangers that threaten to cripple that fledging democracy—from both within and without. Underworld kingpins, treacherous politicians, and Imperial loyalists are sowing chaos in the galaxy. Desperate to take action, senators are calling for the election of a First Senator. It is their hope that this influential post will bring strong leadership to a divided galaxy.\r\n\r\nAs the daughter of Darth Vader, Leia faces with distrust the prospect of any one person holding such a powerful position—even when supporters suggest Leia herself for the job. But a new enemy may make this path Leia’s only option. For at the edges of the galaxy, a mysterious threat is growing….",
    "pages": 341,
    "isbn": "9780345511362",
    "asin": "B00Z3G1VU4",
    "audio_narrator": "January LaVoy",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 750,
    "audio_asin": "B01CRMO9BE",
    "timeline_text": "28 ABY",
    "sort_timeline_yavin": 28,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 10,
    "title": "Life Debt",
    "sort_title": "Life Debt",
    "group1": "Aftermath",
    "group2": null,
    "author": "Chuck Wendig",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "07/12/2016",
    "pub_date_all": "July 12, 2016 (Hardcover, eBook)\r\nMarch 28, 2017 (Paperback)",
    "pub_summary": "The galaxy is changing, and with peace now a possibility, some dare to imagine new beginnings and new destinies. For Han Solo, that means settling his last outstanding debt, by helping Chewbacca liberate the Wookiee’s home world of Kashyyyk.\r\n\r\nMeanwhile, Norra Wexley and her band of rebels pursue Admiral Rae Sloane and the remaining Imperial leadership across the galaxy. Sloane, increasingly wary of the mysterious fleet admiral, desperately searches for a means to save the crumbling Empire from oblivion. Even as Imperial forces fight to regain lost ground, Princess Leia and the New Republic seek to broker a lasting peace.\r\n\r\nBut the rebel’s hunt for Admiral Sloane is cut short after the disappearance of Han Solo and Chewbacca. Desperate to save them, Leia conscripts Norra, Sinjir, Jas, and the rest of their team to find the missing smugglers and help them in their fight for freedom.",
    "pages": 448,
    "isbn": "9781101966938",
    "asin": "B015LZ04OK",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 930,
    "audio_asin": "B01CRN2KBY",
    "timeline_text": "5 ABY",
    "sort_timeline_yavin": 5,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 11,
    "title": "Ahsoka",
    "sort_title": "Ahsoka",
    "group1": null,
    "group2": null,
    "author": "E. K. Johnston",
    "publisher": "Disney Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "10/11/2016",
    "pub_date_all": "October 11, 2016 (Hardcover, eBook)\r\nOctober 3, 2017 (Paperback)",
    "pub_summary": "Ahsoka Tano, fan favorite character from Star Wars: The Clone Wars and Star Wars Rebels, will be the star of her own young adult novel from Disney Lucasfilm Press this October 11, 2016! Fans have long wondered what happened to Ahsoka after she left the Jedi Order near the end of the Clone Wars, and before she re-appeared as the mysterious Rebel operative Fulcrum in Rebels. Finally, her story will begin to be told. Following her experiences with the Jedi and the devastation of Order 66, Ahsoka is unsure she can be part of a larger whole ever again. But her desire to fight the evils of the Empire and protect those who need it will lead her right to Bail Organa, and the Rebel Alliance….",
    "pages": 356,
    "isbn": "9781484705667",
    "asin": "1484705661",
    "audio_narrator": "Ashley Eckstein",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 424,
    "audio_asin": "B01M0YKIZA",
    "timeline_text": "18 BBY",
    "sort_timeline_yavin": -18,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 12,
    "title": "Catalyst: A Rogue One Novel",
    "sort_title": "Catalyst: A Rogue One Novel",
    "group1": null,
    "group2": null,
    "author": "James Luceno",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "11/15/2016",
    "pub_date_all": "November 15, 2016 (Hardcover, eBook)\r\nMay 2, 2017 (Paperback)",
    "pub_summary": "Lauded Star Wars author James Luceno returns to pen an intense tale of ambition and betrayal that sets the stage for Rogue One: A Star Wars Story.\r\n\r\nWar is tearing the galaxy apart. For years the Republic and the Separatists have battled across the stars, each building more and more deadly technology in an attempt to win the war. As a member of Chancellor Palpatine’s top secret Death Star project, Orson Krennic is determined to develop a superweapon before their enemies can. And an old friend of Krennic’s, the brilliant scientist Galen Erso, could be the key.\r\nGalen’s energy-focused research has captured the attention of both Krennic and his foes, making the scientist a crucial pawn in the galactic conflict. But after Krennic rescues Galen, his wife, Lyra, and their young daughter, Jyn, from Separatist kidnappers, the Erso family is deeply in Krennic’s debt. Krennic then offers Galen an extraordinary opportunity: to continue his scientific studies with every resource put utterly at his disposal. While Galen and Lyra believe that his energy research will be used purely in altruistic ways, Krennic has other plans that will finally make the Death Star a reality. Trapped in their benefactor’s tightening grasp, the Ersos must untangle Krennic’s web of deception to save themselves and the galaxy itself.",
    "pages": 330,
    "isbn": "9780345511492",
    "asin": "345511492",
    "audio_narrator": "Jonathan Davis",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 660,
    "audio_asin": "B01J6GNS9I",
    "timeline_text": "21 BBY – 17 BBY",
    "sort_timeline_yavin": -21,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 13,
    "title": "Thrawn",
    "sort_title": "Thrawn",
    "group1": "Thrawn",
    "group2": null,
    "author": "Timothy Zahn",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "04/11/2017",
    "pub_date_all": "April 11, 2017 (Hardcover, eBook)\r\nApril 13, 2017 (Star Wars Celebration Orlando 2017 Limited Edition)\r\nJanuary 30, 2018 (Paperback)",
    "pub_summary": "One of the most cunning and ruthless warriors in the history of the Galactic Empire, Grand Admiral Thrawn is also one of the most captivating characters in the Star Wars universe. From his introduction in bestselling author Timothy Zahn’s classic Heir to the Empire, through his continuing adventures in Dark Force Rising, The Last Command, and beyond, Grand Admiral Thrawn has earned an iconic status among Star Wars’ greatest villains. But Thrawn’s origins and the story of his rise in the Imperial ranks have remained mysterious. Now, in Star Wars: Thrawn, Timothy Zahn chronicles the fateful events that launched the blue-skinned, red-eyed master of military strategy and lethal warfare into the highest realms of power—and infamy.\r\n\r\nAfter Thrawn is rescued from exile by Imperial soldiers, his deadly ingenuity and keen tactical abilities swiftly capture the attention of Emperor Palpatine. And just as quickly, Thrawn proves to be as indispensable to the Empire as he is ambitious; as devoted as its most loyal servant, Darth Vader; and a brilliant warrior never to be underestimated. On missions to rout smugglers, snare spies, and defeat pirates, he triumphs time and again—even as his renegade methods infuriate superiors while inspiring ever greater admiration from the Empire. As one promotion follows another in his rapid ascension to greater power, he schools his trusted aide, Ensign Eli Vanto, in the arts of combat and leadership, and the secrets of claiming victory. But even though Thrawn dominates the battlefield, he has much to learn in the arena of politics where ruthless administrator Arihnda Pryce holds the power to be a potent ally or a brutal enemy.\r\n\r\nAll these lessons will be put to the ultimate test when Thrawn rises to admiral—and must pit all the knowledge, instincts, and battle forces at his command against an insurgent uprising that threatens not only innocent lives but also the Empire’s grip on the galaxy—and his own carefully laid plans for future ascendancy.",
    "pages": 427,
    "isbn": "9780345511270",
    "asin": "B01ILZO30S",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 1020,
    "audio_asin": "B01MTYYPKY",
    "timeline_text": "16 BBY – 2 BBY",
    "sort_timeline_yavin": -16,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 14,
    "title": "Rebel Rising",
    "sort_title": "Rebel Rising",
    "group1": null,
    "group2": null,
    "author": "Beth Revis",
    "publisher": "Disney Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "05/02/2017",
    "pub_date_all": "May 2, 2017 (Hardcover, eBook)\r\nAugust 7, 2018 (Paperback)",
    "pub_summary": "When Jyn Erso was five years old, her mother was murdered and her father taken from her to serve the Empire. But despite the loss of her parents she is not completely alone—Saw Gerrera, a man willing to go to any extremes necessary in order to resist Imperial tyranny, takes her in as his own, and gives her not only a home but all the abilities and resources she needs to become a rebel herself.\r\n\r\nJyn dedicates herself to the cause—and the man. But fighting alongside Saw and his people brings with it danger and the question of just how far Jyn is willing to go as one of Saw’s soldiers. When she faces an unthinkable betrayal that shatters her world, Jyn will have to pull the pieces of herself back together and figure out what she truly believes in…and who she can really trust.",
    "pages": 410,
    "isbn": "9781484780831",
    "asin": "B01N9QS8E4",
    "audio_narrator": "Rebecca Soler",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 593,
    "audio_asin": "B06XT8G4NB",
    "timeline_text": "13 BBY – 0 BBY",
    "sort_timeline_yavin": -13,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 15,
    "title": "Empire's End",
    "sort_title": "Empire's End",
    "group1": "Aftermath",
    "group2": null,
    "author": "Chuck Wendig",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "06/01/2017",
    "pub_date_all": "February 21, 2017 (Hardcover, eBook)\r\nAugust 29, 2017 (Paperback)",
    "pub_summary": "Following Star Wars: Aftermath and Star Wars: Life Debt, Chuck Wendig delivers the exhilarating conclusion to the New York Times bestselling trilogy set in the years between Return of the Jedi and The Force Awakens.\r\n\r\nAs the final showdown between the New Republic and the Empire draws near, all eyes turn to a once-isolated planet: Jakku.\r\n\r\nThe Battle of Endor shattered the Empire, scattering its remaining forces across the galaxy. But the months following the Rebellion’s victory have not been easy. The fledgling New Republic has suffered a devastating attack from the Imperial remnant, forcing the new democracy to escalate their hunt for the hidden enemy.\r\n\r\nFor her role in the deadly ambush, Grand Admiral Rae Sloane is the most wanted Imperial war criminal—and one-time rebel pilot Norra Wexley, back in service at Leia’s urgent request, is leading the hunt. But more than just loyalty to the New Republic drives Norra forward: Her husband was turned into a murderous pawn in Sloane’s assassination plot, and now she wants vengeance as much as justice.\r\n\r\nBut Sloane, too, is on a furious quest: pursuing the treacherous Gallius Rax to the barren planet Jakku. As the true mastermind behind the Empire’s devastating attack, Rax has led the Empire to its defining moment. The cunning strategist has gathered the powerful remnants of the Empire’s war machine, preparing to execute the late Emperor Palpatine’s final plan. As the Imperial fleet orbits Jakku, an armada of Republic fighters closes in to finish what began at Endor. Norra and her crew soar into the heart of an apocalyptic clash that will leave land and sky alike scorched. And the future of the galaxy will finally be decided.",
    "pages": 423,
    "isbn": "9781101966969",
    "asin": "B01FC048RS",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 960,
    "audio_asin": "B01MRSYSI4",
    "timeline_text": "5 ABY",
    "sort_timeline_yavin": 5,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 16,
    "title": "Battlefront II: Inferno Squad",
    "sort_title": "Battlefront II: Inferno Squad",
    "group1": "Battlefront",
    "group2": null,
    "author": "Christie Golden",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "07/25/2017",
    "pub_date_all": "July 19, 2017 (San Diego Comic-Con 2017 Limited Convention Edition)\r\nJuly 25, 2017 (Hardcover, eBook)\r\nNovember 14, 2017 (Target Exclusive Edition)\r\nMarch 27, 2018 (Paperback)",
    "pub_summary": "The Rebellion may have heroes like Jyn Erso and Luke Skywalker. But the Empire has Inferno Squad.\r\n\r\nAfter the humiliating theft of the Death Star plans and the resulting destruction of the battle station, the Empire is on the defensive. In response to this stunning defeat, the Imperial Navy has authorized the formation of an elite team of soldiers, known as Inferno Squad. Their mission: infiltrate and eliminate the remnants of Saw Gerrera’s Partisans. Following the death of their leader, the Partisans have carried on his extremist legacy, determined to thwart the Empire—no matter what the cost. Now, Inferno Squad must prove their status as the best of the best and take down the Partisans from within. But as the danger intensifies and the threat of discovery grows, how far will Inferno Squad go to ensure the safety of the Empire?",
    "pages": 336,
    "isbn": "9781524796808",
    "asin": "B01N6W2SWY",
    "audio_narrator": "Janina Gavankar",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 622,
    "audio_asin": "B06ZY1VRRH",
    "timeline_text": "0 BBY – 0 ABY",
    "sort_timeline_yavin": 0,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 17,
    "title": "Phasma",
    "sort_title": "Phasma",
    "group1": null,
    "group2": null,
    "author": "Delilah S. Dawson",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "09/01/2017",
    "pub_date_all": "September 1, 2017 (Hardcover, eBook)\r\nApril 24, 2018 (Paperback)",
    "pub_summary": "Discover Captain Phasma’s mysterious history in this “Journey to Star Wars: The Last Jedi” novel.\r\n\r\nOne of the most cunning and merciless officers of the First Order, Captain Phasma commands the favor of her superiors, the respect of her peers, and the terror of her enemies. But for all her renown, Phasma remains as virtually unknown as the impassive expression on her gleaming chrome helmet. Now, an adversary is bent on unearthing her mysterious origins—and exposing a secret she guards as zealously and ruthlessly as she serves her masters.\r\n\r\nDeep inside the Battlecruiser Absolution, a captured Resistance spy endures brutal interrogation at the hands of a crimson-armored stormtrooper—Cardinal. But the information he desires has nothing to do with the Resistance or its covert operations against the First Order.\r\n\r\nWhat the mysterious stormtrooper wants is Phasma’s past—and with it whatever long-buried scandal, treachery, or private demons he can wield against the hated rival who threatens his own power and privilege in the ranks of the First Order. His prisoner has what Cardinal so desperately seeks, but she won’t surrender it easily. As she wages a painstaking war of wills with her captor, bargaining for her life in exchange for every precious revelation, the spellbinding chronicle of the inscrutable Phasma unfolds. But this knowledge may prove more than just dangerous once Cardinal possesses it—and once his adversary unleashes the full measure of her fury.",
    "pages": 380,
    "isbn": "9781524796310",
    "asin": "B071YBLDCB",
    "audio_narrator": "January LaVoy",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 750,
    "audio_asin": "B074CMPKG3",
    "timeline_text": "34 ABY",
    "sort_timeline_yavin": 34,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 18,
    "title": "Leia, Princess of Alderaan",
    "sort_title": "Leia, Princess of Alderaan",
    "group1": null,
    "group2": null,
    "author": "Claudia Gray",
    "publisher": "Disney Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "09/01/2017",
    "pub_date_all": "September 1, 2017 (Hardcover)\r\nNovember 6, 2018 (Paperback)",
    "pub_summary": "It is Leia Organa’s sixteenth birthday and she participates in the traditional ceremony where she declares her intention to one day take the throne of Alderaan. But she’s much more concerned about the way her parents are acting lately: lots of meetings and late dinners and not talking to her as much as they used to. Eventually she discovers the reason for their secrecy: their involvement in the increasingly organized rebellion. When Leia decides to become involved herself in the fight against the Empire, whether her parents approve or not, she will have to prove to them that she is a valuable asset who must be allowed to take a stand, regardless of the risk to herself. Her stand will also put her at odds with a pacifist young Alderaanian man who gives Leia her first kiss…and her first real loss.",
    "pages": 416,
    "isbn": "9781484780787",
    "asin": "B06ZY49H5J",
    "audio_narrator": "Saskia Maarleveld",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 594,
    "audio_asin": "B074CMXKJ4",
    "timeline_text": "3 BBY",
    "sort_timeline_yavin": -3,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 19,
    "title": "Last Shot",
    "sort_title": "Last Shot",
    "group1": null,
    "group2": null,
    "author": "Daniel José Older",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "04/17/2018",
    "pub_date_all": "April 17, 2018 (Hardcover, eBook)\r\nOctober 30, 2018 (Paperback)",
    "pub_summary": "Even the fastest ship in the galaxy can’t outrun the past….\r\n\r\nTHEN:\r\n\r\nIt’s one of the galaxy’s most dangerous secrets: a mysterious transmitter with unknown power and a reward for its discovery that most could only dream of claiming. But those who fly the Millennium Falcon throughout its infamous history aren’t your average scoundrels. Not once, but twice, the crew of the Falcon tries to claim the elusive prize – first, Lando Calrissian and the droid L3-37 at the dawn of an ambitious career, and later, a young and hungry Han Solo with the help of his copilot, Chewbacca. But the device’s creator, the volatile criminal Fyzen Gor, isn’t interested in sharing. And Gor knows how to hold a grudge….\r\n\r\nNOW:\r\n\r\nIt’s been 10 years since the rebel hero Han Solo last encountered Fyzen Gor. After mounting a successful rebellion against the Empire and starting a family with an Alderaanian princess, Han hasn’t given much thought to the mad inventor. But when Lando turns up at Han’s doorstep in the middle of the night, it’s Fyzen’s assassins that he’s running from. And without Han’s help, Lando – and all life on Cloud City – will be annihilated.\r\n\r\nWith the assistance of a young hotshot pilot, an Ewok slicer prodigy, the woman who might be the love of Lando’s life, and Han’s best and furriest friend, the two most notorious scoundrels in the New Republic are working together once more. They’ll have to journey across the stars – and into the past – before Gor uses the device’s power to reshape the galaxy.",
    "pages": 368,
    "isbn": "9780525622130",
    "asin": "B079KSMJHG",
    "audio_narrator": "Marc Thompson\r\nDaniel José Older\r\nJanuary LaVoy",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 660,
    "audio_asin": "B079VQJNXL",
    "timeline_text": "7 ABY",
    "sort_timeline_yavin": 7,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 20,
    "title": "Most Wanted",
    "sort_title": "Most Wanted",
    "group1": null,
    "group2": null,
    "author": "Rae Carson",
    "publisher": "Disney Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "05/25/2018",
    "pub_date_all": "May 25, 2018",
    "pub_summary": "Set before the events of Solo: A Star Wars Story! Han and Qi’ra don’t have a lot in common other than not having a lot. They’re street kids on the industrial planet Corellia, doing whatever it takes to get by, dreaming of something more. They each jump at a chance to prove themselves in the perilous world of Corellia’s criminal underbelly, only to discover they are on the same mission for the same unscrupulous boss. When the job goes disastrously wrong, Han and Qi’ra are on the run–from pirates, a droid crime syndicate, the Empire, and their boss–and will have to learn to trust each other if they are going to survive.\r\n",
    "pages": 352,
    "isbn": "9781368016308",
    "asin": "B079VVNP7P",
    "audio_narrator": "Saskia Maarleveld",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 476,
    "audio_asin": "B07BL4DSD6",
    "timeline_text": "13 BBY",
    "sort_timeline_yavin": -13,
    "type_hc": 1,
    "type_pb": 0,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 21,
    "title": "Alliances",
    "sort_title": "Alliances",
    "group1": "Thrawn",
    "group2": null,
    "author": "Timothy Zahn",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "06/26/2018",
    "pub_date_all": "July 24, 2018 (Hardcover, eBook)\r\nFebruary 26, 2019 (Paperback)",
    "pub_summary": "Grand Admiral Thrawn and Darth Vader ally against a threat to the Empire in this new novel from bestselling author Timothy Zahn.\r\n\r\n“I have sensed a disturbance in the Force.”\r\n\r\nOminous words under any circumstances, but all the more so when uttered by Emperor Palpatine. On Batuu, at the edges of the Unknown Regions, a threat to the Empire is taking root—its existence little more than a glimmer, its consequences as yet unknowable. But it is troubling enough to the Imperial leader to warrant investigation by his most powerful agents: ruthless enforcer Lord Darth Vader and brilliant strategist Grand Admiral Thrawn. Fierce rivals for the emperor’s favor, and outspoken adversaries on Imperial affairs—including the Death Star project—the formidable pair seem unlikely partners for such a crucial mission. But the Emperor knows it’s not the first time Vader and Thrawn have joined forces. And there’s more behind his royal command than either man suspects.\r\n\r\nIn what seems like a lifetime ago, General Anakin Skywalker of the Galactic Republic, and Commander Mitth’raw’nuruodo, officer of the Chiss Ascendancy, crossed paths for the first time. One on a desperate personal quest, the other with motives unknown…and undisclosed. But facing a gauntlet of dangers on a far-flung world, they forged an uneasy alliance—neither remotely aware of what their futures held in store.\r\n\r\nNow, thrust together once more, they find themselves bound again for the planet where they once fought side by side. There they will be doubly challenged—by a test of their allegiance to the Empire…and an enemy that threatens even their combined might.",
    "pages": 342,
    "isbn": "9780525480488",
    "asin": "B07692QXW3",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 810,
    "audio_asin": "B077Y7PLS4",
    "timeline_text": "19 BBY (Past)\r\n1 BBY (Present)",
    "sort_timeline_yavin": -19,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 22,
    "title": "Queen's Shadow",
    "sort_title": "Queen's Shadow",
    "group1": "The Queen's Hands",
    "group2": null,
    "author": "E. K. Johnston",
    "publisher": "Disney Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "03/05/2019",
    "pub_date_all": "March 5, 2019 (Hardcover, eBook)\r\nMay 2, 2019 (Paperback)",
    "pub_summary": "The end of her reign is just the beginning….\r\n\r\nWhen Padmé Amidala steps down from her position as Queen of Naboo, she is ready to set aside her title and return to life out of the spotlight. But to her surprise, the new queen asks Padmé to continue serving their people—this time in the Galactic Senate. Padmé is unsure about the new role but cannot turn down the request, especially since, thanks to her dearest friend—and decoy—Sabé, she can be in two places at once. So while Padmé plunges into politics, Sabé sets off on a mission dear to Padmé’s heart.\r\n\r\nOn the glistening capital planet Coruscant, Padmé’s new Senate colleagues regard her with curiosity—and with suspicion for her role in ousting the previous chancellor. Posing as a merchant on Tatooine, Sabé has fewer resources than she thought and fewer options than she needs.\r\n\r\nTogether with Padmé’s loyal handmaidens, Padmé and Sabé must navigate treacherous politics, adapt to constantly changing landscapes, and forge a new identity beyond the queen’s shadow.",
    "pages": 352,
    "isbn": "9781368024259",
    "asin": "B07FR2JJ7L",
    "audio_narrator": "Catherine Taber",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 502,
    "audio_asin": "B07M8YJFCH",
    "timeline_text": "32 BBY (Prologue)\r\n28 BBY\r\n19 BBY (Epilogue)",
    "sort_timeline_yavin": -28,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 23,
    "title": "Master & Apprentice",
    "sort_title": "Master & Apprentice",
    "group1": null,
    "group2": null,
    "author": "Claudia Gray",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "04/16/2019",
    "pub_date_all": "April 16, 2019 (Hardcover, eBook)\r\nSeptember 24, 2019 (Paperback)",
    "pub_summary": "An unexpected offer threatens the bond between Qui-Gon Jinn and Obi-Wan Kenobi as the two Jedi navigate a dangerous new planet and an uncertain future.\r\n\r\nA Jedi must be a fearless warrior, a guardian of justice, and a scholar in the ways of the Force. But perhaps a Jedi’s most essential duty is to pass on what they have learned. Master Yoda trained Dooku; Dooku trained Qui-Gon Jinn; and now Qui-Gon has a Padawan of his own. But while Qui-Gon has faced all manner of threats and danger as a Jedi, nothing has ever scared him like the thought of failing his apprentice.\r\n\r\nObi-Wan Kenobi has deep respect for his Master, but struggles to understand him. Why must Qui-Gon so often disregard the laws that bind the Jedi? Why is Qui-Gon drawn to ancient Jedi prophecies instead of more practical concerns? And why wasn’t Obi-Wan told that Qui-Gon is considering an invitation to join the Jedi Council—knowing it would mean the end of their partnership? The simple answer scares him: Obi-Wan has failed his Master.\r\n\r\nWhen Jedi Rael Averross, another former student of Dooku, requests their assistance with a political dispute, Jinn and Kenobi travel to the royal court of Pijal for what may be their final mission together. What should be a simple assignment quickly becomes clouded by deceit, and by visions of violent disaster that take hold in Qui-Gon’s mind. As Qui-Gon’s faith in prophecy grows, Obi-Wan’s faith in him is tested—just as a threat surfaces that will demand that Master and apprentice come together as never before, or be divided forever.",
    "pages": 330,
    "isbn": "9780525619376",
    "asin": "B07FVMNBWW",
    "audio_narrator": "Jonathan Davis",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 690,
    "audio_asin": "B07FTDBKGZ",
    "timeline_text": "40 BBY\r\n32 BBY (Epilogue)",
    "sort_timeline_yavin": -40,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 24,
    "title": "Alphabet Squadron",
    "sort_title": "Alphabet Squadron",
    "group1": "Alphabet Squadron",
    "group2": null,
    "author": "Alexander Freed",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "06/11/2019",
    "pub_date_all": "June 11, 2019 (Hardcover, eBook)\r\nDecember 31, 2019 (Paperback)",
    "pub_summary": "On the verge of victory in a brutal war, five New Republic pilots transform from hunted to hunters in this epic STAR WARS adventure. Set after Return of the Jedi, Alphabet Squadron follows a unique team, each flying a different class of starfighter as they struggle to end their war once and for all.\r\n\r\nThe Emperor is dead. His final weapon has been destroyed. The Imperial Army is in disarray. In the aftermath, Yrica Quell is just one of thousands of defectors from her former cause living in a deserters’ shantytown—until she is selected to join Alphabet Squadron.\r\n\r\nCobbled together from an eclectic assortment of pilots and starfighters, the five members of Alphabet are tasked by New Republic general Hera Syndulla herself. Like Yrica, each is a talented pilot struggling to find their place in a changing galaxy. Their mission: to track down and destroy the mysterious Shadow Wing, a lethal force of TIE fighters exacting bloody, reckless vengeance in the twilight of their reign.\r\n\r\nThe newly formed unit embodies the heart and soul of the Rebellion: ragtag, resourceful, scrappy, and emboldened by their most audacious victory in decades. But going from underdog rebels to celebrated heroes isn’t as easy as it seems, and their inner demons threaten them as much as their enemies among the stars. The wayward warriors of Alphabet Squad will have to learn to fly together if they want to protect the new era of peace they’ve fought so hard to achieve.",
    "pages": 432,
    "isbn": "9781984821980",
    "asin": "B07J4BKDRC",
    "audio_narrator": "Saskia Maarleveld",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 840,
    "audio_asin": "1984889931",
    "timeline_text": "4 ABY",
    "sort_timeline_yavin": 4,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 25,
    "title": "Treason",
    "sort_title": "Treason",
    "group1": "Thrawn",
    "group2": null,
    "author": "Timothy Zahn",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "07/23/2019",
    "pub_date_all": "July 23, 2019 (Hardcover, eBook)\r\nMarch 31, 2020 (Paperback)",
    "pub_summary": "Grand Admiral Thrawn faces the ultimate test of his loyalty to the Empire in this epic Star Wars novel from bestselling author Timothy Zahn.\r\n\r\n“If I were to serve the Empire, you would command my allegiance.”\r\n\r\nSuch was the promise Grand Admiral Thrawn made to Emperor Palpatine at their first meeting. Since then, Thrawn has been one of the Empire’s most effective instruments, pursuing its enemies to the very edges of the known galaxy. But as keen a weapon as Thrawn has become, the Emperor dreams of something far more destructive.\r\n\r\nNow, as Thrawn’s TIE defender program is halted in favor of Director Krennic’s secret Death Star project, he realizes that the balance of power in the Empire is measured by more than just military acumen or tactical efficiency. Even the greatest intellect can hardly compete with the power to annihilate entire planets.\r\n\r\nAs Thrawn works to secure his place in the Imperial hierarchy, his former protégé Eli Vanto returns with a dire warning about Thrawn’s homeworld. Thrawn’s mastery of strategy must guide him through an impossible choice: duty to the Chiss Ascendancy, or fealty to the Empire he has sworn to serve. Even if the right choice means committing treason.",
    "pages": 333,
    "isbn": "9781984820983",
    "asin": "B07L7SSJ5K",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 780,
    "audio_asin": "1984889966",
    "timeline_text": "0 BBY",
    "sort_timeline_yavin": 0,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 26,
    "title": "A Crash of Fate",
    "sort_title": "Crash of Fate",
    "group1": "Galaxy's Edge",
    "group2": null,
    "author": "Zoraida Córdova",
    "publisher": "Disney Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "08/06/2019",
    "pub_date_all": "August 6, 2019",
    "pub_summary": "Izzy and Jules were childhood friends, climbing the spires of Batuu, inventing silly games, and dreaming of adventures they would share one day. Then, Izzy’s family left abruptly, without even a chance to say goodbye. Izzy’s life became one of constant motion, traveling from one world to the next, until her parents were killed and she became a low-level smuggler to make ends meet. Jules remained on Batuu, eventually becoming a farmer like his father, but always yearning for something more.\r\n\r\nNow, thirteen years after she left, Izzy is returning to Batuu. She’s been hired to deliver a mysterious parcel, and she just wants to finish the job and get gone. But upon arrival at Black Spire Outpost she runs smack into the one person who still means something to her after all this time: Jules.\r\n\r\nThe attraction between them is immediate, yet despite Jules seeming to be everything she’s ever needed, Izzy hesitates. How can she drag this good-hearted man into the perilous life she’s chosen?\r\n\r\nJules has been trying to figure out his future, but now all he knows for certain is that he wants to be with Izzy. How can he convince her to take a chance on someone who’s never left the safety of his homeworld?\r\n\r\nWhen Izzy’s job goes wrong, the two childhood friends find themselves on the run. And all their secrets will be revealed as they fight to stay alive?",
    "pages": 352,
    "isbn": "9781368048538",
    "asin": "B07P1DYPQF",
    "audio_narrator": "Brittany Pressley",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 475,
    "audio_asin": "0593152603",
    "timeline_text": "34 ABY",
    "sort_timeline_yavin": 34,
    "type_hc": 1,
    "type_pb": 0,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 27,
    "title": "Black Spire",
    "sort_title": "Black Spire",
    "group1": "Galaxy's Edge",
    "group2": null,
    "author": "Delilah S. Dawson\t",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "08/27/2019",
    "pub_date_all": "August 27, 2019 (Hardcover, eBook)\r\nJune 30, 2020 (Paperback)",
    "pub_summary": "Walk the ancient streets, meet the colorful characters, and uncover the secret history of Star Wars: Galaxy’s Edge, the upcoming expansion to the Disney Parks experience!\r\n\r\nAfter devastating losses at the hands of the First Order, General Leia Organa has dispatched her agents across the galaxy in search of allies, sanctuary, and firepower—and her top spy, Vi Moradi, may have just found all three, on a secluded world at the galaxy’s edge.\r\n\r\nA planet of lush forests, precarious mountains, and towering, petrified trees, Batuu is on the furthest possible frontier of the galactic map, the last settled world before the mysterious expanse of Wild Space. The rogues, smugglers, and adventurers who eke out a living on the largest settlement on the planet, Black Spire Outpost, are here to avoid prying eyes and unnecessary complications. Vi, a Resistance spy on the run from the First Order, is hardly a welcome guest. And when a shuttle full of stormtroopers lands in her wake, determined to root her out, she has no idea where to find help.\r\n\r\nTo survive, Vi will have to seek out the good-hearted heroes hiding in a world that redefines scum and villainy. With the help of a traitorous trooper and her acerbic droid, she begins to gather a colorful band of outcasts and misfits, and embarks on a mission to spark the fire of resistance on Batuu—before the First Order snuffs it out entirely.",
    "pages": 400,
    "isbn": "9780593128381",
    "asin": "B07N5J1XX5",
    "audio_narrator": "January LaVoy",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 780,
    "audio_asin": "B07NJ54S7D",
    "timeline_text": "34 ABY",
    "sort_timeline_yavin": 34,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 28,
    "title": "Resistance Reborn",
    "sort_title": "Resistance Reborn",
    "group1": "Journey to Star Wars",
    "group2": "The Rise of Skywalker",
    "author": "Rebecca Roanhorse",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "11/5/2019",
    "pub_date_all": "November 5, 2019 (Hardcover, eBook)\r\nAugust 25, 2020 (Paperback)",
    "pub_summary": "The Resistance is in ruins. In the wake of their harrowing escape from Crait, what was once an army has been reduced to a handful of wounded heroes. Finn, Poe, Rey, Rose, Chewbacca, Leia Organa—their names are famous among the oppressed worlds they fight to liberate. But names can only get you so far, and Leia's last desperate call for aid has gone unanswered.\r\n\r\nFrom the jungles of Ryloth to the shipyards of Corellia, the shadow of the First Order looms large, and those with the bravery to face the darkness are scattered and isolated. If hope is to survive, the Resistance must journey throughout the galaxy, seeking out more leaders—including those who, in days gone by, helped a nascent rebellion topple an empire. Battles will be fought, alliances will be forged, and the Resistance will be reborn. ",
    "pages": 320,
    "isbn": "9780593128428",
    "asin": "B07RLV3NCP",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 690,
    "audio_asin": "B07RLQTPZY",
    "timeline_text": "34 ABY",
    "sort_timeline_yavin": 34,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 29,
    "title": "Force Collector",
    "sort_title": "Force Collector",
    "group1": "Journey to Star Wars",
    "group2": "The Rise of Skywalker",
    "author": "Kevin Shinick",
    "publisher": "Disney Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "11/19/2019",
    "pub_date_all": "November 19, 2019",
    "pub_summary": "Karr is a teenage boy like many others in the galaxy. He goes to school, helps his parents with the family business, likes speeders and droids. But Karr also has a secret: when he touches certain objects, he gets searing headaches and blacks out. And along with the pain sometimes come visions of people he doesn't know and places he's never been.\r\n\r\nKarr's parents worry that he's sick; his grandmother is convinced the visions come from the Force. But it's been years since anyone has heard from the last of the Jedi—Luke Skywalker. Are there any Jedi left to guide Karr in the use of his abilities? Is anyone even willing to talk about the Jedi and what happened to them, as their memory continues to fade and the First Order rises? Stuck on his isolated home planet, Karr becomes a collector of historical artifacts, hoping to one day find an object that will give him a vision about the secrets of the Jedi.\r\n\r\nWhen his grandmother dies and his parents announce they're sending him away to a school on the other side of the planet, Karr reaches his breaking point. He needs to know what his destiny holds, and whether the Jedi are involved. Accompanied by Maize, the blunt, unpredictable new girl at school with ties to the First Order, and RZ-7, Karr's solicitous droid companion, he sets off into the larger galaxy to find the truth. His adventures will take him from Utapau to Jakku to Takodana and beyond as he learns more about the Jedi than he could have expected…and about his own place in the Force. ",
    "pages": 384,
    "isbn": "9781405295413",
    "asin": "B07RPF789X",
    "audio_narrator": "Euan Morton",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 494,
    "audio_asin": "B07RV3RR7K",
    "timeline_text": "31 ABY – 32 ABY",
    "sort_timeline_yavin": 31,
    "type_hc": 1,
    "type_pb": 0,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 30,
    "title": "Queen's Peril",
    "sort_title": "Queen's Peril",
    "group1": "The Queen's Hands",
    "group2": null,
    "author": "E. K. Johnston",
    "publisher": "Disney Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "06/02/2020",
    "pub_date_all": "June 2, 2020 (hardcover)\r\nOctober 5, 2021 (paperback)",
    "pub_summary": "When fourteen-year-old Padmé Naberrie wins the election for Queen of Naboo, she takes the name Amidala and leaves her family to rule from the Royal Palace in the capital of Theed. At a time of brewing uncertainty for Naboo and the Galactic Republic, she and her security advisor, Captain Panaka, devise a plan for the Queen's safety: the recruitment of multiple handmaidens. These handmaidens will be her aides, confidants, protectors, and even decoys. Each young woman is selected by Panaka for her particular talents, but it is up to Padmé to unite them as a group. Different though they may be, the handmaidens learn to work together in service of the one goal they all share: to protect the Queen at all costs. But when their peaceful world is invaded by the ambitious Trade Federation, Queen Amidala and her brave handmaidens will face their greatest test— of themselves and of each other. ",
    "pages": 288,
    "isbn": "9781368057141",
    "asin": "B085KKSQBW",
    "audio_narrator": "Catherine Taber",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 371,
    "audio_asin": "B085LMW71G",
    "timeline_text": "32 BBY",
    "sort_timeline_yavin": -32,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 31,
    "title": "Shadow Fall",
    "sort_title": "Shadow Fall",
    "group1": "Alphabet Squadron",
    "group2": null,
    "author": "Alexander Freed",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "06/23/2020",
    "pub_date_all": "June 23, 2020 (hardcover)\r\nFebruary 23, 2021 (paperback)",
    "pub_summary": "Alphabet Squadron's hunt for the deadliest TIE fighters in the galaxy continues in this Star Wars adventure!\r\n\r\nNews of the New Republic's victory still reverberates through the galaxy. In its wake, the capital ships of the newly legitimized galactic government journey to the farthest stars, seeking out and crushing the remnants of imperial tyranny. But some old ghosts are harder to banish than others. And none are more dangerous than Shadow Wing.\r\n\r\nYrica Quell's ragtag Alphabet Squadron still leads the search for Shadow Wing, but they're no closer to their goal—and the pressure to find their quarry before it's too late has begun to shake them apart. Determined, Quell works with New Republic Intelligence's contentious Caern Adan and the legendary General Hera Syndulla to prepare the riskiest gambit of her starfighting career—a trap for Shadow Wing that could finish the chase once and for all.\r\n\r\nBut in the darkness, their enemy has evolved. Soran Keize, last of the Imperial aces, has stepped into the power vacuum at the head of Shadow Wing, reinvigorating the faltering unit in their hour of need. Once adrift in the aftershocks of the war, Keize has found meaning again, leading the lost soldiers of his unit through to safety. The only thing standing in his way? The most mismatched squadron in the New Republic Navy, led by his former mentee: the traitor Yrica Quell. ",
    "pages": 416,
    "isbn": "9781984820044",
    "asin": "B07YK1PD91",
    "audio_narrator": "Carol Monda",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 900,
    "audio_asin": "B07YSVZ2NC",
    "timeline_text": "5 ABY",
    "sort_timeline_yavin": 5,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 32,
    "title": "Poe Dameron: Free Fall",
    "sort_title": "Poe Dameron: Free Fall",
    "group1": null,
    "group2": null,
    "author": "Alex Segura",
    "publisher": "Disney Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "08/04/2020",
    "pub_date_all": "August 4, 2020",
    "pub_summary": "Poe Dameron has always wanted to fly. His mother, Shara Bey, who was an A-wing pilot for the Rebellion against the Empire, was more than happy to show her son everything she knew about flying. But she died an untimely death, and Poe was left alone with his father, Kes Dameron, who struggles with grief and a desire to keep his son safe.\r\n\r\nNow sixteen, Poe wants nothing more than to leave his home on the quiet moon Yavin 4 to find adventure in the wider galaxy, while his father wants nothing more than for him to stay put. So when a group of smugglers offers Poe a job piloting them off-world, it feels like an opportunity he can't refuse. And by the time he finds out the smugglers are actually part of the fearsome criminal enterprise called the Spice Runners of Kijimi, Poe is already in deep. His burgeoning friendship—and perhaps more—with one young Spice Runner, Zorii, is even more incentive for Poe to stick around. But is this the life he's meant to have, is it even the life he wants? With danger closing in, Poe will have to figure out where he stands—and what he stands for. ",
    "pages": 384,
    "isbn": "9781368051668",
    "asin": "B088KPK1Q1",
    "audio_narrator": "Sean Elias-Reyes",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 510,
    "audio_asin": "B0892RKT7T",
    "timeline_text": "18 ABY – 19 ABY",
    "sort_timeline_yavin": 18,
    "type_hc": 1,
    "type_pb": 0,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 33,
    "title": "Chaos Rising",
    "sort_title": "Chaos Rising",
    "group1": "Thrawn Ascendancy",
    "group2": null,
    "author": "Timothy Zahn",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "09/01/2020",
    "pub_date_all": "September 1, 2020 (hardcover)\r\nApril 27, 2021 (paperwork)",
    "pub_summary": "Discover Thrawn's origins within the Chiss Ascendancy in the first book in an epic new Star Wars trilogy from bestselling author Timothy Zahn.\r\n\r\nBeyond the edge of the galaxy lie the Unknown Regions: chaotic, uncharted, and near impassable, possessing hidden secrets and dangers in equal measure. And nestled within their swirling chaos is the Ascendancy, home to the enigmatic Chiss and the Nine Ruling Families that lead them.\r\n\r\nThe peace of the Ascendancy, a beacon of calm and stability, is shattered after a daring attack on the Chiss capital that reveals no trace of the enemy. Baffled, the Ascendancy dispatches one of its brightest young military officers to root out the unseen assailants—a recruit born of no title but adopted into the powerful family of the Mitth and given the name Thrawn.\r\n\r\nWith the might of the Expansionary Fleet at his back and aided by his comrade, Admiral Ar'alani, Thrawn begins to piece together the answers he's looking for. But as Thrawn's first command probes deeper into the vast stretch of space his people call the Chaos, he realizes that the mission he has been given is not what it seems.\r\n\r\nAnd the threat to the Ascendancy is only just beginning. ",
    "pages": 400,
    "isbn": "9780593157688",
    "asin": "B07YK1JM4S",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 780,
    "audio_asin": "B07YVLQMVG",
    "timeline_text": "19 BBY",
    "sort_timeline_yavin": -19,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 34,
    "title": "Light of the Jedi",
    "sort_title": "Light of the Jedi",
    "group1": "The High Republic",
    "group2": "Light of the Jedi",
    "author": "Charles Soule",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "01/05/2021",
    "pub_date_all": "January 5, 2021 (hardcover)\r\nJune 29, 2021 (paperback)",
    "pub_summary": "Long before the First Order, before the Empire, before even The Phantom Menace. . . Jedi lit the way for the galaxy in The High Republic\r\n\r\nIt is a golden age. Intrepid hyperspace scouts expand the reach of the Republic to the furthest stars, worlds flourish under the benevolent leadership of the Senate, and peace reigns, enforced by the wisdom and strength of the renowned order of Force users known as the Jedi. With the Jedi at the height of their power, the free citizens of the galaxy are confident in their ability to weather any storm. But even the brightest light can cast a shadow, and some storms defy any preparation.\r\n\r\nWhen a shocking catastrophe in hyperspace tears a ship to pieces, the flurry of shrapnel emerging from the disaster threatens an entire system. No sooner does the call for help go out than the Jedi race to the scene. The scope of the emergence, however, is enough to push even Jedi to their limit. As the sky breaks open and destruction rains down upon the peaceful alliance they helped to build, the Jedi must trust in the Force to see them through a day in which a single mistake could cost billions of lives.\r\n\r\nEven as the Jedi battle valiantly against calamity, something truly deadly grows beyond the boundary of the Republic. The hyperspace disaster is far more sinister than the Jedi could ever suspect. A threat hides in the darkness, far from the light of the age, and harbors a secret that could strike fear into even a Jedi's heart. ",
    "pages": 380,
    "isbn": "9780593157718",
    "asin": "B084V936F9",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 780,
    "audio_asin": "B085K1N548",
    "timeline_text": "232 BBY",
    "sort_timeline_yavin": -232,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 35,
    "title": "Into the Dark",
    "sort_title": "Into the Dark",
    "group1": "The High Republic",
    "group2": "Light of the Jedi",
    "author": "Claudia Gray",
    "publisher": "Disney Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "02/02/2021",
    "pub_date_all": "February 2, 2021",
    "pub_summary": "Padawan Reath Silas is being sent from the cosmopolitan galactic capital of Coruscant to the undeveloped frontier—and he couldn't be less happy about it. He'd rather stay at the Jedi Temple, studying the archives. But when the ship he's traveling on is knocked out of hyperspace in a galactic-wide disaster, Reath finds himself at the center of the action. The Jedi and their traveling companions find refuge on what appears to be an abandoned space station. But then strange things start happening, leading the Jedi to investigate the truth behind the mysterious station, a truth that could end in tragedy....",
    "pages": 352,
    "isbn": "9781368057288",
    "asin": "B08543D4W9",
    "audio_narrator": "Dan Bittner",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 600,
    "audio_asin": "B085F2YKJC",
    "timeline_text": "232 BBY",
    "sort_timeline_yavin": -232,
    "type_hc": 1,
    "type_pb": 0,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 36,
    "title": "Victory's Price",
    "sort_title": "Victory's Price",
    "group1": "Alphabet Squadron",
    "group2": null,
    "author": "Alexander Freed",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "03/02/2021",
    "pub_date_all": "March 2, 2021",
    "pub_summary": "The aces of the New Republic have one final chance to defeat the darkness of Shadow Wing in this thrilling conclusion to the Star Wars: Alphabet Squadron trilogy!\r\n\r\nIn the wake of Yrica Quell's shocking decision—and one of the fiercest battles of their lives—the remnants of Alphabet Squadron seek answers and closure across a galaxy whose old war scars are threatening to reopen.\r\n\r\nSoran Keize has returned to the tip of Shadow Wing's spear. Operation Cinder, the terrifying protocol of planetary extermination which began in the twilight of the Imperial era, burns throughout the galaxy. Shadow Wing is no longer wounded prey fleeing the hunters of the New Republic. With its leader, its strength has returned, and its Star Destroyers and TIE squadrons lurk in the darkness between stars, carrying out the fallen Emperor's final edict of destruction—as well as another, stranger mission, one Keize has championed not for the dying Empire, but for its loyal soldiers.\r\n\r\nAlphabet Squadron's ships are as ramshackle and damaged as their spirits, but they've always had each other. Now, as they face the might of Keize's reborn juggernaut, they aren't even sure they have that. How do you catch a shadow? How do you kill it? And when you're finally victorious, who pays the price? ",
    "pages": 460,
    "isbn": "9781984820075",
    "asin": "B08FHBLWLN",
    "audio_narrator": "January LaVoy",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 980,
    "audio_asin": "B08GCWNMLT",
    "timeline_text": "5 ABY",
    "sort_timeline_yavin": 5,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 37,
    "title": "Greater Good",
    "sort_title": "Greater Good",
    "group1": "Thrawn Ascendancy",
    "group2": null,
    "author": "Timothy Zahn",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "04/27/2021",
    "pub_date_all": "April 27, 2021",
    "pub_summary": "Thrawn and his allies race to save the Chiss Ascendancy from an unseen enemy in the second book in the epic Star Wars: The Ascendancy Trilogy from bestselling author Timothy Zahn.\r\n\r\nThrawn's latest triumph still rests newly on his shoulders. Despite leading the Chiss to victory and bringing glory to the House of Mitth, the true threat to the Ascendancy has not yet been extinguished. Their foes do not send threats or ultimatums, or mass ships on the edge of the Chaos. Their weapons come cloaked in smiles and generosity—gifts offered freely, services granted unconditionally.\r\n\r\nAcross the Ascendancy, seemingly inconsequential events could herald the doom of the Chiss. As Thrawn and the Expansionary Defense Fleet rally to uncover the enemy plot, they discover a chilling truth. Rather than invade Chiss capitals or pillage resources, this mysterious enemy strikes at the very foundation of the Ascendancy by widening the rifts between the Nine Ruling Families and Forty Great Houses below. As rivalry and suspicion sow discord among allies, each warrior must decide what matters most: the security of their family, or the survival of the Ascendancy itself.",
    "pages": 416,
    "isbn": "9780593158296",
    "asin": "B08KPJW7L9",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 840,
    "audio_asin": "B08KWQJX7Q",
    "timeline_text": "18 BBY",
    "sort_timeline_yavin": -18,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 38,
    "title": "Rising Storm",
    "sort_title": "Rising Storm",
    "group1": "The High Republic",
    "group2": "Light of the Jedi",
    "author": "Cavan Scott",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "06/29/2021",
    "pub_date_all": "June 29, 2021",
    "pub_summary": "Following the dramatic events of Light of the Jedi, the heroes of the High Republic era return to face a shattered peace and a fearsome foe.\r\n\r\nIn the wake of the Great Disaster and the heroism of the Jedi, the Republic continues to grow, bringing more worlds together under a single unified banner. Led by Chancellor Lina Soh, the spirit of unity extends throughout the galaxy, with the Jedi and newly established Starlight Beacon station at the vanguard.\r\n\r\nIn celebration, the chancellor plans \"The Republic Fair,\" a showcase of the possibility and peace of the expanding Republic—a precept the Jedi hope to foster. Stellan Gios, Bell Zettifar, Elzar Mann, and others join the event as ambassadors of harmony. But as the eyes of the galaxy turn toward the Fair, so too does the fury of the Nihil. Their leader, Marchion Ro, is intent on destroying this spirit of unity. His storm descends on the pageantry and celebration, sowing chaos and exacting revenge.\r\n\r\nAs the Jedi struggle to curb the carnage of the rampaging Nihil, they come face to face with the true fear their enemy plans to unleash across the galaxy. The kind of fear that even the Force cannot shield them from. ",
    "pages": 336,
    "isbn": "9780593159415",
    "asin": "B08KRG4S1Z",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 932,
    "audio_asin": "B08L6XWXHN",
    "timeline_text": "231 BBY",
    "sort_timeline_yavin": -231,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 39,
    "title": "Out of the Shadows",
    "sort_title": "Out of the Shadows",
    "group1": "The High Republic",
    "group2": "Light of the Jedi",
    "author": "Justina Ireland",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "07/27/2021",
    "pub_date_all": "July 27, 2021",
    "pub_summary": "Sylvestri Yarrow is on a streak of bad luck with no end of sight. She's been doing her best to keep the family cargo business going after her mom's death, but between mounting debt and increasing attacks by the Nihil on unsuspecting ships, Syl is in danger of losing all she has left of her mother. She heads to the galactic capital of Coruscant for help, but gets sidetracked when she's drawn into a squabble between two of the Republic's most powerful families over a patch of space on the frontier. Tangled up in familial politics is the last place Syl wants to be, but the promise of a big payoff is enough to keep her interested...\r\n\r\nMeanwhile, Jedi Knight Vernestra Rwoh has been summoned to Coruscant, but with no idea of why or by whom. She and her Padawan Imri Cantaros arrive at the capital along with Jedi Master Cohmac Vitus and his Padawan, Reath Silas—and are asked to assist with the property dispute on the frontier. But why? What is so important about an empty patch of space? The answer will lead Vernestra to a new understanding of her abilities, and take Syl back to the past... and to truths that will finally come out of the shadows. ",
    "pages": 352,
    "isbn": "9781368060653",
    "asin": "B091M4WKVQ",
    "audio_narrator": "Keylor Leigh",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 650,
    "audio_asin": "B098BHBW9Z",
    "timeline_text": "231 BBY",
    "sort_timeline_yavin": -231,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 40,
    "title": "Lesser Evil",
    "sort_title": "Lesser Evil",
    "group1": "Thrawn Ascendancy",
    "group2": null,
    "author": "Timothy Zahn",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "11/16/2021",
    "pub_date_all": "November 16, 2021",
    "pub_summary": "The fate of the Chiss Ascendancy hangs in the balance in the epic finale of the Star Wars: Thrawn Ascendancy trilogy from bestselling author Timothy Zahn.\r\n\r\nFor thousands of years The Chiss Ascendancy has been an island of calm, a center of power, and a beacon of integrity. Led by the Nine Ruling Families, their leadership stands as a bulwark of stability against the Chaos of the Unknown Regions.\r\n\r\nBut that stability has been eroded by a cunning foe that winnows away trust and loyalty in equal measure. Bonds of fidelity have given way to lines of division among the families. Despite the efforts of the Expansionary Defense Fleet, the Ascendancy slips closer and closer toward civil war.\r\n\r\nThe Chiss are no strangers to war. Their mythic status in the Chaos was earned through conflict and terrible deeds, some long buried. Until now. To ensure the Ascendancy’s future, Thrawn will delve deep into its past, uncovering the dark secrets surrounding the ascension of the First Ruling Family. But the truth of a family’s legacy is only as strong as the legend that supports it. Even if that legend turns out to be a lie.\r\n\r\nTo secure the salvation of the Ascendancy, is Thrawn willing to sacrifice everything? Including the only home he has ever known?",
    "pages": 576,
    "isbn": "9780593158326",
    "asin": "B08ZCP1Z2W",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 1394,
    "audio_asin": "B08ZDSJPHZ",
    "timeline_text": "18 BBY",
    "sort_timeline_yavin": -18,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 41,
    "title": "The Fallen Star",
    "sort_title": "Fallen Star",
    "group1": "The High Republic",
    "group2": "Light of the Jedi",
    "author": "Claudia Gray",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "01/04/2022",
    "pub_date_all": "January 4, 2022",
    "pub_summary": "Time and again, the vicious raiders known as the Nihil have sought to bring the golden age of the High Republic to a fiery end. Time and again, the High Republic has emerged battered and weary, but victorious thank to its Jedi protectors—and there is no monument to their cause grander than the Starlight Beacon.\r\n\r\nHanging like a jewel in the Outer Rim, the Beacon embodies the High Republic at the apex of its aspirations: a hub of culture and knowledge, a bright torch against the darkness of the unknown, and an extended hand of welcome to the furthest reaches of the galaxy. As survivors and refugees flee the Nihil's attacks, the Beacon and its crew stand ready to shelter and heal.\r\n\r\nThe grateful Knights and Padawans of the Jedi Order stationed there finally have a chance to recover—from the pain of their injuries and the grief of their losses. But the storm they thought had passed still rages; they are simply caught in its eye. Marchion Ro, the true mastermind of the Nihil, is preparing his most daring attack yet—one designed to snuff out the light of the Jedi. ",
    "pages": 352,
    "isbn": "9780593355398",
    "asin": "B099YZD3NR",
    "audio_narrator": "Yihyoung Li",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 840,
    "audio_asin": "B09B2MSJGD",
    "timeline_text": "230 BBY",
    "sort_timeline_yavin": -230,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 42,
    "title": "Midnight Horizon",
    "sort_title": "Midnight Horizon",
    "group1": "The High Republic",
    "group2": "Light of the Jedi",
    "author": "Daniel José Older",
    "publisher": "Disney Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "02/01/2022",
    "pub_date_all": "February 1, 2022",
    "pub_summary": "Two hundred years before the events of Star Wars: The Phantom Menace, in the era of the glorious High Republic, the Jedi are the guardians of peace and justice in the galaxy!\r\n\r\nAfter a series of staggering losses, the Republic seems to finally have the villainous Nihil marauders on the run, and it looks like there’s light at the end of the tunnel. Until word comes of a suspected Nihil attack on the industrial cosmopolitan world of Corellia, right in the Galactic Core.\r\n\r\nSent to investigate are Jedi Masters Cohmac Vitus and Kantam Sy, along with Padawans Reath Silas and Ram Jomaram, all fighting their own private battles after months of unrelenting danger. On Corellia, Reath and Ram encounter a brazen young security specialist named Crash, whose friend was one of the victims of the Nihil attack, and they team up with her to infiltrate Corellia’s elite while the Masters pursue more diplomatic avenues. But going undercover with Crash is more dangerous than anyone expected, even as Ram pulls in his friend Zeen to help with an elaborate ruse involving a galactic pop star.\r\n\r\nBut what they uncover on Corellia turns out to be just one part of a greater plan, one that could lead the Jedi to their most stunning defeat yet….\r\n\r\nThe New York Times best-selling series continues…. For light and life!",
    "pages": 496,
    "isbn": "9781368060677",
    "asin": "B09NQJ8XX6",
    "audio_narrator": "Todd Haberkorn",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 605,
    "audio_asin": "B09RKV58G3",
    "timeline_text": "230 BBY",
    "sort_timeline_yavin": -230,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 43,
    "title": "Queen's Hope",
    "sort_title": "Queen's Hope",
    "group1": "The Queen's Hands",
    "group2": null,
    "author": "E. K. Johnston",
    "publisher": "Disney Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "04/05/2022",
    "pub_date_all": "April 5, 2022",
    "pub_summary": "A peace-loving senator faces a time of war in another thrilling Padmé Amidala adventure from the author of the New York Times best-sellers Queen’s Peril and Queen’s Shadow!\r\n\r\nPadmé is adjusting to being a wartime senator during the Clone Wars. Her secret husband, Anakin Skwyalker, [sic] is off fighting the war, and excels at being a wartime Jedi. In contrast, when Padmé gets the opportunity to see the casualties on the war-torn front lines, she is horrified. The stakes have never been higher for the galaxy, or for the newly-married couple.\r\n\r\nMeanwhile, with Padmé on a secret mission, her handmaiden Sabé steps into the role of Senator Amidala, something no handmaiden has done for an extended period of time. While in the Senate, Sabé is equally horrified by the machinations that happen there. She comes face to face with a gut-wrenching decision as she realizes that she cannot fight a war this way, not even for Padmé.\r\n\r\nAnd Chancellor Palpatine hovers over it all, manipulating the players to his own ends…",
    "pages": 352,
    "isbn": "9781368075930",
    "asin": "B09V99NZ58",
    "audio_narrator": "Catherine Taber",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 400,
    "audio_asin": "B09VRLVQP1",
    "timeline_text": "22 BBY",
    "sort_timeline_yavin": -22,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 44,
    "title": "Brotherhood",
    "sort_title": "Brotherhood",
    "group1": null,
    "group2": null,
    "author": "Mike Chen",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "05/10/2022",
    "pub_date_all": "May 10, 2022",
    "pub_summary": "Obi-Wan Kenobi and Anakin Skywalker must stem the tide of the raging Clone Wars and forge a new bond as Jedi Knights.\r\n\r\nThe Clone Wars have begun. Battle lines are being drawn throughout the galaxy. With every world that joins the Separatists, the peace guarded by the Jedi Order is slipping through their fingers.\r\n\r\nAfter an explosion devastates Cato Neimoidia, the jewel of the Trade Federation, the Republic is blamed and the fragile neutrality of the planet is threatened. The Jedi dispatch Obi-Wan Kenobi, one of the Order’s most gifted diplomatic minds, to investigate the crime and maintain the balance that has begun to dangerously shift. As Obi-Wan investigates with the help of a heroic Neimoidian guard, he finds himself working against the Separatists who hope to draw the planet into their conspiracy—and senses the sinister hand of Asajj Ventress in the mists that cloak the planet.\r\n\r\nAmid the brewing chaos, Anakin Skywalker rises to the rank of Jedi Knight. Despite the mandate that Obi-Wan travel alone–and his former master’s insistence that he listen this time—Anakin’s headstrong determination means nothing can stop him from crashing the party, and bringing along a promising but conflicted youngling.\r\n\r\nOnce a Padawan to Obi-Wan, Anakin now finds himself on equal—but uncertain—footing with the man who raised him. The lingering friction between them increases the danger for everyone around them. The two knights must learn a new way to work together—and they must learn quickly, to save Cato Neimoidia and its people from the fires of war. To overcome the threat they face they must grow beyond master and apprentice. They must stand together as brothers.",
    "pages": 352,
    "isbn": "9780593358573",
    "asin": "B09DK1HS3Y",
    "audio_narrator": "Laura Racero",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 766,
    "audio_asin": "B09HR22J4Z",
    "timeline_text": "22 BBY",
    "sort_timeline_yavin": -22,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 45,
    "title": "Shadow of the Sith",
    "sort_title": "Shadow of the Sith",
    "group1": null,
    "group2": null,
    "author": "Adam Christopher",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "06/28/2022",
    "pub_date_all": "June 28, 2022",
    "pub_summary": "Luke Skywalker and Lando Calrissian return in this essential novel set between Return of the Jedi and The Force Awakens.\r\n\r\nThe Empire is dead. Nearly two decades on from the Battle of Endor, the tattered remnants of Palpatine’s forces have fled to the farthest reaches of the galaxy. But for the heroes of the New Republic, danger and loss are ever-present companions, even in this newly forged era of peace.\r\n\r\nJedi Master Luke Skywalker is haunted by visions of the dark side, foretelling an ominous secret growing somewhere in the depths of space, on a dead world called Exegol. The disturbance in the Force is undeniable . . . and Luke’s worst fears are confirmed when his old friend, Lando Calrissian, comes to him with reports of a new Sith menace.\r\n\r\nAfter his daughter was stolen from his arms, Lando searched the stars for any trace of his lost child. But every new rumor only led to dead ends and fading hopes—until he crossed paths with Ochi of Bestoon, a Sith assassin tasked with kidnapping a young girl.\r\n\r\nOchi’s true motives remain shrouded to Luke and Lando. For on a junkyard moon, a mysterious envoy of the Sith Eternal has bequeathed a sacred blade to the assassin, promising that it will give him answers to the questions that have haunted him since the Empire fell. In exchange, he must complete a final mission: return to Exegol with the key to the Sith’s glorious rebirth—the granddaughter of Darth Sidious himself, Rey.\r\n\r\nAs Ochi hunts Rey and her parents to the edge of the galaxy, Luke and Lando race into the mystery of the Sith’s lingering shadow and aid a young family running for their lives.",
    "pages": 496,
    "isbn": "9780593358603",
    "asin": "B09HJQG8L1",
    "audio_narrator": "William DeMeritt",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 1032,
    "audio_asin": "B09HR1RT6B",
    "timeline_text": "21 ABY",
    "sort_timeline_yavin": 21,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 46,
    "title": "Padawan",
    "sort_title": "Padawan",
    "group1": null,
    "group2": null,
    "author": "Kiersten White",
    "publisher": "Disney Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "07/26/2022",
    "pub_date_all": "July 26, 2022",
    "pub_summary": "BEING A TEENAGER IS HARD ENOUGH WITHOUT ALSO TRAINING TO BE A JEDI….\r\n\r\nObi-Wan Kenobi has not been apprenticed long to Qui-Gon Jinn, and he is chafing at Qui-Gon’s training style: all meditation, no action. Obi-Wan yearns to prove himself on a mission, but when he and Qui-Gon are finally set to leave on an assignment, Qui-Gon is nowhere to be found. Angered by his master’s abandonment, Obi-Wan sets out on the mission alone, determined to prove himself. On a mysterious planet he encounters a pack of feral, Force-wielding teens who seem to be the planet’s only inhabitants. As he experiences wild freedom with them and wonders if this isn’t the life he was meant for, Obi-Wan can’t escape the nagging sense that something is wrong with the Force there. Growing attachments, startling revelations, and a looming threat to both the planet and his new friends will bring Obi-Wan face-to-face with his worst fear: that maybe he was never supposed to be a Jedi at all. Can he connect with the living Force in time to save himself and everyone around him?\r\n\r\nIt’s the star of the Obi-Wan Kenobi Disney+ limited series as you’ve never seen him before…",
    "pages": 410,
    "isbn": "9781368023498",
    "asin": "B09TG1XPQB",
    "audio_narrator": "Gary Furlong",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 446,
    "audio_asin": "B0B6QG9RJR",
    "timeline_text": "41 BBY",
    "sort_timeline_yavin": -41,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 47,
    "title": "The Princess and the Scoundrel ",
    "sort_title": "Princess and the Scoundrel ",
    "group1": null,
    "group2": null,
    "author": "Beth Revis",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "08/16/2022",
    "pub_date_all": "August 16, 2022",
    "pub_summary": "You are cordially invited to the wedding of Princess Leia Organa and Han Solo.\r\n\r\nThe Death Star is destroyed. Darth Vader is dead. The Empire is desolated. But on the forest moon of Endor, amongst the chaos of a changing galaxy, time stands still for a princess and her scoundrel.\r\n\r\nAfter being frozen in carbonite, then risking everything for the Rebellion, Han is eager to stop living his life for other people. He and Leia have earned their future together, a thousand times over. And when he proposes to Leia, it’s the first time in a long time he’s had a good feeling about this. For Leia, a lifetime of fighting doesn’t truly seem over. There is work still to do, penance to pay for the dark secret she now knows runs through her veins. Her brother, Luke, is offering her that chance–one that comes with family and the promise of the Force. But when Han asks her to marry him, Leia finds her answer immediately on her lips…Yes.\r\n\r\nBut happily ever after doesn’t come easily. As soon as Han and Leia depart their idyllic ceremony on Endor for their honeymoon, they find themselves on the grandest and most glamorous stage of all: the Halcyon, a luxury vessel on a very public journey to the most wondrous worlds in the galaxy. Their marriage, and the peace and prosperity it represents, is a lightning rod for everyone in the galaxy–including Imperial remnants still clinging to power.\r\n\r\nFacing their most desperate hour, the soldiers of the Empire have dispersed across the galaxy, retrenching on isolated worlds vulnerable to their influence. As the Halcyon travels from world to world, one thing becomes abundantly clear: The war is not over. But as danger draws closer, Han and Leia find that they fight their best battles not alone but as husband and wife.",
    "pages": 383,
    "isbn": "9780593498491",
    "asin": "B09RTYVTGD",
    "audio_narrator": "Saskia Maarleveld;\r\nMarc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 765,
    "audio_asin": "B09RX4W96X",
    "timeline_text": "4 ABY",
    "sort_timeline_yavin": 4,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 48,
    "title": "Path of Deceit",
    "sort_title": "Path of Deceit",
    "group1": "The High Republic",
    "group2": "Quest of the Jedi",
    "author": "Tessa Gratton;\r\nJustina Ireland",
    "publisher": "Disney Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "10/04/2022",
    "pub_date_all": "October 4, 2022",
    "pub_summary": "Set in the world of the High Republic, 150 years before the storytelling of Phase I, an era of change brings new hopes and possibilities…but also new dangers.\r\n\r\nThe Outer Rim planet Dalna has become the focus of a Jedi investigation into a stolen Force artifact, and Zallah Macri and her Padawan, Kevmo Zink, arrive on the pastoral world to follow up on a possible connection to a Dalnan missionary group called the Path of the Open Hand. Members of the Path believe that the Force must be free and should not be used by anyone, not even the Jedi. One such believer is Marda Ro, a young woman who dreams of leaving Dalna to spread word of the Path throughout the galaxy.\r\n\r\nWhen Marda and Kevmo meet, their connection is instantaneous and electric―until Marda discovers Kevmo is a Jedi. But Kevmo is so kind and eager to learn more about the Path, that she hopes she can convince him of the rightness of her beliefs. What Marda doesn’t realize is that the leader of the Path, a charismatic woman known only as the Mother, has an agenda of her own, and it is one that can never coexist peacefully with the Jedi.\r\n\r\nIn order to follow her faith, Marda may have to choose to become her new friend’s worst enemy….",
    "pages": 352,
    "isbn": "9781368076128",
    "asin": "B0B69KD5Z6",
    "audio_narrator": "Erin Yvette",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 490,
    "audio_asin": "B0BFT5FR8V",
    "timeline_text": "382 BBY",
    "sort_timeline_yavin": -382,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 49,
    "title": "Convergence",
    "sort_title": "Convergence",
    "group1": "The High Republic",
    "group2": "Quest of the Jedi",
    "author": "Zoraida Córdova",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "11/22/2022",
    "pub_date_all": "November 22, 2022",
    "pub_summary": "The next adventure in the High Republic, expanding the new era of Star Wars, with a story set generations before Light of the Jedi.\r\n\r\nIt is an age of exploration. Jedi travel the galaxy, expanding their understanding of the Force and all the worlds and beings connected by it. Meanwhile, the Republic, led by its two chancellors, works to unite worlds in an ever-growing community among near and distant stars.\r\n\r\nOn the close orbiting planets of Eiram and E’ronoh, the growing pains of a galaxy with limited resources but unlimited ambition are felt keenly. Their hatred for each other has fueled half a decade of escalating conflict and now threatens to consume surrounding systems. The last hope for peace emerges when heirs from the two planets’ royal families plan to marry.\r\n\r\nBefore lasting peace can be established, an assassination attempt targeting the couple tilts Eiram and E’ronoh back into all-out war. To save both worlds, Jedi Knight Gella Nattai volunteers to uncover the culprit, while Chancellor Kyong appoints her son, Axel Greylark, to represent the Republic’s interests in the investigation.\r\n\r\nBut Axel’s deep distrust of the Jedi sparks against Gella’s faith in the Force. She’s never met such a puffed-up, privileged party boy, and he’s never met a more self-serious, relentless do-gooder. The more they work to untangle the shadowy web of the investigation, the more complicated the conspiracy appears to be. With accusations flying and potential enemies in every shadow, the pair will have to work together to have any hope of bringing the truth to light and saving both worlds.",
    "pages": 336,
    "isbn": "9780593358634",
    "asin": "B09RTY8GT6",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 808,
    "audio_asin": "B09SGK2DGR",
    "timeline_text": "382 BBY",
    "sort_timeline_yavin": -382,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 50,
    "title": "Battle Scars",
    "sort_title": "Battle Scars",
    "group1": "Jedi",
    "group2": "",
    "author": "Sam Maggs",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "03/07/2023",
    "pub_date_all": "March 7, 2023",
    "pub_summary": "Cal Kestis has built a new life for himself with the crew of the Stinger Mantis. Together, Cal's crew has brought down bounty hunters, defeated Inquisitors, and even evaded Darth Vader himself. More importantly, Merrin, Cere, Greez, and faithful droid BD-1 are the closest thing Cal has had to a family since the fall of the Jedi Order. Even as the galaxy's future grows more uncertain by the day, with each blow struck against the Empire, the Mantis crew grows more daring.\r\n\r\nOn what should be a routine mission, they meet a stormtrooper determined to chart her own course with the help of Cal and the crew. In exchange for help starting a new life, the Imperial deserter brings word of a powerful, potentially invaluable tool for their fight against the Empire. And even better, she can help them get to it. The only catch – pursuing it will bring them into the path of one of the Empire's most dangerous servants, the Inquisitor known as the Fifth Brother.\r\n\r\nCan the Imperial deserter truly be trusted? And while Cal and his friends have survived run-ins with the Inquisitors before, how many times can they evade the Empire before their luck runs out? ",
    "pages": 304,
    "isbn": "9780593598603",
    "asin": "B0B3HMTMG1",
    "audio_narrator": "Sean Kenin Elias-Reyes",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 628,
    "audio_asin": "B0B9T79MCP",
    "timeline_text": "12 BBY",
    "sort_timeline_yavin": -12,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 51,
    "title": "Cataclysm",
    "sort_title": "Cataclysm",
    "group1": "The High Republic",
    "group2": "Quest of the Jedi",
    "author": "Lydia Kang",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "04/04/2023",
    "pub_date_all": "April 4, 2023",
    "pub_summary": "After five years of conflict, the planets Eiram and E'ronoh are on the cusp of real peace. But when news breaks of a disaster at the treaty signing on Jedha, violence reignites on the beleaguered worlds. Together, the royal heirs of both planets—Phan-tu Zenn and Xiri A'lbaran—working alongside the Jedi, have uncovered evidence that the conflict is being orchestrated by outside forces, and all signs point to the mysterious Path of the Open Hand, whom the Jedi also suspect of causing the disaster on Jedha.\r\n\r\nWith time—and answers—in short supply, the Jedi must divide their focus between helping quell the renewed violence on Eiram and E'ronoh and investigating the Path. Among them is Gella Nattai, who turns to the one person she believes can unravel the mystery but the last person she wants to trust: Axel Greylark. The chancellor's son, imprisoned for his crimes, has always sought to unburden himself of the weight of his family name. Will he reconcile with the Jedi and aid in their quest for justice and peace, or embrace the Path's promise of true freedom?\r\n\r\nAs all roads lead to Dalna, Gella and her allies prepare to take on a foe unlike any they've ever faced. And it will take all of their trust in the Force, and in one another, to survive. ",
    "pages": 400,
    "isbn": "9780593500354",
    "asin": "B0B3LQP27Z",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 840,
    "audio_asin": "B0B94L5Z4B",
    "timeline_text": "382 BBY",
    "sort_timeline_yavin": -382,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 1,
    "canon": 1
  },
  {
    "id": 52,
    "title": "Path of Vengeance",
    "sort_title": "Path of Vengeance",
    "group1": "The High Republic",
    "group2": "Quest of the Jedi",
    "author": "",
    "publisher": "",
    "audience": "",
    "pub_date": "",
    "pub_date_all": "",
    "pub_summary": "",
    "pages": "",
    "isbn": "",
    "asin": "",
    "audio_narrator": "",
    "audio_publisher": "Random House Audio",
    "audio_runtime": "",
    "audio_asin": "",
    "timeline_text": "",
    "sort_timeline_yavin": "",
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 0,
    "canon": 1
  },
  {
    "id": 53,
    "title": "Inquisitor: Rise of the Red Blade ",
    "sort_title": "Inquisitor: Rise of the Red Blade ",
    "group1": "",
    "group2": "",
    "author": null,
    "publisher": null,
    "audience": null,
    "pub_date": null,
    "pub_date_all": null,
    "pub_summary": null,
    "pages": null,
    "isbn": null,
    "asin": null,
    "audio_narrator": null,
    "audio_publisher": "Random House Audio",
    "audio_runtime": null,
    "audio_asin": null,
    "timeline_text": null,
    "sort_timeline_yavin": null,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 0,
    "canon": 1
  },
  {
    "id": 54,
    "title": "Crimson Climb ",
    "sort_title": "Crimson Climb ",
    "group1": null,
    "group2": null,
    "author": null,
    "publisher": null,
    "audience": null,
    "pub_date": null,
    "pub_date_all": null,
    "pub_summary": null,
    "pages": null,
    "isbn": null,
    "asin": null,
    "audio_narrator": null,
    "audio_publisher": "Random House Audio",
    "audio_runtime": null,
    "audio_asin": null,
    "timeline_text": null,
    "sort_timeline_yavin": null,
    "type_hc": 1,
    "type_pb": 1,
    "type_eb": 1,
    "type_ab": 1,
    "released": 0,
    "canon": 1
  }
]