[
  {
    "id": 1,
    "title": "A New Dawn",
    "sort_title": "New Dawn",
    "author": [
      "John Jackson Miller"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "09/02/2014",
    "pub_date_all": "September 2, 2014 (Hardcover, eBook)\nMarch 31, 2015 (Paperback)",
    "pub_summary": "Ever since the Jedi were marked for death and forced to flee Coruscant, Kanan Jarrus has devoted himself to staying alive rather than serving the Force. Wandering the galaxy alone, from one anonymous job to another, he avoids trouble—especially with the Empire—at all costs. So when he discovers a deadly conflict brewing between ruthless Imperial forces and desperate revolutionaries, he’s not about to get caught in the crossfire. Then the brutal death of a friend at the Empire’s hands forces the ex-Jedi to make a choice: bow down to fear, or stand up and fight.\n\nBut Jarrus won’t be fighting alone. Unlikely allies, including a bomb-throwing radical, a former Imperial surveillance agent, a vengeful security officer, and the mysterious Hera Syndulla—an agent provocateur with motives of her own—team up with Jarrus to challenge the Empire. As a crisis of apocalyptic proportions unfolds on the planet Gorse, they must stand together against one of the Empire’s most fearsome enforcers—for the sake of a world and its people.",
    "pages": 400,
    "isbn": "9780553392869",
    "asin": "B00IWTSGKC",
    "audio_asin": "B00M0OZZTK",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/6/62/ANewDawn.png/revision/latest/scale-to-width-down/500?cb=20141001002939",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 750,
    "timeline_text": "11 BBY",
    "sort_timeline_yavin": -11,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 2,
    "title": "Tarkin",
    "sort_title": "Tarkin",
    "author": [
      "James Luceno"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "11/04/2014",
    "pub_date_all": "November 4, 2014 (Hardcover, eBook)\nJune 30, 2015 (Paperback)",
    "pub_summary": "He’s the scion of an honorable and revered family. A dedicated soldier and distinguished legislator. Loyal proponent of the Republic and trusted ally of the Jedi Order. Groomed by the ruthless politician and Sith Lord who would be Emperor, Governor Wilhuff Tarkin rises through the Imperial ranks, enforcing his authority ever more mercilessly… and zealously pursuing his destiny as the architect of absolute dominion.\n\nRule through the fear of force rather than force itself, he advises his Emperor. Under Tarkin’s guidance, an ultimate weapon of unparalleled destruction moves ever closer to becoming a terrifying reality. When the so-called Death Star is completed, Tarkin is confident that the galaxy’s lingering pockets of Separatist rebellion will be brought to heel—by intimidation… or annihilation.\n\nUntil then, however, insurgency remains a genuine threat. Escalating guerrilla attacks by resistance forces and newfound evidence of a growing Separatist conspiracy are an immediate danger the Empire must meet with swift and brutal action. And to bring down a band of elusive freedom fighters, the Emperor turns to his most formidable agents: Darth Vader, the fearsome new Sith enforcer as remorseless as he is mysterious; and Tarkin—whose tactical cunning and cold-blooded efficiency will pave the way for the Empire’s supremacy… and its enemies’ extinction.",
    "pages": 288,
    "isbn": "9780345511522",
    "asin": "B00KAFX85Y",
    "audio_asin": "B00O4IDJDE",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/d/df/TarkinCover.jpg/revision/latest/scale-to-width-down/499?cb=20140425191637",
    "audio_narrator": "Euan Morton",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 570,
    "timeline_text": "14 BBY",
    "sort_timeline_yavin": -14,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 3,
    "title": "Heir to the Jedi",
    "sort_title": "Heir to the Jedi",
    "author": [
      "Kevin Hearne"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "03/03/2015",
    "pub_date_all": "March 3, 2015 (Hardcover, eBook)\nNovember 24, 2015 (Paperback)",
    "pub_summary": "Luke Skywalker's game-changing destruction of the Death Star has made him not only a hero of the Rebel Alliance but a valuable asset in the ongoing battle against the Empire. Though he's a long way from mastering the power of the Force, there's no denying his phenomenal skills as a pilot—and in the eyes of Rebel leaders Princess Leia Organa and Admiral Ackbar, there's no one better qualified to carry out a daring rescue mission crucial to the Alliance cause.\n\nA brilliant alien cryptographer renowned for her ability to breach even the most advanced communications systems is being detained by Imperial agents determined to exploit her exceptional talents for the Empire's purposes. But the prospective spy's sympathies lie with the Rebels, and she's willing to join their effort in exchange for being reunited with her family. It's an opportunity to gain a critical edge against the Empire that's too precious to pass up. It's also a job that demands the element of surprise. So Luke and the ever-resourceful droid R2-D2 swap their trusty X-wing fighter for a sleek space yacht piloted by brash recruit Nakari Kelen, daughter of a biotech mogul, who's got a score of her own to settle with the Empire.\n\nChallenged by ruthless Imperial bodyguards, death-dealing enemy battleships, merciless bounty hunters, and monstrous brain-eating parasites, Luke plunges head-on into a high-stakes espionage operation that will push his abilities as a Rebel fighter and would-be Jedi to the limit. If ever he needed the wisdom of Obi-Wan Kenobi to shepherd him through danger, it's now. But Luke will have to rely on himself, his friends, and his own burgeoning relationship with the Force to survive.",
    "pages": 304,
    "isbn": "9780345544858",
    "asin": "B00MKZ3VMW",
    "audio_asin": "B00RDN6628",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/c/c2/Heir_to_the_Jedi.jpg/revision/latest/scale-to-width-down/500?cb=20140425200555",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 542,
    "timeline_text": "0 ABY",
    "sort_timeline_yavin": null,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 4,
    "title": "Lords of the Sith",
    "sort_title": "Lords of the Sith",
    "author": [
      "Paul S. Kemp"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "04/28/2015",
    "pub_date_all": "April 28, 2015 (Hardcover, eBook)\nJanuary 26, 2016 (Paperback)",
    "pub_summary": "\"It appears things are as you suspected, Lord Vader. We are indeed hunted.\"\n\nAnakin Skywalker, Jedi Knight, is just a memory. Darth Vader, newly anointed Sith Lord, is ascendant. The Emperor's chosen apprentice has swiftly proven his loyalty to the dark side. Still, the history of the Sith Order is one of duplicity, betrayal, and acolytes violently usurping their Masters—and the truest measure of Vader's allegiance has yet to be taken. Until now.\n\nOn Ryloth, a planet crucial to the growing Empire as a source of slave labor and the narcotic known as \"spice,\" an aggressive resistance movement has arisen, led by Cham Syndulla, an idealistic freedom fighter, and Isval, a vengeful former slave. But Emperor Palpatine means to control the embattled world and its precious resources—by political power or firepower—and he will be neither intimidated nor denied. Accompanied by his merciless disciple, Darth Vader, he sets out on a rare personal mission to ensure his will is done.\n\nFor Syndulla and Isval, it's the opportunity to strike at the very heart of the ruthless dictatorship sweeping the galaxy. And for the Emperor and Darth Vader, Ryloth becomes more than just a matter of putting down an insurrection: When an ambush sends them crashing to the planet's surface, where inhospitable terrain and an army of resistance fighters await them, they will find their relationship tested as never before. With only their lightsabers, the dark side of the Force, and each other to depend on, the two Sith must decide if the brutal bond they share will make them victorious allies or lethal adversaries.",
    "pages": 320,
    "isbn": "9780345511447",
    "asin": "B00MKZ3VUY",
    "audio_asin": "B00VQO3GPU",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/6/6b/Lords_of_the_Sith.jpg/revision/latest/scale-to-width-down/499?cb=20210718053306",
    "audio_narrator": "Jonathan Davis",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 657,
    "timeline_text": "14 BBY",
    "sort_timeline_yavin": -14,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 5,
    "title": "Dark Disciple",
    "sort_title": "Dark Disciple",
    "author": [
      "Christie Golden"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "07/07/2015",
    "pub_date_all": "July 7, 2015 (Hardcover)\nMarch 1, 2016 (Paperback)",
    "pub_summary": "The only way to bring down the Sith's most dangerous warrior may be to join forces with the dark side.\n\n\"Dooku continues his attacks. Stop him, we must,\" Yoda said solemnly....\n\nFinally Mace spoke. \"The question before us now is—who will strike the killing blow?\"\n\nIn the war for control of the galaxy between the armies of the dark side and the Republic, former Jedi Master turned ruthless Sith Lord Count Dooku has grown ever more brutal in his tactics. Despite the powers of the Jedi and the military prowess of their clone army, the sheer number of fatalities is taking a terrible toll. And when Dooku orders the massacre of a flotilla of helpless refugees, the Jedi Council feels it has no choice but to take drastic action: targeting the man responsible for so many war atrocities, Count Dooku himself.\n\nBut the ever-elusive Dooku is dangerous prey for even the most skilled hunter. So the Council makes the bold decision to bring both sides of the Force's power to bear—pairing brash Jedi Knight Quinlan Vos with infamous one-time Sith acolyte Asajj Ventress. Though Jedi distrust for the cunning killer who once served at Dooku's side still runs deep, Ventress's hatred for her former master runs deeper. She's more than willing to lend her copious talents as a bounty hunter—and assassin—to Vos's quest.\n\nTogether, Ventress and Vos are the best hope for eliminating Dooku—as long as the emerging feelings between them don't compromise their mission. But Ventress is determined to have her retribution and at last let go of her dark Sith past. Balancing the complicated emotions she feels for Vos with the fury of her warrior's spirit, she resolves to claim victory on all fronts—a vow that will be mercilessly tested by her deadly enemy . . . and her own doubt.\n\nIn the war for control of the galaxy between the armies of the dark side and the Republic, former Jedi Master turned ruthless Sith Lord Count Dooku has grown ever more brutal in his tactics. And when he orders the massacre of helpless refugees, the Jedi Council can see no alternative but to take drastic action: targeting the Empire's most cold — blooded disciple for assassination. But Dooku is dangerous prey, so the Council decides to bring both sides of the Force to bear - teaming brash Jedi Knight Quinlan Vos with infamous ex-Sith acolyte Asajj Ventress. Through Jedi distrust for the cunning killer who once served Dooku still runs deep, Ventress's hatred for her former master runs deeper. Determined to have vengeance and let go of her Sith past, Ventress must balance her growing feelings for Vos with the fury of her warrior's spirit — and resolves to claim victory on all fronts. It is a vow that will be mercilessly tested by her deadly enemy . . . and her own doubt.",
    "pages": 336,
    "isbn": "9780345511539",
    "asin": "B00PP36DYO",
    "audio_asin": "B00ZAURNZA",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/9/90/Dark_Disciple_Cover.png/revision/latest/scale-to-width-down/500?cb=20141209194455",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 660,
    "timeline_text": "19 BBY",
    "sort_timeline_yavin": -19,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 6,
    "title": "Lost Stars",
    "sort_title": "Lost Stars",
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "09/04/2015",
    "pub_date_all": "September 4, 2015 (Hardcover)\nAugust 1, 2017 (Paperback)",
    "pub_summary": "The reign of the Galactic Empire has reached the Outer Rim planet of Jelucan, where aristocratic Thane Kyrell and rural villager Ciena Ree bond over their love of flying. Enrolling at the Imperial Academy together to become fighter pilots for the glorious Empire is nothing less than a dream come true for the both of them. But Thane sours on the dream when he sees firsthand the horrific tactics the Empire uses to maintain its ironclad rule.\n\nBitter and disillusioned, Thane joins the fledgling Rebellion—putting Ciena in an unbearable position to choose between her loyalty to the Empire and her love for the man she's known since childhood.\n\nNow on opposite sides of the war, will these friends turned foes find a way to be together, or will duty tear them—and the galaxy—apart?",
    "pages": 551,
    "isbn": "9781484724989",
    "asin": "B00YB2HK42",
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/a/a2/LostStars.png/revision/latest/scale-to-width-down/500?cb=20150709005414",
    "audio_narrator": "Pierce Cravens",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 702,
    "timeline_text": "11 BBY–5 ABY",
    "sort_timeline_yavin": -11,
    "series": [
      "Journey to Star Wars > The Force Awakens"
    ],
    "author": [
      "Claudia Gray"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 7,
    "title": "Aftermath",
    "sort_title": "Aftermath",
    "author": [
      "Chuck Wendig"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "09/04/2015",
    "pub_date_all": "September 4, 2015 (Hardcover, eBook)\nMarch 29, 2016 (Paperback)",
    "pub_summary": "Trapped on an isolated world, a desperate group of rebels is all that stands between the galaxy's freedom and the Empire's fury.\n\nThe second Death Star has been destroyed, the Emperor killed, and Darth Vader struck down—devastating blows against the Empire, with major victories for the Rebel Alliance. But the battle for freedom is far from over.\n\nAs the Empire reels from its critical defeats at the Battle of Endor, the Rebel Alliance—now a fledgling New Republic—presses its advantage by hunting down the enemy's scattered forces before they can regroup and retaliate. But above the remote planet Akiva, an ominous show of the enemy's strength is unfolding. Out on a lone reconnaissance mission, pilot Wedge Antilles watches Imperial Star Destroyers gather like birds of prey circling for a kill, but is taken captive before he can report back to the New Republic leaders.\n\nMeanwhile, on the planet's surface, former Rebel fighter Norra Wexley has returned to her native world—war weary, ready to reunite with her estranged son, and eager to build a new life in some distant place. But when Norra intercepts Wedge Antilles's urgent distress call, she realizes her time as a freedom fighter is not yet over. What she doesn't know is just how close the enemy is—or how decisive and dangerous her new mission will be.\n\nDetermined to preserve the Empire's power, the surviving Imperial elite are converging on Akiva for a top-secret emergency summit—to consolidate their forces and rally for a counterstrike. But they haven't reckoned on Norra and her newfound allies—her technical genius son, a Zabrak bounty hunter, and a reprobate Imperial defector—who are prepared to do whatever they must to end the Empire's oppressive reign once and for all.",
    "pages": 410,
    "isbn": "9780345511621",
    "asin": "B00MKZ3VUY",
    "audio_asin": "B011PVXPO0",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/8/88/Aftermath.jpg/revision/latest/scale-to-width-down/500?cb=20170509004040",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 750,
    "timeline_text": "4 ABY",
    "sort_timeline_yavin": 4,
    "series": [
      "The Aftermath Trilogy",
      "Journey to Star Wars > The Force Awakens"
    ],
    "series_order": {
      "The Aftermath Trilogy": 1
    },
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 8,
    "title": "Battlefront: Twilight Company",
    "sort_title": "Battlefront: Twilight Company",
    "author": [
      "Alexander Freed"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "11/03/2015",
    "pub_date_all": "November 3, 2015 (Hardcover, eBook)\nJune 28, 2016 (Paperback)",
    "pub_summary": "The bravest soldiers. The toughest warriors. The ultimate survivors.\n\nAmong the stars and across the vast expanses of space, the Galactic Civil War rages. On the battlefields of multiple worlds in the Mid Rim, legions of ruthless stormtroopers–bent on crushing resistance to the Empire wherever it arises–are waging close and brutal combat against an armada of freedom fighters. In the streets and alleys of ravaged cities, the front-line forces of the Rebel Alliance are taking the fight to the enemy, pushing deeper into Imperial territory and grappling with the savage flesh-and-blood realities of war on the ground.\n\nLeading the charge are the soldiers–men and women, human and nonhuman–of the Sixty-First Mobile Infantry, better known as Twilight Company. Hard-bitten, war-weary, and ferociously loyal to one another, the members of this renegade outfit doggedly survive where others perish, and defiance is their most powerful weapon against the deadliest odds. When orders come down for the Rebels to fall back in the face of superior opposition numbers and firepower, Twilight reluctantly complies. Then an unlikely ally radically changes the strategic equation–and gives the Alliance's hardest-fighting warriors a crucial chance to turn retreat into resurgence.\n\nOrders or not, alone and outgunned but unbowed, Twilight Company locks, loads, and prepares to make its boldest maneuver–trading down-and-dirty battle in the trenches for a game-changing strike at the ultimate target: the very heart of the Empire's military machine.",
    "pages": 397,
    "isbn": "9780345511218",
    "asin": "B00R04OX20",
    "audio_asin": "B011PVWSGQ",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/9/91/Battlefront_Twilight_Company_cover.jpg/revision/latest/scale-to-width-down/500?cb=20150828172004",
    "audio_narrator": "Jonathan Davis",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 838,
    "timeline_text": "6 BBY–3 ABY",
    "sort_timeline_yavin": -6,
    "series": [
      "Battlefront"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 9,
    "title": "Bloodline",
    "sort_title": "Bloodline",
    "author": [
      "Claudia Gray"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "05/03/2016",
    "pub_date_all": "May 3, 2016 (Hardcover, eBook)\nJanuary 31, 2017 (Paperback)",
    "pub_summary": "WITNESS THE BIRTH OF THE RESISTANCE\n\nWhen the Rebellion defeated the Empire in the skies above Endor, Leia Organa believed it was the beginning to a lasting peace. But after decades of vicious infighting and partisan gridlock in the New Republic Senate, that hope seems like a distant memory.\n\nNow a respected senator, Leia must grapple with the dangers that threaten to cripple that fledging democracy—from both within and without. Underworld kingpins, treacherous politicians, and Imperial loyalists are sowing chaos in the galaxy. Desperate to take action, senators are calling for the election of a First Senator. It is their hope that this influential post will bring strong leadership to a divided galaxy.\n\nAs the daughter of Darth Vader, Leia faces with distrust the prospect of any one person holding such a powerful position—even when supporters suggest Leia herself for the job. But a new enemy may make this path Leia's only option. For at the edges of the galaxy, a mysterious threat is growing....",
    "pages": 341,
    "isbn": "9780345511362",
    "asin": "B00Z3G1VU4",
    "audio_asin": "B01CRMO9BE",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/0/0b/SW_Bloodline_cover.jpg/revision/latest/scale-to-width-down/500?cb=20160206211144",
    "audio_narrator": "January LaVoy",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 750,
    "timeline_text": "28 ABY",
    "sort_timeline_yavin": 28,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 10,
    "title": "Life Debt",
    "sort_title": "Life Debt",
    "author": [
      "Chuck Wendig"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "07/12/2016",
    "pub_date_all": "July 12, 2016 (Hardcover, eBook)\nMarch 28, 2017 (Paperback)",
    "pub_summary": "The galaxy is changing, and with peace now a possibility, some dare to imagine new beginnings and new destinies. For Han Solo, that means settling his last outstanding debt, by helping Chewbacca liberate the Wookiee's home world of Kashyyyk.\n\nMeanwhile, Norra Wexley and her band of rebels pursue Admiral Rae Sloane and the remaining Imperial leadership across the galaxy. Sloane, increasingly wary of the mysterious fleet admiral, desperately searches for a means to save the crumbling Empire from oblivion. Even as Imperial forces fight to regain lost ground, Princess Leia and the New Republic seek to broker a lasting peace.\n\nBut the rebel's hunt for Admiral Sloane is cut short after the disappearance of Han Solo and Chewbacca. Desperate to save them, Leia conscripts Norra, Sinjir, Jas, and the rest of their team to find the missing smugglers and help them in their fight for freedom.",
    "pages": 448,
    "isbn": "9781101966938",
    "asin": "B015LZ04OK",
    "audio_asin": "B01CRN2KBY",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/8/80/AftermathLifeDebt-Hardcover.jpg/revision/latest/scale-to-width-down/500?cb=20170509144831",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 930,
    "timeline_text": "5 ABY",
    "sort_timeline_yavin": 5,
    "series": [
      "The Aftermath Trilogy"
    ],
    "series_order": {
      "The Aftermath Trilogy": 2
    },
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 11,
    "title": "Ahsoka",
    "sort_title": "Ahsoka",
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "10/11/2016",
    "pub_date_all": "October 11, 2016 (Hardcover, eBook)\nOctober 3, 2017 (Paperback)",
    "pub_summary": "Ahsoka Tano, fan favorite character from Star Wars: The Clone Wars and Star Wars Rebels, will be the star of her own young adult novel from Disney Lucasfilm Press this October 11, 2016! Fans have long wondered what happened to Ahsoka after she left the Jedi Order near the end of the Clone Wars, and before she re-appeared as the mysterious Rebel operative Fulcrum in Rebels. Finally, her story will begin to be told. Following her experiences with the Jedi and the devastation of Order 66, Ahsoka is unsure she can be part of a larger whole ever again. But her desire to fight the evils of the Empire and protect those who need it will lead her right to Bail Organa, and the Rebel Alliance....",
    "pages": 356,
    "isbn": "1484705661",
    "asin": "1484705661",
    "audio_asin": "B01M0YKIZA",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/d/d3/Ahsoka_novel_cover.png/revision/latest/scale-to-width-down/500?cb=20160715164545",
    "audio_narrator": "Ashley Eckstein",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 424,
    "timeline_text": "18 BBY",
    "sort_timeline_yavin": -18,
    "series": [],
    "author": [
      "E. K. Johnston"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 12,
    "title": "Catalyst",
    "sort_title": "Catalyst",
    "author": [
      "James Luceno"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "11/15/2016",
    "pub_date_all": "November 15, 2016 (Hardcover, eBook)\nMay 2, 2017 (Paperback)",
    "pub_summary": "Lauded Star Wars author James Luceno returns to pen an intense tale of ambition and betrayal that sets the stage for Rogue One: A Star Wars Story.\n\nWar is tearing the galaxy apart. For years the Republic and the Separatists have battled across the stars, each building more and more deadly technology in an attempt to win the war. As a member of Chancellor Palpatine's top secret Death Star project, Orson Krennic is determined to develop a superweapon before their enemies can. And an old friend of Krennic's, the brilliant scientist Galen Erso, could be the key.\n\nGalen's energy-focused research has captured the attention of both Krennic and his foes, making the scientist a crucial pawn in the galactic conflict. But after Krennic rescues Galen, his wife, Lyra, and their young daughter, Jyn, from Separatist kidnappers, the Erso family is deeply in Krennic's debt. Krennic then offers Galen an extraordinary opportunity: to continue his scientific studies with every resource put utterly at his disposal. While Galen and Lyra believe that his energy research will be used purely in altruistic ways, Krennic has other plans that will finally make the Death Star a reality. Trapped in their benefactor's tightening grasp, the Ersos must untangle Krennic's web of deception to save themselves and the galaxy itself.",
    "pages": 330,
    "isbn": "9780345511492",
    "asin": "345511492",
    "audio_asin": "B01J6GNS9I",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/9/92/Catalyst_A_Rogue_One_Novel.png/revision/latest/scale-to-width-down/500?cb=20180211055827",
    "audio_narrator": "Jonathan Davis",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 660,
    "timeline_text": "21 BBY–17 BBY",
    "sort_timeline_yavin": -21,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 13,
    "title": "Thrawn",
    "sort_title": "Thrawn",
    "author": [
      "Timothy Zahn"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "04/11/2017",
    "pub_date_all": "April 11, 2017 (Hardcover, eBook)\nApril 13, 2017 (Star Wars Celebration Orlando 2017 Limited Edition)\nJanuary 30, 2018 (Paperback)",
    "pub_summary": "\"I study the art of war. Work to perfect it.\" —Grand Admiral Thrawn\n\nOne of the most cunning and ruthless warriors in the history of the Galactic Empire, Grand Admiral Thrawn is also one of the most captivating characters in Star Wars . From his introduction in bestselling author Timothy Zahn's classic Heir to the Empire, through his continuing adventures in Dark Force Rising, The Last Command, and beyond, Grand Admiral Thrawn has earned an iconic status among Star Wars' greatest villains. But Thrawn's origins and the story of his rise in the Imperial ranks have remained mysterious. Now, in Star Wars: Thrawn, Timothy Zahn chronicles the fateful events that launched the blue-skinned, red-eyed master of military strategy and lethal warfare into the highest realms of power—and infamy.\n\nAfter Thrawn is rescued from exile by Imperial soldiers, his deadly ingenuity and keen tactical abilities swiftly capture the attention of Emperor Palpatine. And just as quickly, Thrawn proves to be as indispensable to the Empire as he is ambitious; as devoted as its most loyal servant, Darth Vader; and a brilliant warrior never to be underestimated. On missions to rout smugglers, snare spies, and defeat pirates, he triumphs time and again—even as his renegade methods infuriate superiors while inspiring ever greater admiration from the Empire. As one promotion follows another in his rapid ascension to greater power, he schools his trusted aide, Ensign Eli Vanto, in the arts of combat and leadership, and the secrets of claiming victory. But even though Thrawn dominates the battlefield, he has much to learn in the arena of politics where ruthless administrator Arihnda Pryce holds the power to be a potent ally or a brutal enemy.\n\nAll these lessons will be put to the ultimate test when Thrawn rises to admiral—and must pit all the knowledge, instincts, and battle forces at his command against an insurgent uprising that threatens not only innocent lives but also the Empire's grip on the galaxy—and his own carefully laid plans for future ascendancy.",
    "pages": 427,
    "isbn": "9780345511270",
    "asin": "B01ILZO30S",
    "audio_asin": "B01MTYYPKY",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/1/14/SoCalledThrawnNovel.png/revision/latest/scale-to-width-down/499?cb=20160805194404",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 1020,
    "timeline_text": "15 BBY–2 BBY",
    "sort_timeline_yavin": -15,
    "series": [
      "The Imperial Trilogy"
    ],
    "series_order": {
      "The Imperial Trilogy": 1
    },
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 14,
    "title": "Rebel Rising",
    "sort_title": "Rebel Rising",
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "05/02/2017",
    "pub_date_all": "May 2, 2017 (Hardcover, eBook)\nAugust 7, 2018 (Paperback)",
    "pub_summary": "When Jyn Erso is eight years old, her mother is murdered and her father taken from her to serve the Empire. But despite the loss of her parents, she is not completely alone. Saw Gerrera, a man willing to go to any extremes necessary to resist Imperial tyranny, takes her in as his own daughter and gives her not only a home but all the abilities and resources she needs to become a rebel.\n\nJyn dedicates herself to the cause—and the man. But fighting alongside Saw and his people brings with it danger and the question of just how far Jyn is willing to go as one of Saw's soldiers. When she faces an unthinkable betrayal that shatters her world, Jyn will have to pull the pieces of herself back together and figure out what she truly believes in…and whom she can really trust.",
    "pages": 410,
    "isbn": "9781484780831",
    "asin": "B01N9QS8E4",
    "audio_asin": "B06XT8G4NB",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/4/41/RebelRising-Hardcover.jpg/revision/latest/scale-to-width-down/500?cb=20180121202424",
    "audio_narrator": "Rebecca Soler",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 593,
    "timeline_text": "13 BBY–1 BBY",
    "sort_timeline_yavin": -13,
    "series": [],
    "author": [
      "Beth Revis"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 15,
    "title": "Empire's End",
    "sort_title": "Empire's End",
    "author": [
      "Chuck Wendig"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "02/21/2017",
    "pub_date_all": "February 21, 2017 (Hardcover, eBook)\nAugust 29, 2017 (Paperback)",
    "pub_summary": "Following Star Wars: Aftermath and Star Wars: Life Debt, Chuck Wendig delivers the exhilarating conclusion to the New York Times bestselling trilogy set in the years between Return of the Jedi and The Force Awakens.\n\nAs the final showdown between the New Republic and the Empire draws near, all eyes turn to a once-isolated planet: Jakku.\n\nThe Battle of Endor shattered the Empire, scattering its remaining forces across the galaxy. But the months following the Rebellion's victory have not been easy. The fledgling New Republic has suffered a devastating attack from the Imperial remnant, forcing the new democracy to escalate their hunt for the hidden enemy.\n\nFor her role in the deadly ambush, Grand Admiral Rae Sloane is the most wanted Imperial war criminal—and one-time rebel pilot Norra Wexley, back in service at Leia's urgent request, is leading the hunt. But more than just loyalty to the New Republic drives Norra forward: Her husband was turned into a murderous pawn in Sloane's assassination plot, and now she wants vengeance as much as justice.\n\nBut Sloane, too, is on a furious quest: pursuing the treacherous Gallius Rax to the barren planet Jakku. As the true mastermind behind the Empire's devastating attack, Rax has led the Empire to its defining moment. The cunning strategist has gathered the powerful remnants of the Empire's war machine, preparing to execute the late Emperor Palpatine's final plan. As the Imperial fleet orbits Jakku, an armada of Republic fighters closes in to finish what began at Endor. Norra and her crew soar into the heart of an apocalyptic clash that will leave land and sky alike scorched. And the future of the galaxy will finally be decided.",
    "pages": 423,
    "isbn": "9781101966969",
    "asin": "B01FC048RS",
    "audio_asin": "B01MRSYSI4",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/9/9c/Aftermath-EmpiresEnd-Hardcover.png/revision/latest/scale-to-width-down/500?cb=20170225022028",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 960,
    "timeline_text": "5 ABY",
    "sort_timeline_yavin": 5,
    "series": [
      "The Aftermath Trilogy"
    ],
    "series_order": {
      "The Aftermath Trilogy": 3
    },
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 16,
    "title": "Battlefront II: Inferno Squad",
    "sort_title": "Battlefront II: Inferno Squad",
    "author": [
      "Christie Golden"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "07/25/2017",
    "pub_date_all": "July 19, 2017 (San Diego Comic-Con 2017 Limited Convention Edition)\nJuly 25, 2017 (Hardcover, eBook)\nNovember 14, 2017 (Target Exclusive Edition)\nMarch 27, 2018 (Paperback)",
    "pub_summary": "'The Rebellion may have heroes like Jyn Erso and Luke Skywalker. But the Empire has Inferno Squad.'\n\nAfter the humiliating theft of the Death Star plans and the resulting destruction of the battle station, the Empire is on the defensive. In response to this stunning defeat, the Imperial Navy has authorized the formation of an elite team of soldiers, known as Inferno Squad. Their mission: infiltrate and eliminate the remnants of Saw Gerrera's Partisans. Following the death of their leader, the Partisans have carried on his extremist legacy, determined to thwart the Empire—no matter what the cost. Now, Inferno Squad must prove their status as the best of the best and take down the Partisans from within. But as the danger intensifies and the threat of discovery grows, how far will Inferno Squad go to ensure the safety of the Empire?",
    "pages": 336,
    "isbn": "9781524796808",
    "asin": "B01N6W2SWY",
    "audio_asin": "B06ZY1VRRH",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/b/b6/Star_Wars_Battlefront_II_Inferno_Squad.jpg/revision/latest/scale-to-width-down/500?cb=20170727214334",
    "audio_narrator": "Janina Gavankar",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 622,
    "timeline_text": "0 ABY",
    "sort_timeline_yavin": null,
    "series": [
      "Battlefront"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 17,
    "title": "Phasma",
    "sort_title": "Phasma",
    "author": [
      "Delilah S. Dawson"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "09/01/2017",
    "pub_date_all": "September 1, 2017 (Hardcover, eBook)\nApril 24, 2018 (Paperback)",
    "pub_summary": "Discover Captain Phasma's mysterious history in this \"Journey to Star Wars: The Last Jedi\" novel.\n\nOne of the most cunning and merciless officers of the First Order, Captain Phasma commands the favor of her superiors, the respect of her peers, and the terror of her enemies. But for all her renown, Phasma remains as virtually unknown as the impassive expression on her gleaming chrome helmet. Now, an adversary is bent on unearthing her mysterious origins—and exposing a secret she guards as zealously and ruthlessly as she serves her masters.\n\nDeep inside the Battlecruiser Absolution, a captured Resistance spy endures brutal interrogation at the hands of a crimson-armored stormtrooper—Cardinal. But the information he desires has nothing to do with the Resistance or its covert operations against the First Order.\n\nWhat the mysterious stormtrooper wants is Phasma's past—and with it whatever long-buried scandal, treachery, or private demons he can wield against the hated rival who threatens his own power and privilege in the ranks of the First Order. His prisoner has what Cardinal so desperately seeks, but she won't surrender it easily. As she wages a painstaking war of wills with her captor, bargaining for her life in exchange for every precious revelation, the spellbinding chronicle of the inscrutable Phasma unfolds. But this knowledge may prove more than just dangerous once Cardinal possesses it—and once his adversary unleashes the full measure of her fury.",
    "pages": 380,
    "isbn": "9781524796310",
    "asin": "B071YBLDCB",
    "audio_asin": "B074CMPKG3",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/f/f2/Phasma-Hardcover.png/revision/latest/scale-to-width-down/500?cb=20170630180824",
    "audio_narrator": "January LaVoy",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 750,
    "timeline_text": "34 ABY",
    "sort_timeline_yavin": 34,
    "series": [
      "Journey to Star Wars > The Last Jedi"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 18,
    "title": "Leia, Princess of Alderaan",
    "sort_title": "Leia, Princess of Alderaan",
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "09/01/2017",
    "pub_date_all": "September 1, 2017 (Hardcover)\nNovember 6, 2018 (Paperback)",
    "pub_summary": "It is Leia Organa's sixteenth birthday and she participates in the traditional ceremony where she declares her intention to one day take the throne of Alderaan. But she's much more concerned about the way her parents are acting lately: lots of meetings and late dinners and not talking to her as much as they used to. Eventually she discovers the reason for their secrecy: their involvement in the increasingly organized rebellion. When Leia decides to become involved herself in the fight against the Empire, whether her parents approve or not, she will have to prove to them that she is a valuable asset who must be allowed to take a stand, regardless of the risk to herself. Her stand will also put her at odds with a pacifist young Alderaanian man who gives Leia her first kiss…and her first real loss.",
    "pages": 416,
    "isbn": "9781484780787",
    "asin": "B06ZY49H5J",
    "audio_asin": "B074CMXKJ4",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/1/11/LeiaPrincessofAlderaan-Hardcover.jpg/revision/latest/scale-to-width-down/500?cb=20170708131542",
    "audio_narrator": "Saskia Maarleveld",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 594,
    "timeline_text": "3 BBY",
    "sort_timeline_yavin": -3,
    "series": [
      "Journey to Star Wars > The Last Jedi"
    ],
    "author": [
      "Claudia Gray"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 19,
    "title": "Last Shot",
    "sort_title": "Last Shot",
    "author": [
      "Daniel José Older"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "04/17/2018",
    "pub_date_all": "April 17, 2018 (Hardcover, eBook)\nOctober 30, 2018 (Paperback)",
    "pub_summary": "Even the fastest ship in the galaxy can't outrun the past....\n\nTHEN:\n\nIt's one of the galaxy's most dangerous secrets: a mysterious transmitter with unknown power and a reward for its discovery that most could only dream of claiming. But those who fly the Millennium Falcon throughout its infamous history aren't your average scoundrels. Not once, but twice, the crew of the Falcon tries to claim the elusive prize—first, Lando Calrissian and the droid L3-37 at the dawn of an ambitious career, and later, a young and hungry Han Solo with the help of his copilot, Chewbacca. But the device's creator, the volatile criminal Fyzen Gor, isn't interested in sharing. And Gor knows how to hold a grudge....\n\nNOW:\n\nIt's been ten years since the rebel hero Han Solo last encountered Fyzen Gor. After mounting a successful rebellion against the Empire and starting a family with an Alderaanian princess, Han hasn't given much thought to the mad inventor. But when Lando turns up at Han's doorstep in the middle of the night, it's Fyzen's assassins that he's running from. And without Han's help, Lando—and all life on Cloud City—will be annihilated.\n\nWith the assistance of a young hotshot pilot, an Ewok slicer prodigy, the woman who might be the love of Lando's life, and Han's best and furriest friend, the two most notorious scoundrels in the New Republic are working together once more. They'll have to journey across the stars—and into the past—before Gor uses the device's power to reshape the galaxy.",
    "pages": 368,
    "isbn": "9780525622130",
    "asin": "B079KSMJHG",
    "audio_asin": "B079VQJNXL",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/4/49/Last_Shot_Han_cover.jpg/revision/latest/scale-to-width-down/500?cb=20180416204915",
    "audio_narrator": "Marc ThompsonDaniel José OlderJanuary LaVoy",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 660,
    "timeline_text": "7 ABY",
    "sort_timeline_yavin": 7,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 20,
    "title": "Most Wanted",
    "sort_title": "Most Wanted",
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "05/25/2018",
    "pub_date_all": "May 25, 2018",
    "pub_summary": "Set before the events of Solo: A Star Wars Story! Han and Qi'ra don't have a lot in common other than not having a lot. They're street kids on the industrial planet Corellia, doing whatever it takes to get by, dreaming of something more. They each jump at a chance to prove themselves in the perilous world of Corellia's criminal underbelly, only to discover they are on the same mission for the same unscrupulous boss. When the job goes disastrously wrong, Han and Qi'ra are on the run–from pirates, a droid crime syndicate, the Empire, and their boss–and will have to learn to trust each other if they are going to survive.",
    "pages": 352,
    "isbn": "9781368016308",
    "asin": "B079VVNP7P",
    "audio_asin": "B07BL4DSD6",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/6/60/Most_Wanted_book_cover.jpg/revision/latest/scale-to-width-down/500?cb=20180217015536",
    "audio_narrator": "Saskia Maarleveld",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 476,
    "timeline_text": "13 BBY",
    "sort_timeline_yavin": -13,
    "series": [],
    "author": [
      "Rae Carson"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 21,
    "title": "Thrawn: Alliances",
    "sort_title": null,
    "author": [
      "Timothy Zahn"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "07/24/2018",
    "pub_date_all": "July 24, 2018 (Hardcover, eBook)\nFebruary 26, 2019 (Paperback)",
    "pub_summary": "Grand Admiral Thrawn and Darth Vader ally against a threat to the Empire in this new novel from bestselling author Timothy Zahn.\n\n\"I have sensed a disturbance in the Force.\"\n\nOminous words under any circumstances, but all the more so when uttered by Emperor Palpatine. On Batuu, at the edges of the Unknown Regions, a threat to the Empire is taking root—its existence little more than a glimmer, its consequences as yet unknowable. But it is troubling enough to the Imperial leader to warrant investigation by his most powerful agents: ruthless enforcer Lord Darth Vader and brilliant strategist Grand Admiral Thrawn. Fierce rivals for the emperor's favor, and outspoken adversaries on Imperial affairs—including the Death Star project—the formidable pair seem unlikely partners for such a crucial mission. But the Emperor knows it's not the first time Vader and Thrawn have joined forces. And there's more behind his royal command than either man suspects.\n\nIn what seems like a lifetime ago, General Anakin Skywalker of the Galactic Republic, and Commander Mitth'raw'nuruodo, officer of the Chiss Ascendancy, crossed paths for the first time. One on a desperate personal quest, the other with motives unknown…and undisclosed. But facing a gauntlet of dangers on a far-flung world, they forged an uneasy alliance—neither remotely aware of what their futures held in store.\n\nNow, thrust together once more, they find themselves bound again for the planet where they once fought side by side. There they will be doubly challenged—by a test of their allegiance to the Empire…and an enemy that threatens even their combined might.",
    "pages": 342,
    "isbn": "9780525480488",
    "asin": "B07692QXW3",
    "audio_asin": "B077Y7PLS4",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/c/c8/Thrawn_Alliances_cover.png/revision/latest/scale-to-width-down/499?cb=20200826220634",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 810,
    "timeline_text": "19 BBY–1 BBY",
    "sort_timeline_yavin": -19,
    "series": [
      "The Imperial Trilogy"
    ],
    "series_order": {
      "The Imperial Trilogy": 2
    },
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 22,
    "title": "Queen's Shadow",
    "sort_title": "Queen's Shadow",
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "03/05/2019",
    "pub_date_all": "March 5, 2019 (Hardcover, eBook)\nMay 2, 2019 (Paperback)",
    "pub_summary": "The end of her reign is just the beginning....\n\nWhen Padmé Amidala steps down from her position as Queen of Naboo, she is ready to set aside her title and return to life out of the spotlight. But to her surprise, the new queen asks Padmé to continue serving their people—this time in the Galactic Senate. Padmé is unsure about the new role but cannot turn down the request, especially since, thanks to her dearest friend—and decoy—Sabé, she can be in two places at once. So while Padmé plunges into politics, Sabé sets off on a mission dear to Padmé's heart.\n\nOn the glistening capital planet Coruscant, Padmé's new Senate colleagues regard her with curiosity—and with suspicion for her role in ousting the previous chancellor. Posing as a merchant on Tatooine, Sabé has fewer resources than she thought and fewer options than she needs.\n\nTogether with Padmé's loyal handmaidens, Padmé and Sabé must navigate treacherous politics, adapt to constantly changing landscapes, and forge a new identity beyond the queen's shadow.",
    "pages": 352,
    "isbn": "9781368024259",
    "asin": "B07FR2JJ7L",
    "audio_asin": "B07M8YJFCH",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/0/0e/QueensShadow.png/revision/latest/scale-to-width-down/500?cb=20190305210550",
    "audio_narrator": "Catherine Taber",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 502,
    "timeline_text": "28 BBY",
    "sort_timeline_yavin": -28,
    "series": [
      "Queen's Series"
    ],
    "author": [
      "E. K. Johnston"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 23,
    "title": "Master & Apprentice",
    "sort_title": "Master & Apprentice",
    "author": [
      "Claudia Gray"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "04/16/2019",
    "pub_date_all": "April 16, 2019 (Hardcover, eBook)\nSeptember 24, 2019 (Paperback)",
    "pub_summary": "An unexpected offer threatens the bond between Qui-Gon Jinn and Obi-Wan Kenobi as the two Jedi navigate a dangerous new planet and an uncertain future.\n\nA Jedi must be a fearless warrior, a guardian of justice, and a scholar in the ways of the Force. But perhaps a Jedi's most essential duty is to pass on what they have learned. Master Yoda trained Dooku; Dooku trained Qui-Gon Jinn; and now Qui-Gon has a Padawan of his own. But while Qui-Gon has faced all manner of threats and danger as a Jedi, nothing has ever scared him like the thought of failing his apprentice.\n\nObi-Wan Kenobi has deep respect for his Master, but struggles to understand him. Why must Qui-Gon so often disregard the laws that bind the Jedi? Why is Qui-Gon drawn to ancient Jedi prophecies instead of more practical concerns? And why wasn't Obi-Wan told that Qui-Gon is considering an invitation to join the Jedi Council—knowing it would mean the end of their partnership? The simple answer scares him: Obi-Wan has failed his Master.\n\nWhen Jedi Rael Averross, another former student of Dooku, requests their assistance with a political dispute, Jinn and Kenobi travel to the royal court of Pijal for what may be their final mission together. What should be a simple assignment quickly becomes clouded by deceit, and by visions of violent disaster that take hold in Qui-Gon's mind. As Qui-Gon's faith in prophecy grows, Obi-Wan's faith in him is tested—just as a threat surfaces that will demand that Master and apprentice come together as never before, or be divided forever.",
    "pages": 330,
    "isbn": "9780525619376",
    "asin": "B07FVMNBWW",
    "audio_asin": "B07FTDBKGZ",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/c/c5/MasterApprentice-Hardcover.jpg/revision/latest/scale-to-width-down/500?cb=20181007232310",
    "audio_narrator": "Jonathan Davis",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 690,
    "timeline_text": "40 BBY",
    "sort_timeline_yavin": -40,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 24,
    "title": "Alphabet Squadron",
    "sort_title": "Alphabet Squadron",
    "author": [
      "Alexander Freed"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "06/11/2019",
    "pub_date_all": "June 11, 2019 (Hardcover, eBook)\nDecember 31, 2019 (Paperback)",
    "pub_summary": "On the verge of victory in a brutal war, five New Republic pilots transform from hunted to hunters in this epic STAR WARS adventure. Set after Return of the Jedi, Alphabet Squadron follows a unique team, each flying a different class of starfighter as they struggle to end their war once and for all.\n\nThe Emperor is dead. His final weapon has been destroyed. The Imperial Army is in disarray. In the aftermath, Yrica Quell is just one of thousands of defectors from her former cause living in a deserters' shantytown—until she is selected to join Alphabet Squadron.\n\nCobbled together from an eclectic assortment of pilots and starfighters, the five members of Alphabet are tasked by New Republic general Hera Syndulla herself. Like Yrica, each is a talented pilot struggling to find their place in a changing galaxy. Their mission: to track down and destroy the mysterious Shadow Wing, a lethal force of TIE fighters exacting bloody, reckless vengeance in the twilight of their reign.\n\nThe newly formed unit embodies the heart and soul of the Rebellion: ragtag, resourceful, scrappy, and emboldened by their most audacious victory in decades. But going from underdog rebels to celebrated heroes isn't as easy as it seems, and their inner demons threaten them as much as their enemies among the stars. The wayward warriors of Alphabet Squad will have to learn to fly together if they want to protect the new era of peace they've fought so hard to achieve.",
    "pages": 432,
    "isbn": "9781984821980",
    "asin": "B07J4BKDRC",
    "audio_asin": "1984889931",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/6/66/AlphabetSquadron-CrossoverCover.png/revision/latest/scale-to-width-down/500?cb=20190224104809",
    "audio_narrator": "Saskia Maarleveld",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 840,
    "timeline_text": "4 ABY",
    "sort_timeline_yavin": 4,
    "series": [
      "Alphabet Squadron"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 25,
    "title": "Thrawn: Treason",
    "sort_title": "Treason",
    "author": [
      "Timothy Zahn"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "07/23/2019",
    "pub_date_all": "July 23, 2019 (Hardcover, eBook)\nMarch 31, 2020 (Paperback)",
    "pub_summary": "Grand Admiral Thrawn faces the ultimate test of his loyalty to the Empire in this epic Star Wars novel from bestselling author Timothy Zahn.\n\n\"If I were to serve the Empire, you would command my allegiance.\"\n\nSuch was the promise Grand Admiral Thrawn made to Emperor Palpatine at their first meeting. Since then, Thrawn has been one of the Empire's most effective instruments, pursuing its enemies to the very edges of the known galaxy. But as keen a weapon as Thrawn has become, the Emperor dreams of something far more destructive.\n\nNow, as Thrawn's TIE defender program is halted in favor of Director Krennic's secret Death Star project, he realizes that the balance of power in the Empire is measured by more than just military acumen or tactical efficiency. Even the greatest intellect can hardly compete with the power to annihilate entire planets.\n\nAs Thrawn works to secure his place in the Imperial hierarchy, his former protégé Eli Vanto returns with a dire warning about Thrawn's homeworld. Thrawn's mastery of strategy must guide him through an impossible choice: duty to the Chiss Ascendancy, or fealty to the Empire he has sworn to serve. Even if the right choice means committing treason.",
    "pages": 333,
    "isbn": "9781984820983",
    "asin": "B07L7SSJ5K",
    "audio_asin": "1984889966",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/3/3f/ThrawnTreason.jpg/revision/latest/scale-to-width-down/500?cb=20190204205531",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 780,
    "timeline_text": "1 BBY",
    "sort_timeline_yavin": -1,
    "series": [
      "The Imperial Trilogy"
    ],
    "series_order": {
      "The Imperial Trilogy": 3
    },
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 26,
    "title": "A Crash of Fate",
    "sort_title": "Crash of Fate",
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "08/06/2019",
    "pub_date_all": "August 6, 2019",
    "pub_summary": "Izzy and Jules were childhood best friends, climbing the spires of Batuu, inventing silly games, and dreaming of adventures they would share one day. Then Izzy's family left abruptly, without even a chance to say good-bye. Izzy's life became one of constant motion, from one world to the next, until her parents were killed and she became a low-level smuggler to make ends meet. Jules remained on Batuu, eventually becoming a farmer like his father, but always yearning for something more.\n\nNow, thirteen years after she left, Izzy has returned to Batuu. She's been hired to deliver a mysterious parcel, and she just wants to finish the job and get gone. But upon arrival at Black Spire Outpost, she runs smack into the one person who still means something to her after all this time: Jules. And the attraction between them is instant and overwhelming.\n\nYet despite Jules seeming to be everything she's ever needed, Izzy hesitates. How can she drag such a good-hearted man into the perilous life she's chosen?\n\nJules has been unsure what his future holds, and now all he knows for certain is that he wants to be with Izzy. How can he convince her to take a chance on someone who's never left the safety of his homeworld?\n\nWhen Izzy's job goes wrong, the two childhood friends find themselves on the run. And all their secrets will be revealed as they fight to stay alive....",
    "pages": 352,
    "isbn": "9781368048538",
    "asin": "B07P1DYPQF",
    "audio_asin": "0593152603",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/8/8a/ACrashofFate.png/revision/latest/scale-to-width-down/499?cb=20190808231603",
    "audio_narrator": "Brittany Pressley",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 475,
    "timeline_text": "34 ABY",
    "sort_timeline_yavin": 34,
    "series": [
      "Galaxy's Edge"
    ],
    "author": [
      "Zoraida Córdova"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 27,
    "title": "Galaxy's Edge: Black Spire",
    "sort_title": "Black Spire",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "08/27/2019",
    "pub_date_all": "August 27, 2019 (Hardcover, eBook)\nJune 30, 2020 (Paperback)",
    "pub_summary": "Walk the ancient streets, meet the colorful characters, and uncover the secret history of Star Wars: Galaxy's Edge, the upcoming expansion to the Disney Parks experience!\n\nAfter devastating losses at the hands of the First Order, General Leia Organa has dispatched her agents across the galaxy in search of allies, sanctuary, and firepower—and her top spy, Vi Moradi, may have just found all three, on a secluded world at the galaxy's edge.\n\nA planet of lush forests, precarious mountains, and towering, petrified trees, Batuu is on the furthest possible frontier of the galactic map, the last settled world before the mysterious expanse of Wild Space. The rogues, smugglers, and adventurers who eke out a living on the largest settlement on the planet, Black Spire Outpost, are here to avoid prying eyes and unnecessary complications. Vi, a Resistance spy on the run from the First Order, is hardly a welcome guest. And when a shuttle full of stormtroopers lands in her wake, determined to root her out, she has no idea where to find help.\n\nTo survive, Vi will have to seek out the good-hearted heroes hiding in a world that redefines scum and villainy. With the help of a traitorous trooper and her acerbic droid, she begins to gather a colorful band of outcasts and misfits, and embarks on a mission to spark the fire of resistance on Batuu—before the First Order snuffs it out entirely.",
    "pages": 400,
    "isbn": "9780593128381",
    "asin": "B07N5J1XX5",
    "audio_asin": "B07NJ54S7D",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/b/b6/GalaxysEdgeBlackSpire.png/revision/latest/scale-to-width-down/500?cb=20190325201402",
    "audio_narrator": "January LaVoy",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 780,
    "timeline_text": "34 ABY",
    "sort_timeline_yavin": 34,
    "series": [
      "Galaxy's Edge"
    ],
    "author": [
      "Delilah S. Dawson"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 28,
    "title": "Resistance Reborn",
    "sort_title": "Resistance Reborn",
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "11/5/2019",
    "pub_date_all": "November 5, 2019 (Hardcover, eBook)\nAugust 25, 2020 (Paperback)",
    "pub_summary": "The Resistance is in ruins. In the wake of their harrowing escape from Crait, what was once an army has been reduced to a handful of wounded heroes. Finn, Poe, Rey, Rose, Chewbacca, Leia Organa—their names are famous among the oppressed worlds they fight to liberate. But names can only get you so far, and Leia's last desperate call for aid has gone unanswered.\n\nFrom the jungles of Ryloth to the shipyards of Corellia, the shadow of the First Order looms large, and those with the bravery to face the darkness are scattered and isolated. If hope is to survive, the Resistance must journey throughout the galaxy, seeking out more leaders—including those who, in days gone by, helped a nascent rebellion topple an empire. Battles will be fought, alliances will be forged, and the Resistance will be reborn.",
    "pages": 320,
    "isbn": "9780593128428",
    "asin": "B07RLV3NCP",
    "audio_asin": "B07RLQTPZY",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/4/4b/Resistance-reborn-final-cover.jpg/revision/latest/scale-to-width-down/500?cb=20191101221804",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 690,
    "timeline_text": "34 ABY",
    "sort_timeline_yavin": 34,
    "series": [
      "Journey to Star Wars > The Rise of Skywalker"
    ],
    "author": [
      "Rebecca Roanhorse"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 29,
    "title": "Force Collector",
    "sort_title": "Force Collector",
    "author": [
      "Kevin Shinick"
    ],
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "10/04/2019",
    "pub_date_all": "November 19, 2019",
    "pub_summary": "Karr is a teenage boy like many others in the galaxy. He goes to school, helps his parents with the family business, likes speeders and droids. But Karr also has a secret: when he touches certain objects, he gets searing headaches and blacks out. And along with the pain sometimes come visions of people he doesn't know and places he's never been.\n\nKarr's parents worry that he's sick; his grandmother is convinced the visions come from the Force. But it's been years since anyone has heard from the last of the Jedi—Luke Skywalker. Are there any Jedi left to guide Karr in the use of his abilities? Is anyone even willing to talk about the Jedi and what happened to them, as their memory continues to fade and the First Order rises? Stuck on his isolated home planet, Karr becomes a collector of historical artifacts, hoping to one day find an object that will give him a vision about the secrets of the Jedi.\n\nWhen his grandmother dies and his parents announce they're sending him away to a school on the other side of the planet, Karr reaches his breaking point. He needs to know what his destiny holds, and whether the Jedi are involved. Accompanied by Maize, the blunt, unpredictable new girl at school with ties to the First Order, and RZ-7, Karr's solicitous droid companion, he sets off into the larger galaxy to find the truth. His adventures will take him from Utapau to Jakku to Takodana and beyond as he learns more about the Jedi than he could have expected…and about his own place in the Force.",
    "pages": 384,
    "isbn": "9781405295413",
    "asin": "B07RPF789X",
    "audio_asin": "B07RV3RR7K",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/8/8c/ForceCollector-Egmont.jpg/revision/latest/scale-to-width-down/350?cb=20191025191801",
    "audio_narrator": "Euan Morton",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 494,
    "timeline_text": "32 ABY",
    "sort_timeline_yavin": 32,
    "series": [
      "Journey to Star Wars > The Rise of Skywalker"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 30,
    "title": "Queen's Peril",
    "sort_title": "Queen's Peril",
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "06/02/2020",
    "pub_date_all": "June 2, 2020 (hardcover)\nOctober 5, 2021 (paperback)",
    "pub_summary": "When fourteen-year-old Padmé Naberrie wins the election for Queen of Naboo, she takes the name Amidala and leaves her family to rule from the Royal Palace in the capital of Theed. At a time of brewing uncertainty for Naboo and the Galactic Republic, she and her security advisor, Captain Panaka, devise a plan for the Queen's safety: the recruitment of multiple handmaidens. These handmaidens will be her aides, confidants, protectors, and even decoys. Each young woman is selected by Panaka for her particular talents, but it is up to Padmé to unite them as a group. Different though they may be, the handmaidens learn to work together in service of the one goal they all share: to protect the Queen at all costs. But when their peaceful world is invaded by the ambitious Trade Federation, Queen Amidala and her brave handmaidens will face their greatest test— of themselves and of each other.",
    "pages": 288,
    "isbn": "9781368057141",
    "asin": "B085KKSQBW",
    "audio_asin": "B085LMW71G",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/1/1c/QueensPeril.png/revision/latest/scale-to-width-down/499?cb=20200618062128",
    "audio_narrator": "Catherine Taber",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 371,
    "timeline_text": "32 BBY",
    "sort_timeline_yavin": -32,
    "series": [
      "Queen's Series"
    ],
    "author": [
      "E. K. Johnston"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 31,
    "title": "Shadow Fall",
    "sort_title": "Shadow Fall",
    "author": [
      "Alexander Freed"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "06/23/2020",
    "pub_date_all": "June 23, 2020 (hardcover)\nFebruary 23, 2021 (paperback)",
    "pub_summary": "Alphabet Squadron's hunt for the deadliest TIE fighters in the galaxy continues in this Star Wars adventure!\n\nNews of the New Republic's victory still reverberates through the galaxy. In its wake, the capital ships of the newly legitimized galactic government journey to the farthest stars, seeking out and crushing the remnants of imperial tyranny. But some old ghosts are harder to banish than others. And none are more dangerous than Shadow Wing.\n\nYrica Quell's ragtag Alphabet Squadron still leads the search for Shadow Wing, but they're no closer to their goal—and the pressure to find their quarry before it's too late has begun to shake them apart. Determined, Quell works with New Republic Intelligence's contentious Caern Adan and the legendary General Hera Syndulla to prepare the riskiest gambit of her starfighting career—a trap for Shadow Wing that could finish the chase once and for all.\n\nBut in the darkness, their enemy has evolved. Soran Keize, last of the Imperial aces, has stepped into the power vacuum at the head of Shadow Wing, reinvigorating the faltering unit in their hour of need. Once adrift in the aftershocks of the war, Keize has found meaning again, leading the lost soldiers of his unit through to safety. The only thing standing in his way? The most mismatched squadron in the New Republic Navy, led by his former mentee: the traitor Yrica Quell.",
    "pages": 416,
    "isbn": "9781984820044",
    "asin": "B07YK1PD91",
    "audio_asin": "B07YSVZ2NC",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/a/af/ShadowFall.png/revision/latest/scale-to-width-down/500?cb=20200617182813",
    "audio_narrator": "Carol Monda",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 900,
    "timeline_text": "5 ABY",
    "sort_timeline_yavin": 5,
    "series": [
      "Alphabet Squadron"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 32,
    "title": "Poe Dameron: Free Fall",
    "sort_title": "Poe Dameron: Free Fall",
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "08/04/2020",
    "pub_date_all": "August 4, 2020",
    "pub_summary": "Poe Dameron has always wanted to fly. His mother, Shara Bey, who was an A-wing pilot for the Rebellion against the Empire, was more than happy to show her son everything she knew about flying. But she died an untimely death, and Poe was left alone with his father, Kes Dameron, who struggles with grief and a desire to keep his son safe.\n\nNow sixteen, Poe wants nothing more than to leave his home on the quiet moon Yavin 4 to find adventure in the wider galaxy, while his father wants nothing more than for him to stay put. So when a group of smugglers offers Poe a job piloting them off-world, it feels like an opportunity he can't refuse. And by the time he finds out the smugglers are actually part of the fearsome criminal enterprise called the Spice Runners of Kijimi, Poe is already in deep. His burgeoning friendship—and perhaps more—with one young Spice Runner, Zorii, is even more incentive for Poe to stick around. But is this the life he's meant to have, is it even the life he wants? With danger closing in, Poe will have to figure out where he stands—and what he stands for.",
    "pages": 384,
    "isbn": "9781368051668",
    "asin": "B088KPK1Q1",
    "audio_asin": "B0892RKT7T",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/c/c2/PoeDameronFreeFall.jpg/revision/latest/scale-to-width-down/500?cb=20200514183531",
    "audio_narrator": "Sean Elias-Reyes",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 510,
    "timeline_text": "18 ABY–19 ABY",
    "sort_timeline_yavin": 18,
    "series": [],
    "author": [
      "Alex Segura"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 33,
    "title": "Chaos Rising",
    "sort_title": "Chaos Rising",
    "author": [
      "Timothy Zahn"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "09/01/2020",
    "pub_date_all": "September 1, 2020 (hardcover)\nApril 27, 2021 (paperwork)",
    "pub_summary": "Discover Thrawn's origins within the Chiss Ascendancy in the first book in an epic new Star Wars trilogy from bestselling author Timothy Zahn.\n\nBeyond the edge of the galaxy lie the Unknown Regions: chaotic, uncharted, and near impassable, possessing hidden secrets and dangers in equal measure. And nestled within their swirling chaos is the Ascendancy, home to the enigmatic Chiss and the Nine Ruling Families that lead them.\n\nThe peace of the Ascendancy, a beacon of calm and stability, is shattered after a daring attack on the Chiss capital that reveals no trace of the enemy. Baffled, the Ascendancy dispatches one of its brightest young military officers to root out the unseen assailants—a recruit born of no title but adopted into the powerful family of the Mitth and given the name Thrawn.\n\nWith the might of the Expansionary Fleet at his back and aided by his comrade, Admiral Ar'alani, Thrawn begins to piece together the answers he's looking for. But as Thrawn's first command probes deeper into the vast stretch of space his people call the Chaos, he realizes that the mission he has been given is not what it seems.\n\nAnd the threat to the Ascendancy is only just beginning.",
    "pages": 400,
    "isbn": "9780593157688",
    "asin": "B07YK1JM4S",
    "audio_asin": "B07YVLQMVG",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/4/4a/ChaosRising_cover.jpg/revision/latest/scale-to-width-down/500?cb=20200902230326",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 780,
    "timeline_text": "19 BBY",
    "sort_timeline_yavin": -19,
    "series": [
      "Thrawn Ascendancy"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 34,
    "title": "Light of the Jedi",
    "sort_title": "Light of the Jedi",
    "author": [
      "Charles Soule"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "01/05/2021",
    "pub_date_all": "January 5, 2021 (hardcover)\nJune 29, 2021 (paperback)",
    "pub_summary": "Long before the First Order, before the Empire, before even The Phantom Menace. . . Jedi lit the way for the galaxy in The High Republic\n\nIt is a golden age. Intrepid hyperspace scouts expand the reach of the Republic to the furthest stars, worlds flourish under the benevolent leadership of the Senate, and peace reigns, enforced by the wisdom and strength of the renowned order of Force users known as the Jedi. With the Jedi at the height of their power, the free citizens of the galaxy are confident in their ability to weather any storm. But even the brightest light can cast a shadow, and some storms defy any preparation.\n\nWhen a shocking catastrophe in hyperspace tears a ship to pieces, the flurry of shrapnel emerging from the disaster threatens an entire system. No sooner does the call for help go out than the Jedi race to the scene. The scope of the emergence, however, is enough to push even Jedi to their limit. As the sky breaks open and destruction rains down upon the peaceful alliance they helped to build, the Jedi must trust in the Force to see them through a day in which a single mistake could cost billions of lives.\n\nEven as the Jedi battle valiantly against calamity, something truly deadly grows beyond the boundary of the Republic. The hyperspace disaster is far more sinister than the Jedi could ever suspect. A threat hides in the darkness, far from the light of the age, and harbors a secret that could strike fear into even a Jedi's heart.",
    "pages": 380,
    "isbn": "9780593157718",
    "asin": "B084V936F9",
    "audio_asin": "B085K1N548",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/e/e2/Light_of_the_Jedi_cover.jpg/revision/latest/scale-to-width-down/500?cb=20200225020702",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 780,
    "timeline_text": "232 BBY",
    "sort_timeline_yavin": -232,
    "series": [
      "The High Republic > Phase I: Quest of the Jedi"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 35,
    "title": "Into the Dark",
    "sort_title": "Into the Dark",
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "02/02/2021",
    "pub_date_all": "February 2, 2021",
    "pub_summary": "Padawan Reath Silas is being sent from the cosmopolitan galactic capital of Coruscant to the undeveloped frontier—and he couldn't be less happy about it. He'd rather stay at the Jedi Temple, studying the archives. But when the ship he's traveling on is knocked out of hyperspace in a galactic-wide disaster, Reath finds himself at the center of the action. The Jedi and their traveling companions find refuge on what appears to be an abandoned space station. But then strange things start happening, leading the Jedi to investigate the truth behind the mysterious station, a truth that could end in tragedy....\n\nNOT EVERYONE WHO HEARS THE CALL TO ADVENTURE WANTS TO ANSWER IT. . . .\n\nJedi Padawan Reath Silas loves adventure—reading about it, that is, not living it. Content to spend hours browsing the Jedi Archives on Coruscant, Reath dreams of being one of the greatest scholars of the Jedi Order. But Reath's master, the well-respected and virtuous Jora Malli, has other plans: she's taken a post at Starlight Beacon, the Republic's shining new outpost on the edge of known space. As her Padawan, Reath must join her, whether he likes the idea or not. (And he most definitely does not.)\n\nSo Reath reluctantly boards the ship that will take him and a few other Jedi to the dedication of Starlight Beacon, where Master Jora waits for him to start their new adventurous life on the frontier. But trouble in hyperspace leaves the ship and other nearby vessels stranded, with only an eerie abandoned space station reachable for shelter. And the secrets hidden there will not only bring Reath to a crossroads but, if left unchecked, could plunge the entire galaxy into darkness. . . .",
    "pages": 352,
    "isbn": "9781368057288",
    "asin": "B08543D4W9",
    "audio_asin": "B085F2YKJC",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/8/81/Into_the_Dark_cover.jpg/revision/latest/scale-to-width-down/500?cb=20200225074008",
    "audio_narrator": "Dan Bittner",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 600,
    "timeline_text": "232 BBY",
    "sort_timeline_yavin": -232,
    "series": [
      "The High Republic > Phase I: Quest of the Jedi"
    ],
    "author": [
      "Claudia Gray"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 36,
    "title": "Victory's Price",
    "sort_title": "Victory's Price",
    "author": [
      "Alexander Freed"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "03/02/2021",
    "pub_date_all": "March 2, 2021",
    "pub_summary": "The aces of the New Republic have one final chance to defeat the darkness of Shadow Wing in this thrilling conclusion to the Star Wars: Alphabet Squadron trilogy!\n\nIn the wake of Yrica Quell's shocking decision—and one of the fiercest battles of their lives—the remnants of Alphabet Squadron seek answers and closure across a galaxy whose old war scars are threatening to reopen.\n\nSoran Keize has returned to the tip of Shadow Wing's spear. Operation Cinder, the terrifying protocol of planetary extermination which began in the twilight of the Imperial era, burns throughout the galaxy. Shadow Wing is no longer wounded prey fleeing the hunters of the New Republic. With its leader, its strength has returned, and its Star Destroyers and TIE squadrons lurk in the darkness between stars, carrying out the fallen Emperor's final edict of destruction—as well as another, stranger mission, one Keize has championed not for the dying Empire, but for its loyal soldiers.\n\nAlphabet Squadron's ships are as ramshackle and damaged as their spirits, but they've always had each other. Now, as they face the might of Keize's reborn juggernaut, they aren't even sure they have that. How do you catch a shadow? How do you kill it? And when you're finally victorious, who pays the price?",
    "pages": 460,
    "isbn": "9781984820075",
    "asin": "B08FHBLWLN",
    "audio_asin": "B08GCWNMLT",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/8/89/VictorysPrice.jpg/revision/latest/scale-to-width-down/500?cb=20210131075536",
    "audio_narrator": "January LaVoy",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 980,
    "timeline_text": "5 ABY",
    "sort_timeline_yavin": 5,
    "series": [
      "Alphabet Squadron"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 37,
    "title": "Greater Good",
    "sort_title": "Greater Good",
    "author": [
      "Timothy Zahn"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "04/27/2021",
    "pub_date_all": "April 27, 2021",
    "pub_summary": "Thrawn and his allies race to save the Chiss Ascendancy from an unseen enemy in the second book in the epic Star Wars: The Ascendancy Trilogy from bestselling author Timothy Zahn.\n\nThrawn's latest triumph still rests newly on his shoulders. Despite leading the Chiss to victory and bringing glory to the House of Mitth, the true threat to the Ascendancy has not yet been extinguished. Their foes do not send threats or ultimatums, or mass ships on the edge of the Chaos. Their weapons come cloaked in smiles and generosity—gifts offered freely, services granted unconditionally.\n\nAcross the Ascendancy, seemingly inconsequential events could herald the doom of the Chiss. As Thrawn and the Expansionary Defense Fleet rally to uncover the enemy plot, they discover a chilling truth. Rather than invade Chiss capitals or pillage resources, this mysterious enemy strikes at the very foundation of the Ascendancy by widening the rifts between the Nine Ruling Families and Forty Great Houses below. As rivalry and suspicion sow discord among allies, each warrior must decide what matters most: the security of their family, or the survival of the Ascendancy itself.",
    "pages": 416,
    "isbn": "9780593158296",
    "asin": "B08KPJW7L9",
    "audio_asin": "B08KWQJX7Q",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/d/d1/GreaterGood.jpg/revision/latest/scale-to-width-down/500?cb=20201029174446",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 840,
    "timeline_text": "18 BBY",
    "sort_timeline_yavin": -18,
    "series": [
      "Thrawn Ascendancy"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 39,
    "title": "Out of the Shadows",
    "sort_title": "Out of the Shadows",
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "07/27/2021",
    "pub_date_all": "July 27, 2021",
    "pub_summary": "The darkest secrets are the hardest to bring to light...\n\nSylvestri Yarrow is on a streak of bad luck with no end of sight. She's been doing her best to keep the family cargo business going after her mom's death, but between mounting debt and increasing attacks by the Nihil on unsuspecting ships, Syl is in danger of losing all she has left of her mother. She heads to the galactic capital of Coruscant for help, but gets sidetracked when she's drawn into a squabble between two of the Republic's most powerful families over a patch of space on the frontier. Tangled up in familial politics is the last place Syl wants to be, but the promise of a big payoff is enough to keep her interested...\n\nMeanwhile, Jedi Knight Vernestra Rwoh has been summoned to Coruscant, but with no idea of why or by whom. She and her Padawan Imri Cantaros arrive at the capital along with Jedi Master Cohmac Vitus and his Padawan, Reath Silas—and are asked to assist with the property dispute on the frontier. But why? What is so important about an empty patch of space? The answer will lead Vernestra to a new understanding of her abilities, and take Syl back to the past... and to truths that will finally come out of the shadows.",
    "pages": 423,
    "isbn": "9781368060653",
    "asin": "B091M4WKVQ",
    "audio_asin": "B098BHBW9Z",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/5/51/Star_Wars_The_High_Republic_Out_of_the_Shadows_final_cover.jpg/revision/latest/scale-to-width-down/500?cb=20210217035059",
    "audio_narrator": "Keylor Leigh",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 650,
    "timeline_text": "231 BBY",
    "sort_timeline_yavin": -231,
    "series": [
      "The High Republic > Phase I: Quest of the Jedi"
    ],
    "author": [
      "Justina Ireland"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 40,
    "title": "Lesser Evil",
    "sort_title": "Lesser Evil",
    "author": [
      "Timothy Zahn"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "11/16/2021",
    "pub_date_all": "November 16, 2021",
    "pub_summary": "The fate of the Chiss Ascendancy hangs in the balance in the epic finale of the Star Wars: Thrawn Ascendancy trilogy from bestselling author Timothy Zahn.\n\nFor thousands of years The Chiss Ascendancy has been an island of calm, a center of power, and a beacon of integrity. Led by the Nine Ruling Families, their leadership stands as a bulwark of stability against the Chaos of the Unknown Regions.\n\nBut that stability has been eroded by a cunning foe that winnows away trust and loyalty in equal measure. Bonds of fidelity have given way to lines of division among the families. Despite the efforts of the Expansionary Defense Fleet, the Ascendancy slips closer and closer toward civil war.\n\nThe Chiss are no strangers to war. Their mythic status in the Chaos was earned through conflict and terrible deeds, some long buried. Until now. To ensure the Ascendancy's future, Thrawn will delve deep into its past, uncovering the dark secrets surrounding the ascension of the First Ruling Family. But the truth of a family's legacy is only as strong as the legend that supports it. Even if that legend turns out to be a lie.\n\nTo secure the salvation of the Ascendancy, is Thrawn willing to sacrifice everything? Including the only home he has ever known?",
    "pages": 576,
    "isbn": "9780593158326",
    "asin": "B08ZCP1Z2W",
    "audio_asin": "B08ZDSJPHZ",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/3/3f/LesserEvil.jpg/revision/latest/scale-to-width-down/500?cb=20210402211907",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 1394,
    "timeline_text": "18 BBY",
    "sort_timeline_yavin": -18,
    "series": [
      "Thrawn Ascendancy"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 41,
    "title": "The Fallen Star",
    "sort_title": "Fallen Star",
    "author": [
      "Claudia Gray"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "01/04/2022",
    "pub_date_all": "January 4, 2022",
    "pub_summary": "In this gripping sequel to Star Wars: The Rising Storm, the light of the Jedi faces its darkest hour.\n\nTime and again, the vicious raiders known as the Nihil have sought to bring the golden age of the High Republic to a fiery end. Time and again, the High Republic has emerged battered and weary, but victorious thank to its Jedi protectors—and there is no monument to their cause grander than the Starlight Beacon.\n\nHanging like a jewel in the Outer Rim, the Beacon embodies the High Republic at the apex of its aspirations: a hub of culture and knowledge, a bright torch against the darkness of the unknown, and an extended hand of welcome to the furthest reaches of the galaxy. As survivors and refugees flee the Nihil's attacks, the Beacon and its crew stand ready to shelter and heal.\n\nThe grateful Knights and Padawans of the Jedi Order stationed there finally have a chance to recover—from the pain of their injuries and the grief of their losses. But the storm they thought had passed still rages; they are simply caught in its eye. Marchion Ro, the true mastermind of the Nihil, is preparing his most daring attack yet—one designed to snuff out the light of the Jedi.",
    "pages": 368,
    "isbn": "9780593355398",
    "asin": "B099YZD3NR",
    "audio_asin": "B09B2MSJGD",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/7/79/HighRepublicTheFallenStar-Cover.jpg/revision/latest/scale-to-width-down/500?cb=20210915222426",
    "audio_narrator": "Yihyoung Li",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 840,
    "timeline_text": "230 BBY",
    "sort_timeline_yavin": -230,
    "series": [
      "The High Republic > Phase I: Quest of the Jedi"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 42,
    "title": "Midnight Horizon",
    "sort_title": "Midnight Horizon",
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "02/01/2022",
    "pub_date_all": "February 1, 2022",
    "pub_summary": "Two hundred years before the events of Star Wars: The Phantom Menace''', in the era of the glorious High Republic, the Jedi are the guardians of peace and justice in the galaxy!'\n\nAfter a series of staggering losses, the Republic seems to finally have the villainous Nihil marauders on the run, and it looks like there's light at the end of the tunnel. Until word comes of a suspected Nihil attack on the industrial cosmopolitan world of Corellia, right in the Galactic Core.\n\nSent to investigate are Jedi Masters Cohmac Vitus and Kantam Sy, along with Padawans Reath Silas and Ram Jomaram, all fighting their own private battles after months of unrelenting danger. On Corellia, Reath and Ram encounter a brazen young security specialist named Crash, whose friend was one of the victims of the Nihil attack, and they team up with her to infiltrate Corellia's elite while the Masters pursue more diplomatic avenues. But going undercover with Crash is more dangerous than anyone expected, even as Ram pulls in his friend Zeen to help with an elaborate ruse involving a galactic pop star.\n\nBut what they uncover on Corellia turns out to be just one part of a greater plan, one that could lead the Jedi to their most stunning defeat yet….\n\nThe New York Times best-selling series continues.... For light and life!",
    "pages": 496,
    "isbn": "9781368060677",
    "asin": "B09NQJ8XX6",
    "audio_asin": "B09RKV58G3",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/d/dc/HighRepublicMidnightHorizon.jpg/revision/latest/scale-to-width-down/500?cb=20210916182836",
    "audio_narrator": "Todd Haberkorn",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 605,
    "timeline_text": "230 BBY",
    "sort_timeline_yavin": -230,
    "series": [
      "The High Republic > Phase I: Quest of the Jedi"
    ],
    "author": [
      "Daniel José Older"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 43,
    "title": "Queen's Hope",
    "sort_title": "Queen's Hope",
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "04/05/2022",
    "pub_date_all": "April 5, 2022",
    "pub_summary": "A peace-loving senator faces a time of war in another thrilling Padmé Amidala adventure from the author of the New York Times best-sellers Queen's Peril and Queen's Shadow!\n\nPadmé is adjusting to being a wartime senator during the Clone Wars. Her secret husband, Anakin Skwyalker, [sic] is off fighting the war, and excels at being a wartime Jedi. In contrast, when Padmé gets the opportunity to see the casualties on the war-torn front lines, she is horrified. The stakes have never been higher for the galaxy, or for the newly-married couple.\n\nMeanwhile, with Padmé on a secret mission, her handmaiden Sabé steps into the role of Senator Amidala, something no handmaiden has done for an extended period of time. While in the Senate, Sabé is equally horrified by the machinations that happen there. She comes face to face with a gut-wrenching decision as she realizes that she cannot fight a war this way, not even for Padmé.\n\nAnd Chancellor Palpatine hovers over it all, manipulating the players to his own ends…",
    "pages": 352,
    "isbn": "9781368075930",
    "asin": "B09V99NZ58",
    "audio_asin": "B09VRLVQP1",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/4/47/Queens_Hope_final_cover.jpg/revision/latest/scale-to-width-down/500?cb=20210618225638",
    "audio_narrator": "Catherine Taber",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 400,
    "timeline_text": "22 BBY",
    "sort_timeline_yavin": -22,
    "series": [
      "Queen's Series"
    ],
    "author": [
      "E. K. Johnston"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 44,
    "title": "Brotherhood",
    "sort_title": "Brotherhood",
    "author": [
      "Mike Chen"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "05/10/2022",
    "pub_date_all": "May 10, 2022",
    "pub_summary": "Obi-Wan Kenobi and Anakin Skywalker must stem the tide of the raging Clone Wars and forge a new bond as Jedi Knights.\n\nThe Clone Wars have begun. Battle lines are being drawn throughout the galaxy. With every world that joins the Separatists, the peace guarded by the Jedi Order is slipping through their fingers.\n\nAfter an explosion devastates Cato Neimoidia, the jewel of the Trade Federation, the Republic is blamed and the fragile neutrality of the planet is threatened. The Jedi dispatch Obi-Wan Kenobi, one of the Order's most gifted diplomatic minds, to investigate the crime and maintain the balance that has begun to dangerously shift. As Obi-Wan investigates with the help of a heroic Neimoidian guard, he finds himself working against the Separatists who hope to draw the planet into their conspiracy—and senses the sinister hand of Asajj Ventress in the mists that cloak the planet.\n\nAmid the brewing chaos, Anakin Skywalker rises to the rank of Jedi Knight. Despite the mandate that Obi-Wan travel alone–and his former master's insistence that he listen this time—Anakin's headstrong determination means nothing can stop him from crashing the party, and bringing along a promising but conflicted youngling.\n\nOnce a Padawan to Obi-Wan, Anakin now finds himself on equal—but uncertain—footing with the man who raised him. The lingering friction between them increases the danger for everyone around them. The two knights must learn a new way to work together—and they must learn quickly, to save Cato Neimoidia and its people from the fires of war. To overcome the threat they face they must grow beyond master and apprentice. They must stand together as brothers.",
    "pages": 329,
    "isbn": "9780593358573",
    "asin": "B09DK1HS3Y",
    "audio_asin": "B09HR22J4Z",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/3/3d/Brotherhood_Final_Cover.png/revision/latest/scale-to-width-down/499?cb=20220510224638",
    "audio_narrator": "Laura Racero",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 766,
    "timeline_text": "22 BBY",
    "sort_timeline_yavin": -22,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 45,
    "title": "Shadow of the Sith",
    "sort_title": "Shadow of the Sith",
    "author": [
      "Adam Christopher"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "06/28/2022",
    "pub_date_all": "June 28, 2022",
    "pub_summary": "Luke Skywalker and Lando Calrissian return in this essential novel set between '''Return of the Jedi and The Force Awakens'''.\n\nThe Empire is dead. Nearly two decades on from the Battle of Endor, the tattered remnants of Palpatine's forces have fled to the farthest reaches of the galaxy. But for the heroes of the New Republic, danger and loss are ever-present companions, even in this newly forged era of peace.\n\nJedi Master Luke Skywalker is haunted by visions of the dark side, foretelling an ominous secret growing somewhere in the depths of space, on a dead world called Exegol. The disturbance in the Force is undeniable . . . and Luke's worst fears are confirmed when his old friend, Lando Calrissian, comes to him with reports of a new Sith menace.\n\nAfter his daughter was stolen from his arms, Lando searched the stars for any trace of his lost child. But every new rumor only led to dead ends and fading hopes—until he crossed paths with Ochi of Bestoon, a Sith assassin tasked with kidnapping a young girl.\n\nOchi's true motives remain shrouded to Luke and Lando. For on a junkyard moon, a mysterious envoy of the Sith Eternal has bequeathed a sacred blade to the assassin, promising that it will give him answers to the questions that have haunted him since the Empire fell. In exchange, he must complete a final mission: return to Exegol with the key to the Sith's glorious rebirth—the granddaughter of Darth Sidious himself, Rey.\n\nAs Ochi hunts Rey and her parents to the edge of the galaxy, Luke and Lando race into the mystery of the Sith's lingering shadow and aid a young family running for their lives.",
    "pages": 496,
    "isbn": "9780593358603",
    "asin": "B09HJQG8L1",
    "audio_asin": "B09HR1RT6B",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/e/e5/Shadow-of-the-Sith-Cover.jpg/revision/latest/scale-to-width-down/500?cb=20220324191944",
    "audio_narrator": "William DeMeritt",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 1032,
    "timeline_text": "21 ABY",
    "sort_timeline_yavin": 21,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 46,
    "title": "Padawan",
    "sort_title": "Padawan",
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "07/26/2022",
    "pub_date_all": "July 26, 2022",
    "pub_summary": "BEING A TEENAGER IS HARD ENOUGH WITHOUT ALSO TRAINING TO BE A JEDI….\n\nObi-Wan Kenobi has not been apprenticed long to Qui-Gon Jinn, and he is chafing at Qui-Gon's training style: all meditation, no action. Obi-Wan yearns to prove himself on a mission, but when he and Qui-Gon are finally set to leave on an assignment, Qui-Gon is nowhere to be found. Angered by his master's abandonment, Obi-Wan sets out on the mission alone, determined to prove himself. On a mysterious planet he encounters a pack of feral, Force-wielding teens who seem to be the planet's only inhabitants. As he experiences wild freedom with them and wonders if this isn't the life he was meant for, Obi-Wan can't escape the nagging sense that something is wrong with the Force there. Growing attachments, startling revelations, and a looming threat to both the planet and his new friends will bring Obi-Wan face-to-face with his worst fear: that maybe he was never supposed to be a Jedi at all. Can he connect with the living Force in time to save himself and everyone around him?\n\nIt's the star of the Obi-Wan Kenobi Disney+ limited series as you've never seen him before….",
    "pages": 410,
    "isbn": "9781368023498",
    "asin": "B09TG1XPQB",
    "audio_asin": "B0B6QG9RJR",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/7/74/Padawan_cover.jpg/revision/latest/scale-to-width-down/500?cb=20220225073815",
    "audio_narrator": "Gary Furlong",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 446,
    "timeline_text": "41 BBY",
    "sort_timeline_yavin": -41,
    "series": [],
    "author": [
      "Kiersten White"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 47,
    "title": "The Princess and the Scoundrel",
    "sort_title": "Princess and the Scoundrel ",
    "author": [
      "Beth Revis"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "08/16/2022",
    "pub_date_all": "August 16, 2022",
    "pub_summary": "You are cordially invited to the wedding of Princess Leia Organa and Han Solo.\n\nThe Death Star is destroyed. Darth Vader is dead. The Empire is desolated. But on the forest moon of Endor, amongst the chaos of a changing galaxy, time stands still for a princess and her scoundrel.\n\nAfter being frozen in carbonite, then risking everything for the Rebellion, Han is eager to stop living his life for other people. He and Leia have earned their future together, a thousand times over. And when he proposes to Leia, it's the first time in a long time he's had a good feeling about this. For Leia, a lifetime of fighting doesn't truly seem over. There is work still to do, penance to pay for the dark secret she now knows runs through her veins. Her brother, Luke, is offering her that chance–one that comes with family and the promise of the Force. But when Han asks her to marry him, Leia finds her answer immediately on her lips…Yes.\n\nBut happily ever after doesn't come easily. As soon as Han and Leia depart their idyllic ceremony on Endor for their honeymoon, they find themselves on the grandest and most glamorous stage of all: the Halcyon, a luxury vessel on a very public journey to the most wondrous worlds in the galaxy. Their marriage, and the peace and prosperity it represents, is a lightning rod for everyone in the galaxy–including Imperial remnants still clinging to power.\n\nFacing their most desperate hour, the soldiers of the Empire have dispersed across the galaxy, retrenching on isolated worlds vulnerable to their influence. As the Halcyon travels from world to world, one thing becomes abundantly clear: The war is not over. But as danger draws closer, Han and Leia find that they fight their best battles not alone but as husband and wife.",
    "pages": 304,
    "isbn": "9780593498491",
    "asin": "B09RTYVTGD",
    "audio_asin": "B09RX4W96X",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/8/8b/PrincessandtheScoundrel-cover.jpg/revision/latest/scale-to-width-down/500?cb=20220514221806",
    "audio_narrator": "Saskia Maarleveld;Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 765,
    "timeline_text": "4 ABY",
    "sort_timeline_yavin": 4,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 48,
    "title": "Path of Deceit",
    "sort_title": "Path of Deceit",
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "10/04/2022",
    "pub_date_all": "October 4, 2022",
    "pub_summary": "Set in the world of the High Republic, 150 years before the storytelling of Phase I, an era of change brings new hopes and possibilities…but also new dangers.\n\nThe Outer Rim planet Dalna has become the focus of a Jedi investigation into a stolen Force artifact, and Zallah Macri and her Padawan, Kevmo Zink, arrive on the pastoral world to follow up on a possible connection to a Dalnan missionary group called the Path of the Open Hand. Members of the Path believe that the Force must be free and should not be used by anyone, not even the Jedi. One such believer is Marda Ro, a young woman who dreams of leaving Dalna to spread word of the Path throughout the galaxy.\n\nWhen Marda and Kevmo meet, their connection is instantaneous and electric―until Marda discovers Kevmo is a Jedi. But Kevmo is so kind and eager to learn more about the Path, that she hopes she can convince him of the rightness of her beliefs. What Marda doesn't realize is that the leader of the Path, a charismatic woman known only as the Mother, has an agenda of her own, and it is one that can never coexist peacefully with the Jedi.\n\nIn order to follow her faith, Marda may have to choose to become her new friend's worst enemy….",
    "pages": 352,
    "isbn": "9781368076128",
    "asin": "B0B69KD5Z6",
    "audio_asin": "B0BFT5FR8V",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/3/38/TheHighRepublic-PathOfDeceit.jpg/revision/latest/scale-to-width-down/499?cb=20220526233239",
    "audio_narrator": "Erin Yvette",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 490,
    "timeline_text": "382 BBY",
    "sort_timeline_yavin": -382,
    "series": [
      "The High Republic > Phase II: Light of the Jedi"
    ],
    "author": [
      "Tessa Gratton",
      "Justina Ireland"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 49,
    "title": "Convergence",
    "sort_title": "Convergence",
    "author": [
      "Zoraida Córdova"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "11/22/2022",
    "pub_date_all": "November 22, 2022",
    "pub_summary": "The next adventure in the High Republic, expanding the new era of Star Wars, with a story set generations before Light of the Jedi.\n\nIt is an age of exploration. Jedi travel the galaxy, expanding their understanding of the Force and all the worlds and beings connected by it. Meanwhile, the Republic, led by its two chancellors, works to unite worlds in an ever-growing community among near and distant stars.\n\nOn the close orbiting planets of Eiram and E'ronoh, the growing pains of a galaxy with limited resources but unlimited ambition are felt keenly. Their hatred for each other has fueled half a decade of escalating conflict and now threatens to consume surrounding systems. The last hope for peace emerges when heirs from the two planets' royal families plan to marry.\n\nBefore lasting peace can be established, an assassination attempt targeting the couple tilts Eiram and E'ronoh back into all-out war. To save both worlds, Jedi Knight Gella Nattai volunteers to uncover the culprit, while Chancellor Kyong appoints her son, Axel Greylark, to represent the Republic's interests in the investigation.\n\nBut Axel's deep distrust of the Jedi sparks against Gella's faith in the Force. She's never met such a puffed-up, privileged party boy, and he's never met a more self-serious, relentless do-gooder. The more they work to untangle the shadowy web of the investigation, the more complicated the conspiracy appears to be. With accusations flying and potential enemies in every shadow, the pair will have to work together to have any hope of bringing the truth to light and saving both worlds.",
    "pages": 336,
    "isbn": "9780593358634",
    "asin": "B09RTY8GT6",
    "audio_asin": "B09SGK2DGR",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/f/f4/HighRepublicConvergence-Cover.jpg/revision/latest/scale-to-width-down/500?cb=20220620193112",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 808,
    "timeline_text": "382 BBY",
    "sort_timeline_yavin": -382,
    "series": [
      "The High Republic > Phase II: Light of the Jedi"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 50,
    "title": "Battle Scars",
    "sort_title": "Battle Scars",
    "author": [
      "Sam Maggs"
    ],
    "publisher": "Random House Worlds",
    "audience": "Adult",
    "pub_date": "03/07/2023",
    "pub_date_all": "March 7, 2023",
    "pub_summary": "Cal Kestis has built a new life for himself with the crew of the Stinger Mantis. Together, Cal's crew has brought down bounty hunters, defeated Inquisitors, and even evaded Darth Vader himself. More importantly, Merrin, Cere, Greez, and faithful droid BD-1 are the closest thing Cal has had to a family since the fall of the Jedi Order. Even as the galaxy's future grows more uncertain by the day, with each blow struck against the Empire, the Mantis crew grows more daring.\n\nOn what should be a routine mission, they meet a stormtrooper determined to chart her own course with the help of Cal and the crew. In exchange for help starting a new life, the Imperial deserter brings word of a powerful, potentially invaluable tool for their fight against the Empire. And even better, she can help them get to it. The only catch – pursuing it will bring them into the path of one of the Empire's most dangerous servants, the Inquisitor known as the Fifth Brother.\n\nCan the Imperial deserter truly be trusted? And while Cal and his friends have survived run-ins with the Inquisitors before, how many times can they evade the Empire before their luck runs out?",
    "pages": 304,
    "isbn": "9780593598603",
    "asin": "B0B3HMTMG1",
    "audio_asin": "B0B9T79MCP",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/0/04/Jedi_Battle_Scars_cover.jpg/revision/latest/scale-to-width-down/500?cb=20221203085940",
    "audio_narrator": "Sean Kenin Elias-Reyes",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 628,
    "timeline_text": "12 BBY",
    "sort_timeline_yavin": -12,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 51,
    "title": "Cataclysm",
    "sort_title": "Cataclysm",
    "author": [
      "Lydia Kang"
    ],
    "publisher": "Random House Worlds",
    "audience": "Adult",
    "pub_date": "04/04/2023",
    "pub_date_all": "April 4, 2023",
    "pub_summary": "After the thrilling events of The High Republic: Convergence, the Jedi race to confront the Path of the Open Hand and end the Forever War.\n\nAfter five years of conflict, the planets Eiram and E'ronoh are on the cusp of real peace. But when news breaks of a disaster at the treaty signing on Jedha, violence reignites on the beleaguered worlds. Together, the royal heirs of both planets—Phan-tu Zenn and Xiri A'lbaran—working alongside the Jedi, have uncovered evidence that the conflict is being orchestrated by outside forces, and all signs point to the mysterious Path of the Open Hand, whom the Jedi also suspect of causing the disaster on Jedha.\n\nWith time—and answers—in short supply, the Jedi must divide their focus between helping quell the renewed violence on Eiram and E'ronoh and investigating the Path. Among them is Gella Nattai, who turns to the one person she believes can unravel the mystery but the last person she wants to trust: Axel Greylark. The chancellor's son, imprisoned for his crimes, has always sought to unburden himself of the weight of his family name. Will he reconcile with the Jedi and aid in their quest for justice and peace, or embrace the Path's promise of true freedom?\n\nAs all roads lead to Dalna, Gella and her allies prepare to take on a foe unlike any they've ever faced. And it will take all of their trust in the Force, and in one another, to survive.",
    "pages": 400,
    "isbn": "9780593500354",
    "asin": "B0B3LQP27Z",
    "audio_asin": "B0B94L5Z4B",
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/2/2b/TheHighRepublic-Cataclysm-cover.jpg/revision/latest/scale-to-width-down/500?cb=20221018054601",
    "audio_narrator": "Marc Thompson",
    "audio_publisher": "Random House Audio",
    "audio_runtime": 840,
    "timeline_text": "382 BBY",
    "sort_timeline_yavin": -382,
    "series": [
      "The High Republic > Phase II: Light of the Jedi"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 53,
    "title": "Inquisitor: Rise of the Red Blade",
    "sort_title": "Inquisitor: Rise of the Red Blade ",
    "author": [
      "Delilah S. Dawson"
    ],
    "publisher": "Random House Worlds",
    "audience": "Adult",
    "pub_date": "07/18/2023",
    "pub_date_all": null,
    "pub_summary": "When the Jedi Order falls, an Inquisitor rises.\n\nPadawan Iskat Akaris has dedicated her life to traveling the galaxy alongside her master, learning the ways of the Force to become a good Jedi. Despite Iskat's dedication, peace and control have remained elusive, and with each setback, she feels her fellow Jedi grow more distrustful of her. Already uncertain about her future in the Jedi Order, Iskat faces tragedy when her master is killed and the Clone Wars engulf the galaxy in chaos.\n\nNow a general on the front lines contributing to that chaos, she is often reminded: Trust in your training. Trust in the wisdom of the Council. Trust in the Force. Yet as the shadows of doubt take hold, Iskat begins to ask questions that no Jedi is supposed to ask: Questions about her own unknown past. Questions the Jedi Masters would consider dangerous.\n\nAs the years pass and the war endures, Iskat's faith in the Jedi wanes. If they would grant her more freedom, she is certain she could do more to protect the galaxy. If they would trust her with more knowledge, she could finally cast aside the shadows that have begun to consume her. When the Jedi Order finally falls, Iskat seizes the chance to forge a path of her own. She embraces the salvation of Order 66.\n\nAs an Inquisitor, Iskat finds the freedom she has always craved: to question, to want. And with each strike of her red blade, Iskat moves closer to claiming her new destiny in the Force—whatever the cost.",
    "pages": 336,
    "isbn": "9780593598580",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/f/f0/InquisitorRiseoftheRedBlade-cover.jpg/revision/latest/scale-to-width-down/500?cb=20221011193317",
    "audio_narrator": null,
    "audio_publisher": "Random House Audio",
    "audio_runtime": null,
    "timeline_text": "22 BBY–14 BBY",
    "sort_timeline_yavin": -22,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 55,
    "title": "The Force Awakens",
    "sort_title": "Force Awakens",
    "author": [
      "Alan Dean Foster"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "12/18/2015",
    "pub_date_all": null,
    "pub_summary": "More than thirty years ago, Star Wars burst onto the big screen and became a cultural phenomenon. Now the next adventures in this blockbuster saga are poised to captivate old and new fans alike—beginning with the highly anticipated Star Wars: The Force Awakens. And alongside the cinematic debut comes the thrilling novel adaptation by New York Times bestselling science fiction master Alan Dean Foster.\n\nSet years after Return of the Jedi, this stunning new action-packed adventure rockets us back into the world of Princess Leia, Han Solo, Chewbacca, C-3PO, R2-D2, and Luke Skywalker, while introducing a host of exciting new characters. Darth Vader may have been redeemed and the Emperor vanquished, but peace can be fleeting, and evil does not easily relent. Yet the simple belief in good can still empower ordinary individuals to rise and meet the greatest challenges.\n\nSo return to that galaxy far, far away, and prepare yourself for what happens when the Force awakens....",
    "pages": 272,
    "isbn": "9781101965498",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/b/b9/The_Force_Awakens_novelization_final_cover.jpg/revision/latest/scale-to-width-down/500?cb=20190531021855",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "34 ABY",
    "sort_timeline_yavin": 34,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novelization",
    "stories": []
  },
  {
    "id": 56,
    "title": "Rogue One",
    "sort_title": "Rogue One",
    "author": [
      "Alexander Freed"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "12/16/2016",
    "pub_date_all": null,
    "pub_summary": "Go beyond the film with a novelization featuring new scenes and expanded material.\n\nAs the shadows of the Empire loom ever larger across the galaxy, so do deeply troubling rumors. The Rebellion has learned of a sinister Imperial plot to bring entire worlds to their knees. Deep in Empire-dominated space, a machine of unimaginable destructive power is nearing completion. A weapon too terrifying to contemplate . . . and a threat that may be too great to overcome.\n\nIf the worlds at the Empire's mercy stand any chance, it lies with an unlikely band of allies: Jyn Erso, a resourceful young woman seeking vengeance; Cassian Andor, a war-weary rebel commander; Bodhi Rook, a defector from the Empire's military; Chirrut Îmwe, a blind holy man and his crack-shot companion, Baze Malbus; and K-2SO, a deadly Imperial droid turned against its former masters. In their hands rests the new hope that could turn the tide toward a crucial Rebellion victory—if only they can capture the plans to the Empire's new weapon.\n\nBut even as they race toward their dangerous goal, the specter of their ultimate enemy—a monstrous world unto itself—darkens the skies. Waiting to herald the Empire's brutal reign with a burst of annihilation worthy of its dreaded name: Death Star.",
    "pages": 352,
    "isbn": "9780399178450",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/1/18/RogueOneNovel.png/revision/latest/scale-to-width-down/500?cb=20161109122101",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "13 BBY–1 BBY",
    "sort_timeline_yavin": -13,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novelization",
    "stories": []
  },
  {
    "id": 57,
    "title": "From a Certain Point of View",
    "sort_title": "From a Certain Point of View",
    "author": [
      "Various"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "10/03/2017",
    "pub_date_all": null,
    "pub_summary": "Forty years. Forty stories.\n\nIn honor of the fortieth anniversary of Star Wars: A New Hope, this collection features Star Wars stories by bestselling authors, trendsetting artists, and treasured voices from Star Wars literary history. More than forty authors have lent their unique vision to forty \"scenes,\" each retelling a different moment from the original Star Wars film, but with a twist: Every scene is told from the point of view of a background character. Whether it's the X-wing pilots who helped Luke destroy the Death Star or the stormtroopers who never quite could find the droids they were looking for, Star Wars: From a Certain Point of View places the classic movie in a whole new perspective, and celebrates the influence and legacy of the unparalleled cultural phenomenon, Star Wars.",
    "pages": 496,
    "isbn": "9780345511478",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/c/c4/FACPOV-Paperback.png/revision/latest/scale-to-width-down/500?cb=20211011044249",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "0 ABY",
    "sort_timeline_yavin": null,
    "series": [
      "From a Certain Point of View"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Anthology",
    "stories": [
      {
        "title": "Raymus",
        "author": [
          "Gary Whitta"
        ]
      },
      {
        "title": "The Bucket",
        "author": [
          "Christie Golden"
        ]
      },
      {
        "title": "The Sith of Datawork",
        "author": [
          "Ken Liu"
        ]
      },
      {
        "title": "Stories in the Sand",
        "author": [
          "Griffin McElroy"
        ]
      },
      {
        "title": "Reirin",
        "author": [
          "Sabaa Tahir"
        ]
      },
      {
        "title": "The Red One",
        "author": [
          "Rae Carson"
        ]
      },
      {
        "title": "Rites",
        "author": [
          "John Jackson Miller"
        ]
      },
      {
        "title": "Master and Apprentice",
        "author": [
          "Claudia Gray"
        ]
      },
      {
        "title": "Beru Whitesun Lars",
        "author": [
          "Meg Cabot"
        ]
      },
      {
        "title": "The Luckless Rodian",
        "author": [
          "Renée Ahdieh"
        ]
      },
      {
        "title": "Not for Nothing",
        "author": [
          "Mur Lafferty"
        ]
      },
      {
        "title": "We Don't Serve Their Kind Here",
        "author": [
          "Chuck Wendig"
        ]
      },
      {
        "title": "The Kloo Horn Cantina Caper",
        "author": [
          "Kelly Sue DeConnick",
          "Matt Fraction"
        ]
      },
      {
        "title": "Added Muscle",
        "author": [
          "Paul Dini"
        ]
      },
      {
        "title": "You Owe Me a Ride",
        "author": [
          "Zoraida Córdova"
        ]
      },
      {
        "title": "The Secrets of Long Snoot",
        "author": [
          "Delilah S. Dawson"
        ]
      },
      {
        "title": "Born in the Storm",
        "author": [
          "Daniel José Older"
        ]
      },
      {
        "title": "Laina",
        "author": [
          "Wil Wheaton"
        ]
      },
      {
        "title": "Fully Operational",
        "author": [
          "Beth Revis"
        ]
      },
      {
        "title": "An Incident Report",
        "author": [
          "Daniel M. Lavery"
        ]
      },
      {
        "title": "Change of Heart",
        "author": [
          "Elizabeth Wein"
        ]
      },
      {
        "title": "Eclipse",
        "author": [
          "Madeleine Roux"
        ]
      },
      {
        "title": "Verge of Greatness",
        "author": [
          "Pablo Hidalgo"
        ]
      },
      {
        "title": "Far Too Remote",
        "author": [
          "Jeffrey Brown (writer",
          "illustrator)"
        ]
      },
      {
        "title": "The Trigger",
        "author": [
          "Kieron Gillen"
        ]
      },
      {
        "title": "Of MSE-6 and Men",
        "author": [
          "Glen Weldon"
        ]
      },
      {
        "title": "Bump",
        "author": [
          "Ben Acker",
          "Ben Blacker"
        ]
      },
      {
        "title": "End of Watch",
        "author": [
          "Adam Christopher"
        ]
      },
      {
        "title": "The Baptist",
        "author": [
          "Nnedi Okorafor"
        ]
      },
      {
        "title": "Time of Death",
        "author": [
          "Cavan Scott"
        ]
      },
      {
        "title": "There is Another",
        "author": [
          "Gary D. Schmidt"
        ]
      },
      {
        "title": "Palpatine",
        "author": [
          "Ian Doescher"
        ]
      },
      {
        "title": "Sparks",
        "author": [
          "Paul S. Kemp"
        ]
      },
      {
        "title": "Duty Roster",
        "author": [
          "Jason Fry"
        ]
      },
      {
        "title": "Desert Son",
        "author": [
          "Pierce Brown"
        ]
      },
      {
        "title": "Grounded",
        "author": [
          "Greg Rucka"
        ]
      },
      {
        "title": "Contingency Plan",
        "author": [
          "Alexander Freed"
        ]
      },
      {
        "title": "The Angle",
        "author": [
          "Charles Soule"
        ]
      },
      {
        "title": "By Whatever Sun",
        "author": [
          "E. K. Johnston",
          "Ashley Eckstein"
        ]
      },
      {
        "title": "Whills",
        "author": [
          "Tom Angleberger"
        ]
      }
    ]
  },
  {
    "id": 58,
    "title": "Canto Bight",
    "sort_title": "Canto Bight",
    "author": [
      "Various"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "12/05/2017",
    "pub_date_all": null,
    "pub_summary": "Soon to be seen in Star Wars: The Last Jedi, welcome to the casino city of Canto Bight. A place where exotic aliens, captivating creatures, and other would-be high rollers are willing to risk everything to make their fortunes. Set across one fateful evening, these four original novellas explore the deception and danger of the lavish casino city.\n\nIn Canto Bight, one is free to revel in excess, untouched from the problems of a galaxy once again descending into chaos and war. Dreams can become reality, but the stakes have never been higher–for there is a darkness obscured by all the glamour and luxury.",
    "pages": 400,
    "isbn": "9781524799533",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/0/0a/CantoBight_Final_cover.jpg/revision/latest/scale-to-width-down/500?cb=20170913192023",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "34 ABY",
    "sort_timeline_yavin": 34,
    "series": [
      "Journey to Star Wars > The Last Jedi"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Collection",
    "stories": []
  },
  {
    "id": 59,
    "title": "The Last Jedi: Expanded Edition",
    "sort_title": "Last Jedi",
    "author": [
      "Jason Fry"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "03/06/2018",
    "pub_date_all": null,
    "pub_summary": "Written with input from director Rian Johnson, this official adaptation of Star Wars: The Last Jedi expands on the film to include scenes from alternate versions of the script and other additional content.\n\nFrom the ashes of the Empire has arisen another threat to the galaxy's freedom: the ruthless First Order. Fortunately, new heroes have emerged to take up arms—and perhaps lay down their lives—for the cause. Rey, the orphan strong in the Force; Finn, the ex-stormtrooper who stands against his former masters; and Poe Dameron, the fearless X-wing pilot, have been drawn together to fight side-by-side with General Leia Organa and the Resistance. But the First Order's Supreme Leader Snoke and his merciless enforcer Kylo Ren are adversaries with superior numbers and devastating firepower at their command. Against this enemy, the champions of light may finally be facing their extinction. Their only hope rests with a lost legend: Jedi Master Luke Skywalker.\n\nWhere the action of Star Wars: The Force Awakens ended, Star Wars: The Last Jedi begins, as the battle between light and dark climbs to astonishing new heights.\n\nFeaturing thrilling photos from the hit movie.",
    "pages": 336,
    "isbn": "9781524797119",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/5/53/SWTLJExpandedEdition.jpg/revision/latest/scale-to-width-down/500?cb=20180212223228",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "34 ABY",
    "sort_timeline_yavin": 34,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novelization",
    "stories": []
  },
  {
    "id": 60,
    "title": "Solo: Expanded Edition",
    "sort_title": "Solo",
    "author": [
      "Mur Lafferty"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "09/04/2018",
    "pub_date_all": null,
    "pub_summary": "Don't miss the exclusive content in this thrilling adaptation of Solo: A Star Wars Story, with scenes from alternate versions of the script including Han Solo's time in the Imperial Navy, Qi'ra's past, the beginnings of the rebellion, and more!\n\nThough Han Solo has thrilled Star Wars fans for decades, the notorious wisecracking scoundrel was chasing adventure and dodging trouble long before he walked into the cantina at Mos Eisley spaceport.\n\nYoung Han dreams of someday soaring into space at the helm of his own starship and leaving his home, the gritty industrial planet Corellia, far behind. But as long as he's trapped in a life of poverty and crime—and under the thumb of the sinister Lady Proxima and her brutal street gang—reaching the distant stars seems impossible. When Han tries to escape with his girlfriend and partner-in-crime, Qi'ra, he makes it out—but she doesn't. Desperate for a way to find his own offworld vessel and free her, Han enlists in the Imperial Navy—the last place for a rebellious loner who doesn't play well with others.\n\nWhen the Empire clips his wings, Han goes rogue and plunges into the shady world of smugglers, gamblers, and con artists. There he meets the charming and cunning high roller Lando Calrissian, makes an unlikely friend in a cantankerous Wookiee called Chewbacca, and first lays eyes on the Millennium Falcon. To snag his piece of the outlaw pie, Han joins a crew of pirates to pull off a risky heist. The stakes are high, the danger is great, and the odds are slim. But never tell Han Solo the odds.",
    "pages": 304,
    "isbn": "9780525619390",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/0/08/Solo-ExpandedEdition-Hardcover.jpg/revision/latest/scale-to-width-down/500?cb=20180921181254",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "13 BBY–10 BBY",
    "sort_timeline_yavin": -13,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novelization",
    "stories": []
  },
  {
    "id": 61,
    "title": "Dooku: Jedi Lost",
    "sort_title": "Dooku: Jedi Lost",
    "author": [
      "Cavan Scott"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "10/01/2019",
    "pub_date_all": null,
    "pub_summary": "Delve into the history of the sinister Count Dooku in the original script to the thrilling audio production!\n\nDarth Tyranus. Count of Serenno. Leader of the Separatists. A red saber, unsheathed in the dark. But who was he before he became the right hand of the Sith? As Dooku courts a new apprentice, the hidden truth of the Sith Lord's past begins to come to light.\n\nDooku's life began as one of privilege—born within the stony walls of his family's estate, orbited by the Funeral Moon where the bones of his ancestors lie interred. But soon his Jedi abilities are recognized, and he is taken from his home to be trained in the ways of the Force by the legendary Master Yoda.\n\nAs he hones his power, Dooku rises through the ranks—befriending fellow Jedi Sifo-Dyas and taking a Padawan of his own, the promising Qui-Gon Jinn—and tries to forget the life that he once led. But he finds himself drawn by a strange fascination with the Jedi Master Lene Kostana and the mission she undertakes for the Order: finding and studying ancient relics of the Sith, in preparation for the eventual return of the deadliest enemies the Jedi have ever faced.\n\nCaught between the world of the Jedi, the ancient responsibilities of his lost home, and the alluring power of the relics, Dooku struggles to stay in the light—even as the darkness begins to fall.",
    "pages": 480,
    "isbn": "9780593157664",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/e/ec/DookuJediLost-HC.jpg/revision/latest/scale-to-width-down/500?cb=20191002022634",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "23 BBY",
    "sort_timeline_yavin": -23,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Script Book",
    "stories": []
  },
  {
    "id": 62,
    "title": "The Rise of Skywalker: Expanded Edition",
    "sort_title": "Rise of Skywalker: Expanded Edition",
    "author": [
      "Rae Carson"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "03/17/2020",
    "pub_date_all": null,
    "pub_summary": "Witness the epic final chapter of the Skywalker saga with the official novelization of Star Wars: The Rise of Skywalker, including expanded scenes and additional content not seen in theaters!\n\nThe Resistance has been reborn. The spark of rebellion is rekindling across the galaxy. But although Rey and her fellow heroes are back in the fight, the war against the First Order, now led by Supreme Leader Kylo Ren, is far from over.\n\nRey, Finn, Poe, and the Resistance must embark on the most perilous adventure they have ever faced. And this time, they're facing it together. With the help of old friends, new allies, and the mysterious guidance of the Force, the story that began in Star Wars: The Force Awakens and continued in Star Wars: The Last Jedi reaches an astounding conclusion.",
    "pages": 368,
    "isbn": "9780593128404",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/c/cf/TROS-ExpandedEdition-Hardcover.jpg/revision/latest/scale-to-width-down/500?cb=20200413192610",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "35 ABY",
    "sort_timeline_yavin": 35,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novelization",
    "stories": []
  },
  {
    "id": 63,
    "title": "From a Certain Point of View: The Empire Strikes Back",
    "sort_title": "From a Certain Point of View: The Empire Strikes Back",
    "author": [
      "Various"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "11/10/2020",
    "pub_date_all": null,
    "pub_summary": "Celebrate the legacy of The Empire Strikes Back with this exciting reimagining of the timeless film featuring new perspectives from forty acclaimed authors.\n\nOn May 21, 1980, Star Wars became a true saga with the release of The Empire Strikes Back. In honor of the fortieth anniversary, forty storytellers re-create an iconic scene from The Empire Strikes Back through the eyes of a supporting character, from heroes and villains, to droids and creatures. From a Certain Point of View features contributions by bestselling authors and trendsetting artists:\n\nPlus more hilarious, heartbreaking, and astonishing tales from:\nTom Angleberger, Sarwat Chadda, S.A. Chakraborty, Mike Chen, Adam Christopher, Katie Cook, Zoraida Córdova, Delilah S. Dawson, Alexander Freed, Jason Fry, Christie Golden, Rob Hart, Lydia Kang, Michael Kogge, R. F. Kuang, C. B. Lee, Mackenzi Lee, John Jackson Miller, Michael Moreci, Daniel José Older, Amy Ratcliffe, Beth Revis, Lilliam Rivera, Cavan Scott, Emily Skrutskie, Karen Strong, Anne Toole, Catherynne M. Valente, Django Wexler, Kiersten White, Gary Whitta, Brittany N. Williams, Charles Yu, Jim Zub\n\nAll participating authors have generously forgone any compensation for their stories. Instead, their proceeds will be donated to First Book—a leading nonprofit that provides new books, learning materials, and other essentials to educators and organizations serving children in need. To further celebrate the launch of this book and both companies' longstanding relationships with First Book, Penguin Random House will donate $100,000 to First Book and Disney/Lucasfilm will donate 100,000 children's books—valued at $1,000,000—to support First Book and their mission of providing equal access to quality education.",
    "pages": 576,
    "isbn": "9780593157749",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/b/b6/FACPOVStrikesBack_FinalCover.jpg/revision/latest/scale-to-width-down/500?cb=20200922230828",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "3 ABY",
    "sort_timeline_yavin": 3,
    "series": [
      "From a Certain Point of View"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Anthology",
    "stories": [
      {
        "title": "Eyes of the Empire",
        "author": [
          "Kiersten White"
        ]
      },
      {
        "title": "Hunger",
        "author": [
          "Mark Oshiro"
        ]
      },
      {
        "title": "Ion Control",
        "author": [
          "Emily Skrutskie"
        ]
      },
      {
        "title": "A Good Kiss",
        "author": [
          "C.B. Lee"
        ]
      },
      {
        "title": "She Will Keep Them Warm",
        "author": [
          "Delilah S. Dawson"
        ]
      },
      {
        "title": "Heroes of the Rebellion",
        "author": [
          "Amy Ratcliffe"
        ]
      },
      {
        "title": "Rogue Two",
        "author": [
          "Gary Whitta"
        ]
      },
      {
        "title": "Kendal",
        "author": [
          "Charles Yu"
        ]
      },
      {
        "title": "Against All Odds",
        "author": [
          "R.F. Kuang"
        ]
      },
      {
        "title": "Beyond Hope",
        "author": [
          "Michael Moreci"
        ]
      },
      {
        "title": "The Truest Duty",
        "author": [
          "Christie Golden"
        ]
      },
      {
        "title": "A Naturalist on Hoth",
        "author": [
          "Hank Green"
        ]
      },
      {
        "title": "The Dragonsnake Saves R2-D2",
        "author": [
          "Katie Cook"
        ]
      },
      {
        "title": "For the Last Time",
        "author": [
          "Beth Revis"
        ]
      },
      {
        "title": "Rendezvous Point",
        "author": [
          "Jason Fry"
        ]
      },
      {
        "title": "The Final Order",
        "author": [
          "Seth Dickinson"
        ]
      },
      {
        "title": "Amara Kel's Rules for TIE Pilot Survival (Probably)",
        "author": [
          "Django Wexler"
        ]
      },
      {
        "title": "The First Lesson",
        "author": [
          "Jim Zub"
        ]
      },
      {
        "title": "Disturbance",
        "author": [
          "Mike Chen"
        ]
      },
      {
        "title": "This Is No Cave",
        "author": [
          "Catherynne M. Valente"
        ]
      },
      {
        "title": "Lord Vader Will See You Now",
        "author": [
          "John Jackson Miller"
        ]
      },
      {
        "title": "Vergence",
        "author": [
          "Tracy Deonn"
        ]
      },
      {
        "title": "Tooth and Claw",
        "author": [
          "Michael Kogge"
        ]
      },
      {
        "title": "STET!",
        "author": [
          "Daniel José Older"
        ]
      },
      {
        "title": "Wait for It",
        "author": [
          "Zoraida Córdova"
        ]
      },
      {
        "title": "Standard Imperial Procedure",
        "author": [
          "Sarwat Chadda"
        ]
      },
      {
        "title": "There Is Always Another",
        "author": [
          "Mackenzi Lee"
        ]
      },
      {
        "title": "Fake It Till You Make It",
        "author": [
          "Cavan Scott"
        ]
      },
      {
        "title": "But What Does He Eat?",
        "author": [
          "S.A. Chakraborty"
        ]
      },
      {
        "title": "Beyond the Clouds",
        "author": [
          "Lilliam Rivera"
        ]
      },
      {
        "title": "No Time for Poetry",
        "author": [
          "Austin Walker"
        ]
      },
      {
        "title": "Bespin Escape",
        "author": [
          "Martha Wells"
        ]
      },
      {
        "title": "Faith in an Old Friend",
        "author": [
          "Brittany N. Williams"
        ]
      },
      {
        "title": "Due on Batuu",
        "author": [
          "Rob Hart"
        ]
      },
      {
        "title": "Into the Clouds",
        "author": [
          "Karen Strong"
        ]
      },
      {
        "title": "The Witness",
        "author": [
          "Adam Christopher"
        ]
      },
      {
        "title": "The Man Who Built Cloud City",
        "author": [
          "Alexander Freed"
        ]
      },
      {
        "title": "The Backup Backup Plan",
        "author": [
          "Anne Toole"
        ]
      },
      {
        "title": "Right-Hand Man",
        "author": [
          "Lydia Kang"
        ]
      },
      {
        "title": "The Whills Strike Back",
        "author": [
          "Tom Angleberger"
        ]
      }
    ]
  },
  {
    "id": 64,
    "title": "Doctor Aphra",
    "sort_title": "Doctor Aphra",
    "author": [
      "Sarah Kuhn"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "04/06/2021",
    "pub_date_all": null,
    "pub_summary": "Dr. Aphra teams up with Darth Vader himself in the original script to the audiobook production—an expanded adaptation of the critically acclaimed Marvel comics series.\n\nDr. Chelli Lona Aphra, rogue archaeologist, is in trouble again.\n\nA pioneer in the field of criminal xenoarchaeology, Aphra recognizes no law, has no fear, and possesses no impulse control. To her, the true worth of the galactic relics she discovers isn't found in a museum but in an arsenal. This viewpoint has led to a lot of misunderstandings. After her latest plan goes horribly wrong, her roguish ways are on the verge of catching up to her when suddenly Darth Vader, terror of the galaxy, swoops in with his lightsaber ignited and…saves her life?\n\nDon't get her wrong—it's not like she's ungrateful. Sure, her new boss is a lord of the Sith. And, okay, she may have just become a pawn in a deadly game being played by him and his boss, who happens to be the Galactic Emperor. And, yes, the life expectancy of anyone who disappoints Vader can be measured in seconds.\n\nBut she's back doing what she does best. She's got a ship to fly, a heist to pull, and two unorthodox but effective metal buddies: Triple-Zero, a protocol droid specializing in etiquette, customs, translation, and torture; and BT-1, a blastomech loaded with enough firepower to take down a battle cruiser. Together they might just find a way to get the job done and avoid the deadly performance review that awaits at its conclusion.\n\nJust kidding. She's doomed.",
    "pages": 304,
    "isbn": "9780593157251",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/1/1f/AphraScriptCover.jpg/revision/latest/scale-to-width-down/500?cb=20210407021747",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "0 ABY",
    "sort_timeline_yavin": null,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Script Book",
    "stories": []
  },
  {
    "id": 65,
    "title": "The Rising Storm",
    "sort_title": "Rising Storm",
    "author": [
      "Cavan Scott"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "06/29/2021",
    "pub_date_all": null,
    "pub_summary": "Following the dramatic events of Light of the Jedi, the heroes of the High Republic era return to face a shattered peace and a fearsome foe.\n\nIn the wake of the Great Disaster and the heroism of the Jedi, the Republic continues to grow, bringing more worlds together under a single unified banner. Led by Chancellor Lina Soh, the spirit of unity extends throughout the galaxy, with the Jedi and newly established Starlight Beacon station at the vanguard.\n\nIn celebration, the chancellor plans \"The Republic Fair,\" a showcase of the possibility and peace of the expanding Republic—a precept the Jedi hope to foster. Stellan Gios, Bell Zettifar, Elzar Mann, and others join the event as ambassadors of harmony. But as the eyes of the galaxy turn toward the Fair, so too does the fury of the Nihil. Their leader, Marchion Ro, is intent on destroying this spirit of unity. His storm descends on the pageantry and celebration, sowing chaos and exacting revenge.\n\nAs the Jedi struggle to curb the carnage of the rampaging Nihil, they come face to face with the true fear their enemy plans to unleash across the galaxy. The kind of fear that even the Force cannot shield them from.",
    "pages": 336,
    "isbn": "9780593159415",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/c/c8/TheHighRepublic-TheRisingStorm.jpg/revision/latest/scale-to-width-down/500?cb=20210120060833",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "231 BBY",
    "sort_timeline_yavin": -231,
    "series": [
      "The High Republic > Phase I: Quest of the Jedi"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 66,
    "title": "Ronin",
    "sort_title": "Ronin",
    "author": [
      "Emma Mieko Candon"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "10/12/2021",
    "pub_date_all": null,
    "pub_summary": "A mysterious former Sith wanders the galaxy in this stunning Star Wars tale. An original novel inspired by the world of \"The Duel\" from the Star Wars Visions [sic] animated anthology.\n\nThe Jedi are the most loyal servants of the Empire.\n\nTwo decades ago, Jedi clans clashed in service to feuding lords. Sickened by this endless cycle, a sect of Jedi rebelled, seeking to control their own destiny and claim power in service of no master. They called themselves Sith.\n\nThe Sith rebellion failed, succumbing to infighting and betrayal, and the once rival lords unified to create an Empire… but even an Empire at peace is not free from violence.\n\nFar on the edge of the Outer Rim, one former Sith wanders, accompanied only by a faithful droid and the ghost of a less civilized age. He carries a lightsaber, but claims lineage to no Jedi clan, and pledges allegiance to no lord. Little is known about him, including his name, for he never speaks of his past, nor his regrets. His history is as guarded as the red blade of destruction he carries sheathed at his side.\n\nAs the galaxy's perpetual cycle of violence continues to interrupt his self-imposed exile, and he is forced to duel an enigmatic bandit claiming the title of Sith, it becomes clear that no amount of wandering will ever let him outpace the specters of his former life.",
    "pages": 336,
    "isbn": "9780593358665",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/b/be/SWRonin-Cover.jpg/revision/latest/scale-to-width-down/500?cb=20210708210410",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": null,
    "sort_timeline_yavin": null,
    "series": [],
    "series_order": {},
    "continuity": "Non-Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 67,
    "title": "Tempest Runner",
    "sort_title": "Tempest Runner",
    "author": [
      "Cavan Scott"
    ],
    "publisher": "Del Rey",
    "audience": "Adult",
    "pub_date": "03/01/2022",
    "pub_date_all": null,
    "pub_summary": "Delve into the cutthroat world of one of the High Republic's greatest foes, the merciless Lourna Dee, in this full script for the Star Wars audio original Tempest Runner'''.\n\nThe Nihil storm has raged through the galaxy, leaving chaos and grief in its wake. Few of its raiders are as vicious as the Tempest Runner Lourna Dee. She stays one step ahead of the Jedi Order at the helm of a vessel named after one of the deadliest monsters in the galaxy: the Lourna Dee. But no one can outrun the defenders of the High Republic forever.\n\nAfter the defeat of her crew, Lourna falls into the hands of the Jedi–but not before she hides her identity, becoming just another Nihil convict. Her captors fail to understand the beast they have cornered. Just like every fool she's ever buried, their first mistake was keeping her alive.\n\nLourna is determined to make underestimating her their last.\n\nLocked onto a Republic correctional ship, she's dragged across the galaxy to repair the very damage she and her fellow Tempest Runners inflicted on it. But as Lourna plans her glorious escape, she makes alliances that grow dangerously close to friendships. Outside the Nihil—separated from her infamous ship, her terrifying arsenal, and her feared name—Lourna must carve her own path. But will it lead to redemption? Or will she emerge as a deadlier threat than ever before?",
    "pages": 592,
    "isbn": "9780593358993",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/8/86/The_High_Republic_Tempest_Runner_script_book_final_cover.png/revision/latest/scale-to-width-down/499?cb=20220226101848",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "231 BBY",
    "sort_timeline_yavin": -231,
    "series": [
      "The High Republic > Phase I: Quest of the Jedi"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Script Book",
    "stories": []
  },
  {
    "id": 68,
    "title": "Starlight Stories",
    "sort_title": "Starlight Stories",
    "author": [
      "Various"
    ],
    "publisher": "Titan Magazines",
    "audience": "Adult",
    "pub_date": "12/06/2022",
    "pub_date_all": null,
    "pub_summary": "EXPERIENCE THE GALAXY CENTURIES BEFORE THE STRUGGLE OF THE REBEL ALLIANCE AGAINST THE GALACTIC EMPIRE—AT THE HEIGHT OF THE JEDI ORDER!\n\nA compendium of tales from the High Republic era, told from aboard the incredible satellite station, the Starlight Beacon, collected for the first time from the pages of Star Wars Insider.\n\nAll stories are written by The New York Times' best-selling authors Cavan Scott, Charles Soule, and Justina Ireland.\n\nAlso includes in-depth interviews with the story architects behind the best-selling publishing and multimedia initiative.",
    "pages": 96,
    "isbn": "9781787738652",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/1/19/StarlightStories.jpg/revision/latest/scale-to-width-down/500?cb=20220606205414",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": null,
    "sort_timeline_yavin": null,
    "series": [
      "The High Republic > Phase II: Light of the Jedi"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Anthology",
    "stories": [
      {
        "title": "Starlight: Go Together",
        "author": [
          "Charles Soule"
        ]
      },
      {
        "title": "Starlight: First Duty",
        "author": [
          "Cavan Scott"
        ]
      },
      {
        "title": "Starlight: Hidden Danger",
        "author": [
          "Justina Ireland"
        ]
      },
      {
        "title": "Starlight: Past Mistakes",
        "author": [
          "Cavan Scott"
        ]
      },
      {
        "title": "Starlight: Shadows Remain",
        "author": [
          "Justina Ireland"
        ]
      }
    ]
  },
  {
    "id": 69,
    "title": "The Battle of Jedha",
    "sort_title": "Battle of Jedha",
    "author": [
      "George Mann"
    ],
    "publisher": "Random House Worlds",
    "audience": "Adult",
    "pub_date": "02/14/2023",
    "pub_date_all": null,
    "pub_summary": "After the events of The High Republic: Convergence, the Jedi travel to Jedha in this all-new Star Wars audiobook original.\n\nJedha. The worn streets of this ancient world serve as a confluence for the galaxy. Visited by all, yet owned by none. Here, the Jedi are but one creed among many worshipping and studying the Force. From the Guardians of the Whills to the Path of the Open Hand, countless beings come to learn, and to share, in peace.\n\nAs all of Jedha prepares for its Festival of Balance, the galaxy still reels from the violence on Eiram and E'ronoh. But after foiling a plot to escalate the war between the two planets, the Jedi believe that a lasting peace may be within reach. Master Creighton Sun and Jedi Knight Aida Forte arrive on Jedha with delegations from both planets to formally end the \"Forever War.\" The Jedi hope that the harmony of Jedha's many factions, along with the signing of a peace treaty, will create a symbol to the rest of the galaxy of what can be accomplished through unity.\n\nBut not all are happy with the Jedi's involvement or ready to concern themselves with peace. Rumors begin to swirl that the Jedi bring war in their wake. The distrust and anger that for so long fueled the Forever War now threaten to corrupt the communities of Jedha. When violence breaks out on the sacred moon, the war that was meant to end on Jedha may soon engulf the entire world.",
    "pages": 304,
    "isbn": "9780593597897",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/e/e2/Battle-Jedha-script-Final.jpg/revision/latest/scale-to-width-down/500?cb=20220802222922",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "382 BBY",
    "sort_timeline_yavin": -382,
    "series": [
      "The High Republic > Phase II: Light of the Jedi"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Script Book",
    "stories": []
  },
  {
    "id": 70,
    "title": "From a Certain Point of View: Return of the Jedi",
    "sort_title": "From a Certain Point of View: Return of the Jedi",
    "author": [
      "Various"
    ],
    "publisher": "Random House Worlds",
    "audience": "Adult",
    "pub_date": "08/29/2023",
    "pub_date_all": null,
    "pub_summary": "Celebrate the lasting impact of Return of the Jedi with this exciting reimagining of the timeless Star Wars film featuring new perspectives from forty contributors.\n\nOn May 25, 1983, Star Wars cemented its legacy as the greatest movie franchise of all time with the release of Return of the Jedi. In honor of the fortieth anniversary, forty storytellers re-create an iconic scene from Return of the Jedi through the eyes of a supporting character, from heroes and villains, to droids and creatures. From a Certain Point of View features contributions by bestselling authors and trendsetting artists:\n\n• Olivie Blake provides a chilling glimpse into the mind of Emperor Palpatine.\n\n• Saladin Ahmed recounts the tragic history of the rancor trainer.\n\n• Charlie Jane Anders explores the life and times of the Sarlacc.\n\n• Fran Wilde reveals Mon Mothma's secret mission to save the Rebel Alliance.\n\n• Mary Kenney chronicles Wicket the Ewok's quest for one quiet day on the forest moon of Endor.\n\n• Anakin Skywalker becomes one with the Force in a gripping tale by Mike Chen.\n\nPlus more hilarious, heartbreaking, and astonishing tales from:\nTom Angleberger, Kristin Baver, Akemi Dawn Bowman, Emma Mieko Candon, Olivia Chadha, Gloria Chao, Adam Christopher, Paul Crilley, Amal El-Mohtar, M. K. England, Jason Fry, Adam Lance Garcia, Lamar Giles, Max Gladstone, Thea Guanzon, Ali Hazelwood, Patricia A. Jackson, Alex Jennings, Jarrett Krosoczka, Sarah Kuhn, Danny Lore, Sarah Glenn Marsh, Kwame Mbalia, Marieke Nijkamp, Danielle Paige, Laura Pohl, K. Arsenault Rivera, Dana Schwartz, Tara Sim, Phil Szostak, Suzanne Walker, Hannah Whitten, Sean Williams, Alyssa Wong\n\nTo celebrate the launch of this book, Penguin Random House and Disney/Lucasfilm will each make donations to First Book—a leading nonprofit that provides new books, learning materials, and other essentials to educators and organizations serving children in need. In recognition of both companies' longstanding relationships with First Book, Penguin Random House will donate at least $100,000 worth of books to First Book and Disney/Lucasfilm will donate 100,000 children's books to support First Book and their mission of providing equal access to quality education.",
    "pages": 576,
    "isbn": "9780593597910",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/9/99/FACPOV-ROTJ-cover.jpg/revision/latest/scale-to-width-down/500?cb=20230315032805",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "4 ABY",
    "sort_timeline_yavin": 4,
    "series": [
      "From a Certain Point of View"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Anthology",
    "stories": [
      {
        "title": "Any Work Worth Doing",
        "author": [
          "Amal El-Mohtar"
        ]
      },
      {
        "title": "Fancy Man",
        "author": [
          "Phil Szostak"
        ]
      },
      {
        "title": "The Key to Remembering",
        "author": [
          "Olivia Chadha"
        ]
      },
      {
        "title": "Fortuna Favors the Bold",
        "author": [
          "Kwame Mbalia"
        ]
      },
      {
        "title": "Dune Sea Songs of Salt and Moonlight",
        "author": [
          "Thea Guanzon"
        ]
      },
      {
        "title": "The Plan",
        "author": [
          "Saladin Ahmed"
        ]
      },
      {
        "title": "Reputation",
        "author": [
          "Tara Sim"
        ]
      },
      {
        "title": "Kickback",
        "author": [
          "K. Arsenault Rivera"
        ]
      },
      {
        "title": "Everyone's a Critic",
        "author": [
          "Sarah Glenn Marsh"
        ]
      },
      {
        "title": "Satisfaction",
        "author": [
          "Kristin Baver"
        ]
      },
      {
        "title": "My Mouth Never Closes",
        "author": [
          "Charlie Jane Anders"
        ]
      },
      {
        "title": "Kernels and Husks",
        "author": [
          "Jason Fry"
        ]
      },
      {
        "title": "The Light That Falls",
        "author": [
          "Akemi Dawn Bowman"
        ]
      },
      {
        "title": "From a Certain Point of View",
        "author": [
          "Alex Jennings"
        ]
      },
      {
        "title": "No Contingency",
        "author": [
          "Fran Wilde"
        ]
      },
      {
        "title": "The Burden of Leadership",
        "author": [
          "Danny Lore"
        ]
      },
      {
        "title": "Gone to the Winner's Circle",
        "author": [
          "Patricia A. Jackson"
        ]
      },
      {
        "title": "One Normal Day",
        "author": [
          "Mary Kenney"
        ]
      },
      {
        "title": "Divine (?) Intervention",
        "author": [
          "Paul Crilley"
        ]
      },
      {
        "title": "The Buy-In",
        "author": [
          "Suzanne Walker"
        ]
      },
      {
        "title": "The Man Who Captured Luke Skywalker",
        "author": [
          "Max Gladstone"
        ]
      },
      {
        "title": "Ackbar",
        "author": [
          "Jarrett Krosoczka"
        ]
      },
      {
        "title": "The Impossible Flight of Ash Angels",
        "author": [
          "Marieke Nijkamp"
        ]
      },
      {
        "title": "Ending Protocol",
        "author": [
          "Hannah Whitten"
        ]
      },
      {
        "title": "The Last Flight",
        "author": [
          "Ali Hazelwood"
        ]
      },
      {
        "title": "Twenty and Out",
        "author": [
          "Lamar Giles"
        ]
      },
      {
        "title": "The Ballad of Nanta",
        "author": [
          "Sarah Kuhn"
        ]
      },
      {
        "title": "Then Fall, Sidious",
        "author": [
          "Olivie Blake"
        ]
      },
      {
        "title": "Impact",
        "author": [
          "Sean Williams"
        ]
      },
      {
        "title": "Trooper Trouble",
        "author": [
          "Laura Pohl"
        ]
      },
      {
        "title": "To the Last",
        "author": [
          "Dana Schwartz"
        ]
      },
      {
        "title": "The Emperor's Red Guards",
        "author": [
          "Gloria Chao"
        ]
      },
      {
        "title": "Wolf Trap",
        "author": [
          "Alyssa Wong"
        ]
      },
      {
        "title": "The Extra Five Percent",
        "author": [
          "M. K. England"
        ]
      },
      {
        "title": "When Fire Marked the Sky",
        "author": [
          "Emma Mieko Candon"
        ]
      },
      {
        "title": "The Chronicler",
        "author": [
          "Danielle Paige"
        ]
      },
      {
        "title": "The Veteran",
        "author": [
          "Adam Lance Garcia"
        ]
      },
      {
        "title": "Brotherhood",
        "author": [
          "Mike Chen"
        ]
      },
      {
        "title": "The Steadfast Soldier",
        "author": [
          "Adam Christopher"
        ]
      },
      {
        "title": "Return of the Whills",
        "author": [
          "Tom Angleberger"
        ]
      }
    ]
  },
  {
    "id": 71,
    "title": "The Eye of Darkness",
    "sort_title": "Eye of Darkness",
    "author": [
      "George Mann"
    ],
    "publisher": "Random House Worlds",
    "audience": "Adult",
    "pub_date": "11/14/2023",
    "pub_date_all": null,
    "pub_summary": "One year after the tragic events of The Fallen Star, the Jedi fight to break the Nihil's control over the galaxy.\n\nThe galaxy is divided. Following the shocking destruction of Starlight Beacon, the Nihil establish an impenetrable barrier called the Stormwall around part of the Outer Rim, where Marchion Ro rules and his followers wreak havoc at his every whim. Jedi trapped behind enemy lines, including Avar Kriss, must fight to help the worlds being pillaged by the Nihil while staying one step ahead of the marauders and their Nameless terrors.\n\nOutside of the Nihil's so-called Occlusion Zone, Elzar Mann, Bell Zettifar, and the other Jedi work alongside the Republic to reach the worlds that have been cut off from the rest of the galaxy. But every attempt to breach the Stormwall has failed, and even communication across the barrier is impossible. For both Elzar and Bell, their failures and losses weigh heavily upon them as they search desperately for a solution.\n\nBut even if the Republic and Jedi forces manage to breach the Stormwall, how can the Jedi ever fight back against the Nameless creatures that prey on the Jedi's connection to the Force? And what other horrors does Marchion Ro have in store? As desperation for both the Jedi and the Republic grows, any hope of reuniting the galaxy could be all but extinguished….",
    "pages": 416,
    "isbn": "9780593597934",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/b/b0/TheHighRepublic-TheEyeofDarkness-cover.jpg/revision/latest/scale-to-width-down/500?cb=20230705195428",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "229 BBY–228 BBY",
    "sort_timeline_yavin": -229,
    "series": [
      "The High Republic > Phase III: Trials of the Jedi"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 72,
    "title": "Tales of Enlightenment",
    "sort_title": "Tales of Enlightenment",
    "author": [
      "George Mann"
    ],
    "publisher": null,
    "audience": "Adult",
    "pub_date": "04/02/2024",
    "pub_date_all": null,
    "pub_summary": "A collection of short stories from the The High Republic: Tales of Enlightenment series originally collected in Star Wars Insider magazine.\n\nA hardcover collection of Star Wars: The High Republic stories from the pages of Star Wars Insider, written by New York Times bestselling author, George Mann. \n\nA collection of tales set centuries before the birth of Anakin Skywalker featuring Jedi Knights during the era of the glorious High Republic. In addition to six original stories, this collection also includes behind-the-scenes interviews with authors as well as a guide to Phase II of The High Republic publishing initiative. ",
    "pages": 96,
    "isbn": null,
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://framerusercontent.com/images/oLina1mdzOPX5uEg0cJTM5KKykM.jpeg?width=365&height=500",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "382 BBY–377 BBY",
    "sort_timeline_yavin": -382,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Collection",
    "stories": []
  },
  {
    "id": 73,
    "title": "The Living Force",
    "sort_title": "Living Force",
    "author": [
      "John Jackson Miller"
    ],
    "publisher": "Random House Worlds",
    "audience": "Adult",
    "pub_date": "04/09/2024",
    "pub_date_all": null,
    "pub_summary": "In the year before The Phantom Menace, Yoda, Mace Windu, and the entire Jedi Council confront a galaxy on the brink of change.\n\nThe Jedi have always traveled the stars, defending peace and justice across the galaxy. But, the galaxy is changing, and along with it, the Jedi Order. More and more, the Order finds itself focused on the future of the Republic, secluded on Coruscant, where the twelve members of the Jedi Council weigh crises on a galactic scale.\n\nAs yet another Jedi Outpost leftover from the Republic's golden age is set to be decommissioned on the planet Kwenn, Qui-Gon Jinn challenges the Council about the increasing isolation of the Order. Mace Windu suggests a bold response: all twelve Jedi Masters will embark on a goodwill mission to help the planet, and remind the people of the galaxy that the Jedi remain as stalwart and present as they have been across the ages.\n\nBut the arrival of the Jedi leadership is not seen by all as a cause for celebration. Warring pirate factions have infested the sector in the increasing absence of the Jedi. To maintain their dominance, the pirates unite, intent on assassinating the Council. And they are willing to destroy countless innocent lives to secure their power.\n\nCut off from Coruscant, the Jedi Masters must reckon with an unwelcome truth: that while no one thinks more about the future than the Jedi Council, nobody needs their help more than those living in the present.",
    "pages": 432,
    "isbn": "9780593597958",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/9/91/TheLivingForce.png/revision/latest/scale-to-width-down/500?cb=20230907175537",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "33 BBY",
    "sort_timeline_yavin": -33,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 74,
    "title": "Temptation of the Force",
    "sort_title": "Temptation of the Force",
    "author": [
      "Tessa Gratton"
    ],
    "publisher": "Random House Worlds",
    "audience": "Adult",
    "pub_date": "06/11/2024",
    "pub_date_all": null,
    "pub_summary": "The reunited Jedi prepare to strike back against the ruthless Nihil in this thrilling sequel to Star Wars: The High Republic: The Eye of Darkness.\n\nFor over a year, Jedi Masters Avar Kriss and Elzar Mann were kept apart by the Nihil's Stormwall. After Avar makes a daring escape from inside the Occlusion Zone, the star-crossed Jedi are reunited. But while the physical distance between them has evaporated, their shared grief over their failure to protect the galaxy from the Nihil threat still remains.\n\nTo rally the Jedi Order, and the Republic, Avar and Elzar cling to their belief in serving Light and Life. Working together they lead a daring mission into Nihil space to liberate the planet of Naboo, and show those trapped behind the Stormwall that the Jedi will never abandon them. Now back within close orbit of one another, the two Jedi Masters can no longer deny the bond that has always drawn them back together and made them stronger.\n\nAfter finally embracing their true desires and imbued with renewed purpose, Avar and Elzar devise a plan to turn the tide of the conflict with the Nihil once and for all. Accompanied by Jedi Knights Bell Zettifar, Burryaga, and Vernestra Rwoh, the Jedi begin their hunt for Marchion Ro. But to seek out the Nihil's dangerous leader the Jedi will have to survive the Nameless terrors that they have thus far been powerless to stop.",
    "pages": 448,
    "isbn": "9780593723098",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/2/2e/TheHighRepublic-TemptationoftheForce-cover.jpg/revision/latest/scale-to-width-down/500?cb=20240520141843",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "228 BBY",
    "sort_timeline_yavin": -228,
    "series": [
      "The High Republic > Phase III: Trials of the Jedi"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 75,
    "title": "The Rise and Fall of the Galactic Empire",
    "sort_title": "Rise and Fall of the Galactic Empire",
    "author": [
      "Dr. Chris Kempshall"
    ],
    "publisher": "Dorling Kindersley",
    "audience": "Adult",
    "pub_date": "07/04/2024",
    "pub_date_all": null,
    "pub_summary": "A history of the dark times.\n\n\"So this is how liberty dies—with thunderous applause.\"  —Senator Padmé Amidala\n\nWhen Palpatine declared the birth of his new Empire, he expected it would stand for millennia. Instead, it lasted only 24 years. This is the story of how a tyrannical regime rose from the ashes of democracy, ruled the galaxy with an iron fist, and then collapsed into dust.\n\nIt is a story of war and heroes, of the power of propaganda and the dangers of complacency. But most of all, it is a story of normal people trying to live their lives in the face of a brutal dictatorship.\n\nFrom the ruthlessness of Darth Vader's campaigns to the horrors of the Tarkin Initiative, this book offers fresh new insights into the dark entity at the core of Star Wars.",
    "pages": 432,
    "isbn": "9780744098822",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/6/6d/Rise-and-Fall-Final-Cover.jpg/revision/latest/scale-to-width-down/500?cb=20240803165032",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": null,
    "sort_timeline_yavin": null,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Reference",
    "stories": []
  },
  {
    "id": 76,
    "title": "Mace Windu: The Glass Abyss",
    "sort_title": "Mace Windu: Glass Abyss",
    "author": [
      "Steven Barnes"
    ],
    "publisher": "Random House Worlds",
    "audience": "Adult",
    "pub_date": "10/15/2024",
    "pub_date_all": null,
    "pub_summary": "Jedi Master Mace Windu travels to a dangerous, remote planet on a mission that challenges even his deadly prowess—all to fulfill Qui-Gon's last request.\n\nThe Jedi are reeling from Qui-Gon Jinn's sudden death at the hands of a Sith. Jedi Master Mace Windu's feelings about Qui-Gon have always been complicated, and have not been made any simpler in death. While they often disagreed, Mace valued Qui-Gon's unique perspective, and their shared dedication to the Force made them allies. Without Qui-Gon and his unorthodox views, Mace feels out of balance.\n\nWhile considering his fallen friend's legacy, Mace is surprised to receive a final message from Qui-Gon, marked to be delivered to Mace on the event of Qui-Gon's death. The message contains a last request: a plea to help the Outer Rim planet of Metagos.\n\nMany years ago, a violent solar flare transformed the surface of the desert planet into a landscape of irradiated glass–as beautiful as it is dangerous. Now most of the surviving inhabitants live underground, where rival clans fight to control the planet's limited resources. As a young Jedi, Qui-Gon protected the Sa'ad farming clan from the planet's less scrupulous factions. The Sa'ad practice the art of dream-weaving, retaining their waking minds upon sleep in order to communicate and coexist with the wild creatures around them. Qui-Gon vowed to return if they ever required his aid, but now it falls to Mace to fulfill that promise. The Sa'ad's leader, KinShan Nightbird, has begged for the Jedi's help in freeing Metagos from the crime lords who threaten to eradicate her people's way of life.\n\nIntent on fulfilling Qui-Gon's final wishes, Mace travels to Metagos and infiltrates the enemies of the Sa'ad. But as the Jedi Master investigates the intricate web of adversaries and allies, Mace finds himself pushed to the boundaries of the Jedi code, challenging his beliefs and his relationship to the Force itself.",
    "pages": 416,
    "isbn": "9780593723432",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/9/9a/MaceWinduTheGlassAbyss-revealcover.jpg/revision/latest/scale-to-width-down/500?cb=20231208144754",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "32 BBY",
    "sort_timeline_yavin": -32,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 77,
    "title": "The Mask of Fear",
    "sort_title": "Mask of Fear",
    "author": [
      "Alexander Freed"
    ],
    "publisher": "Random House Worlds",
    "audience": "Adult",
    "pub_date": "02/25/2025",
    "pub_date_all": null,
    "pub_summary": "Before the Rebellion, the Empire reigns, in book one of a trilogy told through the eyes of Mon Mothma, Bail Organa, and Saw Gerrera.\n\n\"In order to ensure the security and continuing stability, the Republic will be reorganized into the first Galactic Empire! For a safe and secure society!\"\n\nWith one speech, and thunderous applause, Chancellor Palpatine brought the era of the Republic crashing down. In its place rose the Galactic Empire. Across the galaxy, people rejoiced and celebrated the end to war—and the promises of tomorrow. But that tomorrow was a lie. Instead the galaxy became twisted by the cruelty and fear of the Emperor's rule.\n\nDuring that terrifying first year of tyranny, Mon Mothma, Saw Gerrera, and Bail Organa face the encroaching darkness. One day, they will be three architects of the Rebel Alliance. But first, each must find purpose and direction in a changing galaxy, while harboring their own secrets, fears, and hopes for a future that may never come, unless they act.",
    "pages": 496,
    "isbn": "9780593723463",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/0/08/ROTE-TheMaskOfFear.jpg/revision/latest/scale-to-width-down/500?cb=20240729163725",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "19 BBY–18 BBY",
    "sort_timeline_yavin": -18,
    "series": [
      "Reign of the Empire"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 78,
    "title": "The Acolyte: Wayseeker",
    "sort_title": "Acolyte: Wayseeker",
    "author": [
      "Justina Ireland"
    ],
    "publisher": "Random House Worlds",
    "audience": "Adult",
    "pub_date": "05/06/2025",
    "pub_date_all": null,
    "pub_summary": "Decades before Star Wars: The Acolyte, Vernestra Rwoh must rediscover her place within the Jedi Order.\n\nJedi Master Vernestra Rwoh has spent years exploring the Outer Rim as a Wayseeker, answering to no authority but the Force itself. When the Jedi Council orders her to return to Coruscant, Vernestra ignores the summons, feeling that her priority is the beings she's already serving.\n\nSo the Council dispatches Jedi Knight Indara to track down Vernestra to deliver the urgent message that a Republic senator has formally requested Jedi assistance, asking for Vernestra's aid by name. Intrigued, Vernestra quickly finds herself pulled back into Coruscant's complicated world of Republic politics and underworld crime.\n\nThe two could not be more different: Vernestra, a Jedi Master who has known conflict and loss during her decades in the Order, and Indara, a young Knight just coming into her own as a Jedi in a galaxy at peace. Trust is slow to develop as they clash over their views on serving the Jedi Order, the galaxy, and the Force.\n\nBut they must work together to decipher the connection between the senator and a trail of dangerous weapons threatening to wreak havoc on the Republic. As the two delve further into their investigation, the lines between Jedi and Republic business blur, and Vernestra must rediscover what it means to serve for Light and Life.",
    "pages": 304,
    "isbn": "9780593874431",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/2/28/TheAcolyte-Wayseeker-cover3.jpg/revision/latest/scale-to-width-down/500?cb=20241114210410",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "160 BBY",
    "sort_timeline_yavin": -160,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 79,
    "title": "Tempest Breaker",
    "sort_title": "Tempest Breaker",
    "author": [
      "Cavan Scott"
    ],
    "publisher": "Random House Worlds",
    "audience": "Adult",
    "pub_date": "05/13/2025",
    "pub_date_all": null,
    "pub_summary": "The Jedi reluctantly team up with the nefarious Lourna Dee in this full script for the Star Wars the High Republic audiobook original, Tempest Breaker.\n\nLourna Dee is not a villain. She's not a hero. She's a survivor. The former Tempest Runner, wanted by both her Nihil allies and the Republic, has evaded imprisonment and death from both groups more times than she can count. But even Lourna cannot outrun the mysterious blight that devours everything wherever it appears. And Marchion Ro, the Eye of the Nihil, has announced that only he knows the secret to stopping it.\n\nDesperate, the Republic and Jedi turn to Lourna with an offer: help the Jedi stop the blight, and in return, Lourna will have a clean slate and the chance to decide her own future.\nTeamed with Avar Kriss and Keeve Trennis, the same Jedi who once hunted her, Lourna leads the search for the Nihil's chief scientist, Baron Boolan, the only being who may have answers to the mystery of the blight, as well as Marchion Ro's true plans.\n\nLourna weighs the Republic's offer of true freedom against her own instincts for survival as her team heads deeper into Nihil territory, straight toward the very dangers Lourna has worked for so long to elude. And when the opportunity arises to face off against Marchion Ro himself, even Lourna Dee may be willing to sacrifice everything to fulfill a quest for revenge.",
    "pages": 528,
    "isbn": "9780593723418",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/4/4f/THR-Tempest-Breaker-Script-Cover.jpg/revision/latest/scale-to-width-down/500?cb=20240805031942",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "228 BBY",
    "sort_timeline_yavin": -228,
    "series": [
      "The High Republic > Phase III: Trials of the Jedi"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Script Book",
    "stories": []
  },
  {
    "id": 80,
    "title": "Trials of the Jedi",
    "sort_title": "Trials of the Jedi",
    "author": [
      "Charles Soule"
    ],
    "publisher": "Random House Worlds",
    "audience": "Adult",
    "pub_date": "06/17/2025",
    "pub_date_all": null,
    "pub_summary": "In this epic conclusion to Star Wars: The High Republic, the Jedi face a final confrontation against the Nihil and Marchion Ro.\n\nThe Force is everything. A single life connected to all life. All things connected to all other things. This is what the Jedi believe, and this is why they fight. For life…and the light.\n\nFor too long, the light has been threatened by Marchion Ro, a sinister despot who will stop at nothing in his quest for power. The conflict with Ro and his marauding Nihil forces has left scars across the galaxy and held the Republic hostage. Countless lives have been lost, beacons of hope have fallen, and the collective courage and resolve of the Republic have been tested like never before. Through it all the Jedi Order has endured, an unwavering candle against the encroaching darkness.\n\nBut the Jedi have yet to solve the mystery of the Nameless creatures who feed on the Force. Ro has loosed them upon the galaxy, striking fear into the heart of even the most stalwart Jedi. And yet with every life saved and world freed from Nihil control, the all-consuming blight, which devours everything wherever it appears, threatens to wipe it all away.\n\nEverything now depends on nine brave Jedi, led by Avar Kriss and Elzar Mann, who embark on a treacherous journey to the Nameless homeworld. Their quest: to finally solve the mystery of the Nameless and their connection to the Force, and to stop the blight before its damage becomes irreversible.\n\nBut a final confrontation with Marchion Ro awaits. Ro, who is willing to sacrifice everything he's achieved to secure a final victory against the Jedi and carve his name into the very stars for all time.\n\nNothing less than the fate of everything, perhaps even the Force itself, is at stake.",
    "pages": 448,
    "isbn": "9780593723524",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/6/60/TheHighRepublic-TrialsoftheJedi-Cover.png/revision/latest/scale-to-width-down/500?cb=20250128161108",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "228 BBY",
    "sort_timeline_yavin": -228,
    "series": [
      "The High Republic > Phase III: Trials of the Jedi"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 81,
    "title": "Sanctuary",
    "sort_title": "Sanctuary",
    "author": [
      "Lamar Giles"
    ],
    "publisher": "Random House Worlds",
    "audience": "Adult",
    "pub_date": "08/05/2025",
    "pub_date_all": null,
    "pub_summary": "Hunter, Wrecker, Tech, and Omega gamble on a mission to help rebuild Pabu in this thrilling adventure for The Bad Batch.\n\nA good soldier knows that life is all about change — whether it's on or off the battlefield. Surviving, living, means adaptation. Hunter is well acquainted with this lesson. He's on the run from the Empire, Echo's off on a mission with Captain Rex, and Crosshair is…still Crosshair, but amidst all the change, Hunter still has Tech, Wrecker, and Omega.\n\nAnd it seems that his small family might have finally found a safe place to land, far from the increasingly vigilant eyes of the Empire: Pabu. But their potential new island home is in desperate need of resources if there is any hope for the fledgling community to recover from a devastating sea wave. That's where Phee Genoa, self-proclaimed liberator of treasures, comes in, with a couple of jobs she swears will get them the funds they need. Despite Hunter's concern with Phee’s precarious plans, the rest of the crew is fine following her lead.\n\nThings go wrong almost immediately, as Phee's droid blows the crew's cover at a high-stakes auction, and they barely make it out with the relic they'd been paid to acquire. Hunter insists they finish their first mission and deliver the relic before taking on more work, but Phee and the others push forward with a second job: ferrying a couple on the run, one of whom is due to give birth at any moment. Hunter worries what they're risking, especially when their mysterious new passengers cling to lies and secrets that trace back to an Imperial Security Bureau officer hot on their trail.\n\nAs Hunter tries to get the crew back on a stable, safe path far, far away from anything to do with the Empire's watchdogs, their overlapping missions only invite more danger and chaos. On the verge of failing both their desperate passengers and their community on Pabu, the Batch must remember that the only way they succeed, the only way they survive to fight another day, is by trusting each other.",
    "pages": null,
    "isbn": "9780593874462",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/1/16/Sanctuary-Cover.jpg/revision/latest/scale-to-width-down/500?cb=20250207000237",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "18 BBY",
    "sort_timeline_yavin": -18,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 82,
    "title": "Master of Evil",
    "sort_title": "Master of Evil",
    "author": [
      "Adam Christopher"
    ],
    "publisher": "Random House Worlds",
    "audience": "Adult",
    "pub_date": "11/11/2025",
    "pub_date_all": null,
    "pub_summary": "After Revenge of the Sith, a newly forged Darth Vader hunts for the secrets of life and death under the watchful eye of Emperor Palpatine.\n\nIn the wake of Emperor Palpatine's rise to power, the true nature of his most sinister enforcer remains a mystery. Darth Vader is a dominant yet illusive figure: the shadow cast by a malignant Imperial regime, unknowable to even its top officials. But even as his humanity gives way to myth, Vader remains haunted by the promises of the dark side, seeking the ultimate power that his master has hinted at but withheld—the power to conquer death itself.\n\nOn the volcanic world of Mustafar, Vader undertakes a dark ritual, bleeding a kyber crystal to forge his lightsaber. This act unleashes a power far greater than he anticipated, giving him a glimpse into the limitless potential of the Force.\n\nVader is determined to follow this vision, even if it means defying his master's orders. Yet he finds the Emperor suspiciously supportive of his mission, even sending Vader to the Diso system to investigate rumors of a Force-wielding shaman able to raise the dead. At his side are a cadre of the Emperor's scarlet-robed Royal Guard, led by Colonel Halland Goth—a decorated soldier with a very personal interest in Vader’s mission.\n\nEven as the Emperor's true motivations reveal themselves, Vader falls deeper into obsession. His journey takes him far across the galaxy, chasing rumors and phantoms. But no matter how far he travels, he cannot escape the shadows within his own soul. Haunted by the echoes of his past, Vader circles the true resolution to his quest: only once all weakness is purged can he become a master of evil.",
    "pages": 384,
    "isbn": "9780593874738",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/b/be/MasterOfEvil-Cover.png/revision/latest/scale-to-width-down/500?cb=20250410155352",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "19 BBY",
    "sort_timeline_yavin": -19,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 83,
    "title": "Outlaws: Low Red Moon",
    "sort_title": "Outlaws: Low Red Moon",
    "author": [
      "Mike Chen"
    ],
    "publisher": "Random House Worlds",
    "audience": "Adult",
    "pub_date": "02/03/2026",
    "pub_date_all": null,
    "pub_summary": "ND-5 and Jaylen Vrax embark on their descent into the galaxy's underworld in search of answers and opportunity, in this essential prequel to Star Wars Outlaws.\n\nJaylen Barsha, heir to his family's immense power and wealth, had his life charted out for him neatly and meticulously by his parents, even though he suspected his neglected half-brother Sliro would be a better fit for the bright corporate future his parents envisioned. Then the Empire stripped it all away on trumped-up charges of conspiracy against his family. Before he can reach Sliro for help redeeming the Barsha name, a battle droid arrives at the family compound with a mission: to kill every single last member of the Barsha clan. Jaylen manages to fend off the attack as the sole survivor, but realizes the droid, who he reprograms, is his only chance to stay alive. But he can no longer be Jaylen Barsha—he'll have to live now as Jaylen Vrax.\n\nFormer Separatist battle droid ND-5 knows he should be scrap metal, all things considered. He was a proficient contributor to the Separatist cause, but what is a soldier without a war? A trigger without aim? Loyalty is in his programming, and Jaylen, who treats him as more than just a weapon, has earned it. Perhaps, the droid thinks, with a partner he can be more. ND-5 just has to earn Jaylen's trust.\n\nWith the threat against the Barsha clan still shrouded in mystery, the pair has no choice but to leverage the chaos and disappear. They find sanctuary in the anonymity of the underworld, building their reputation among scoundrels, bounty hunters, and crime syndicates. But when their latest score gives the first real clue in years to who sent ND-5 after Jaylen's family, their biggest opportunity presents a new kind of risk. Do they give up this chance at the wealth and power Jaylen was denied to pursue answers? Or will ambition and the weight of the past shatter their unlikely partnership?",
    "pages": 384,
    "isbn": "9780593874493",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/7/76/OutlawsLowRedMoon-Cover.jpg/revision/latest/scale-to-width-down/500?cb=20250922235839",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "19 BBY–10 BBY",
    "sort_timeline_yavin": -19,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 84,
    "title": "Legacy",
    "sort_title": "Legacy",
    "author": [
      "Madeleine Roux"
    ],
    "publisher": "Random House Worlds",
    "audience": "Adult",
    "pub_date": "07/28/2026",
    "pub_date_all": null,
    "pub_summary": "Set between Episodes VIII and IX, Rey and Leia embark on a quest to repair Rey's lightsaber and rekindle the legacy of the Jedi.\n\nAfter barely escaping the First Order on Crait, Rey and the Resistance are struggling to rebuild. Her friends need the last Jedi more than ever, but Rey feels alone and overwhelmed. Jedi tradition is built on masters and apprentices, and Rey's teacher is gone. Leia Organa tries her best to train Rey in the ways of the Force as Luke did for her so many years ago, but Leia's knowledge is limited, Rey's lightsaber is broken, and the specter of Kylo Ren and regrets from the past haunt them both. How can Leia pass the torch when she herself is unsure of the way?\n\nBut then, the ancient Jedi texts offer a glimmer of hope: a long-forgotten Jedi temple on Tython that might hold the key to repairing Rey's saber. Rey leaps at the chance to journey there — and to her surprise, so does Leia.\n\nRey and Leia's nascent mentorship is put to the test when they discover the temple on Tython is filled with obscure clues to decipher and arcane trials to complete. As they work to unravel the temple's mysteries, they encounter a group of refugees living in its shadow, hiding from a First Order officer hot on the trail of two freedom fighters in their midst. With the threat of the First Order looming and the secrets of the temple yet to be unlocked, the newly forged master and apprentice must confront their pasts, reach each other in the present, and decide what it means to carry the legacy of the Jedi into the future.",
    "pages": 304,
    "isbn": "9780593982662",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/1/17/Legacy-Cover.png/revision/latest/scale-to-width-down/500?cb=20251022013452",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "34 ABY–35 ABY",
    "sort_timeline_yavin": 34,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 86,
    "title": "Myths & Fables",
    "sort_title": "Myths & Fables",
    "author": [
      "George Mann"
    ],
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "08/06/2019",
    "pub_date_all": null,
    "pub_summary": "Beautifully illustrated, this unique treasury of in-world space tales takes readers to the far reaches of the Star Wars universe…including to the remote outer rim world of Batuu from Galaxy's Edge.",
    "pages": null,
    "isbn": "9781368043458",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/6/6d/Myths-Fables.png/revision/latest/scale-to-width-down/500?cb=20211121170019",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": null,
    "sort_timeline_yavin": null,
    "series": [
      "Galaxy's Edge"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Collection",
    "stories": []
  },
  {
    "id": 87,
    "title": "Dark Legends",
    "sort_title": "Dark Legends",
    "author": [
      "George Mann"
    ],
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "07/28/2020",
    "pub_date_all": null,
    "pub_summary": "Read on if you dare! This unique in-world collection hallows the spooky tales and ghost stories that would have kept young Luke and Leia up at night. Created by George Mann and Grant Griffin—the same team behind the stunning Star Wars: Myths & Fables—these six [sic] frightful fables have been carefully woven from the expansive fabric that is the Star Wars galaxy (including the thrilling landscape from Galaxy's Edge at Disneyland and Disney World), and beautifully painted in a lush illustrative style that feels intergalactic yet innately archetypal and timeless.",
    "pages": null,
    "isbn": "9781368057332",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/f/fa/DarkLegendsCoverArt.jpg/revision/latest/scale-to-width-down/500?cb=20200807142507",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": null,
    "sort_timeline_yavin": null,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Collection",
    "stories": []
  },
  {
    "id": 88,
    "title": "The Clone Wars: Stories of Light and Dark",
    "sort_title": "Stories of Light and Dark",
    "author": [
      "Various"
    ],
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "08/25/2020",
    "pub_date_all": null,
    "pub_summary": "An epic clash between the forces of light and dark, between the Galactic Republic and the Separatists, between brave heroes and brilliant villains…the fate of the galaxy is at stake in the Emmy Award–winning animated series Star Wars: The Clone Wars. In this exciting anthology, eleven authors who are also fans of the series bring stories from their favorite show to life. Relive memorable moments and stunning adventures, from attempted assassinations to stolen bounties, from lessons learned to loves lost. All your favorite characters from The Clone Wars are here: Anakin Skywalker, Yoda, Obi-Wan Kenobi, Ahsoka Tano, Captain Rex, Darth Maul, Count Dooku, and more!",
    "pages": 384,
    "isbn": "9781368057295",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/4/42/StoriesOfLightAndDark.jpg/revision/latest/scale-to-width-down/500?cb=20200902014252",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "22 BBY–19 BBY",
    "sort_timeline_yavin": -22,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Anthology",
    "stories": [
      {
        "title": "Sharing the Same Face",
        "author": [
          "Jason Fry"
        ]
      },
      {
        "title": "Dooku Captured",
        "author": [
          "Lou Anders"
        ]
      },
      {
        "title": "Hostage Crisis",
        "author": [
          "Preeti Chhibber"
        ]
      },
      {
        "title": "Pursuit of Peace",
        "author": [
          "Anne Ursu"
        ]
      },
      {
        "title": "The Shadow of Umbara",
        "author": [
          "Yoon Ha Lee"
        ]
      },
      {
        "title": "Bane's Story",
        "author": [
          "Tom Angleberger"
        ]
      },
      {
        "title": "The Lost Nightsister",
        "author": [
          "Zoraida Córdova"
        ]
      },
      {
        "title": "Dark Vengeance",
        "author": [
          "Rebecca Roanhorse"
        ]
      },
      {
        "title": "Almost a Jedi",
        "author": [
          "Sarah Beth Durst"
        ]
      },
      {
        "title": "Kenobi's Shadow",
        "author": [
          "Greg van Eekhout"
        ]
      },
      {
        "title": "Bug",
        "author": [
          "E. Anne Convery"
        ]
      }
    ]
  },
  {
    "id": 89,
    "title": "Life Day Treasury",
    "sort_title": "Life Day Treasury",
    "author": [
      "George Mann",
      "Cavan Scott"
    ],
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "09/07/2021",
    "pub_date_all": null,
    "pub_summary": "Cozy up with this collection of holiday-themed midwinter stories from throughout the galaxy far, far away!\n\nFrom George Mann and Grant Griffin, the same team that brought us the stunning Star Wars: Myths & Fables and Star Wars: Dark Legends–with the addition of best-selling author Cavan Scott–this collection of eight myths and fables told around winter fires and high-tech heating pods across the galaxy will bring holiday joy to young and old Star Wars fans alike. From Jedi in the city to Ewoks in the forest, from Wookiees to droids, in this charming collection you will find holiday feasts, ghostly apparitions, snowy adventures, and much more. Ultimately these are stories of hope in the darkest of days. Of family, found and otherwise. Of kindness. And of love.",
    "pages": 192,
    "isbn": "9781368070881",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/0/05/LifeDayTreasury-cover.png/revision/latest/scale-to-width-down/500?cb=20210506235335",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": null,
    "sort_timeline_yavin": null,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Collection",
    "stories": [
      {
        "title": "A Coruscant Solstice",
        "author": [
          "Cavan Scott"
        ]
      },
      {
        "title": "The Kroolok",
        "author": [
          "George MannCavan Scott"
        ]
      }
    ]
  },
  {
    "title": "Path of Vengeance",
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "05/02/2023",
    "pub_date_all": null,
    "pub_summary": "This enthralling follow up to Path of Deceit finds cousins Marda and Yana Ro bound by blood but driven apart by faith.\n\nMarda and Yana belong to the Path of the Open Hand, a group led by a charismatic woman called the Mother, which believes the Force must not be used by anyone. While Marda joins a perilous expedition to Planet X in search of more mysterious creatures to use against the Jedi, Yana finds herself forming an unexpected alliance with the father of her dead lover in attempt to wrest the Path from the Mother's control. These two young women will face a crossroads, forced to choose not only their own fates, but that of the galaxy itself.",
    "pages": 528,
    "isbn": "9781368082884",
    "asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/2/2a/TheHighRepublic-PathofVengeance-cover.jpg/revision/latest/scale-to-width-down/500?cb=20221010031440",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "audio_asin": null,
    "timeline_text": "382 BBY",
    "sort_timeline_yavin": -382,
    "series": [
      "The High Republic > Phase II: Light of the Jedi"
    ],
    "id": 90,
    "sort_title": "Path of Vengeance",
    "author": [
      "Cavan Scott"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 91,
    "title": "Tales of Light and Life",
    "sort_title": "Tales of Light and Life",
    "author": [
      "Various"
    ],
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "09/05/2023",
    "pub_date_all": null,
    "pub_summary": "Thrilling short stories featuring fan favorite characters from the beloved High Republic series each written by a New York Times bestselling author.\n\nThe High Republic authors share unmissable short stories that bridge Phases, resolve mysteries, and offer tantalizing hints of what is to come.\n\nRejoin the adventures of the Jedi and Padawans, Pathfinders and Path members, heroes and villains ahead of the launch of Phase III.",
    "pages": 400,
    "isbn": "9781368093798",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/8/81/TalesOfLightAndLife-Cover.png/revision/latest/scale-to-width-down/500?cb=20230308221712",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": null,
    "sort_timeline_yavin": null,
    "series": [
      "The High Republic"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Anthology",
    "stories": [
      {
        "title": "The Queen's Bloom",
        "author": [
          "Zoraida Córdova"
        ]
      },
      {
        "title": "A Closed Fist Has No Claws",
        "author": [
          "Tessa Gratton"
        ]
      },
      {
        "title": "Shield of the Jedi",
        "author": [
          "George Mann"
        ]
      },
      {
        "title": "The Lonely Traveler is Home",
        "author": [
          "Daniel José Older"
        ]
      },
      {
        "title": "After the Fall",
        "author": [
          "Claudia Gray"
        ]
      },
      {
        "title": "The Force Provides",
        "author": [
          "Justina Ireland"
        ]
      },
      {
        "title": "All Jedi Walk Their Own Path",
        "author": [
          "Charles Soule"
        ]
      },
      {
        "title": "Light in the Darkness",
        "author": [
          "Cavan Scott"
        ]
      },
      {
        "title": "The Call of Coruscant",
        "author": [
          "Lydia Kang"
        ]
      },
      {
        "title": "Rogue Element",
        "author": [
          "Alyssa Wong"
        ]
      }
    ]
  },
  {
    "id": 92,
    "title": "Crimson Climb",
    "sort_title": "Crimson Climb",
    "author": [
      "E. K. Johnston"
    ],
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "10/10/2023",
    "pub_date_all": null,
    "pub_summary": "New York Times bestselling author E. K. Johnston, author of the Queens series starring Padmé Amidala, brings fans an untold story about Qi'ra, portrayed by Emilia Clarke in Star Wars: A Solo Story. [sic]\n\nNot everyone gets to be the hero.\n\nQi'ra listened to the dreams and promises of a boy with a reckless smile, only to be torn away from him and returned to the White Worms gang while Han made his way to freedom. Now freedom seems like a luxury she can't afford while she concentrates on survival and despairs of ever leaving Corellia. But her fortunes seem to turn when a representative of the crime syndicate Crimson Dawn plucks Qi'ra from captivity and brings her to the syndicate's leader, the mysterious and mercurial Dryden Vos. Vos offers Qi'ra an opportunity she's never had before: the chance to build something resembling a comfortable life if she can prove her worth to his organization. With failure meaning certain death, Qi'ra knows she must immerse herself in the merciless, murderous world of Crimson Dawn. What she doesn't know is just who she will be if she survives….",
    "pages": 368,
    "isbn": "9781368093750",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/f/f5/CrimsonClimb-revealcover.jpg/revision/latest/scale-to-width-down/500?cb=20230208001041",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "13 BBY–12 BBY",
    "sort_timeline_yavin": -13,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 93,
    "title": "Defy the Storm",
    "sort_title": "Defy the Storm",
    "author": [
      "Tessa Gratton",
      "Justina Ireland"
    ],
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "03/05/2024",
    "pub_date_all": null,
    "pub_summary": "Nowhere is safe within the eye of the storm….\n\nThe Galactic Republic is in chaos following the Nihil's shocking destruction of the gleaming space station Starlight Beacon. Capitalizing on their victory, the Nihil have erected a barrier called the Stormwall around a section of Republic space and claimed it for themselves. Within this Occlusion Zone, people live at the mercy of the Nihil–and the Nihil are not known for mercy.\n\nJedi Knight Vernestra Rwoh, believing her Padawan, Imri Cantaros, to be among the casualties of Starlight Beacon, has retreated to a peaceful planet where she hopes to nurse her wounds and regain some sense of equilibrium. But her old friend Avon Starros has other plans. Avon knows that Imri is alive inside the Occlusion Zone–and she and Vernestra must be the ones to find him.\n\nWith the help of former frontier deputy Jordanna Sparkburn and the extremely untrustworthy Xylan Graf, Avon and Vernestra set out to breach the Stormwall and enter the Occlusion Zone in search of Imri. But within Nihil territory, danger lurks around every corner…as do terrifying creatures known as the Nameless.\n\nHow can Vernestra find her lost Padawan when her very strength in the Force becomes her ultimate weakness? And what are Avon's true motivations behind enemy lines?",
    "pages": 464,
    "isbn": "9781368093811",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/7/79/TheHighRepublic-DefytheStorm-cover.jpg/revision/latest/scale-to-width-down/500?cb=20230721222810",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "228 BBY",
    "sort_timeline_yavin": -228,
    "series": [
      "The High Republic > Phase III: Trials of the Jedi"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 94,
    "title": "Tears of the Nameless",
    "sort_title": "Tears of the Nameless",
    "author": [
      "George Mann"
    ],
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "09/24/2024",
    "pub_date_all": null,
    "pub_summary": "The New York Times best-selling series continues in this heart-wrenching sequel to Defy the Storm where fans will reunite with fan-favorite Jedi Knight Reath Silas.\n\nWritten by the author of The High Republic: Eye of Darkness, The High Republic: Quest for the Hidden City, Dark Legends, and Myths & Fables, this next High Republic installment is perfect for fans of investigative mysteries, mythology, monster-hunting, and apocalyptic sci-fi.\n\nIt's been over a year since the fall of the Starlight Beacon space station, and both heroes and villains alike must face the consequences of their decisions. When Jedi Knight Reath and Padawan Amadeo Azzazzo are sent on a mission to test their theories about the Nameless, they'll come face-to-face with the terrifying creatures once thought to be myth–and learn the true meaning of fear…fear that fallen Jedi Azlin Rell advised them to embrace if they have any hope of defeating the monsters…",
    "pages": 512,
    "isbn": "9781368095174",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/3/3b/TearsOfTheNameless-Cover.png/revision/latest/scale-to-width-down/500?cb=20240929070043",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "228 BBY",
    "sort_timeline_yavin": -228,
    "series": [
      "The High Republic > Phase III: Trials of the Jedi"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "title": "Into the Light",
    "author": [
      "Claudia Gray"
    ],
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "04/01/2025",
    "pub_date_all": null,
    "pub_summary": "The New York Times best-selling series is coming to an epic conclusion—witness the beginning of the end!\n\nAs several crises all hurtle toward their thrilling and shocking conclusions, fan-favorite Jedi Knights and Padawans must band together to save the galaxy from the Nihil, the Nameless, and perhaps worst of all, a mysterious blight that turns everything in its path to dust and is seemingly impossible to stop.",
    "pages": 368,
    "isbn": "9781368095181",
    "asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/4/45/TheHighRepublic-IntotheLight-cover.jpg/revision/latest/scale-to-width-down/500?cb=20241018205643",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "audio_asin": null,
    "timeline_text": "228 BBY",
    "sort_timeline_yavin": -228,
    "series": [
      "The High Republic > Phase III: Trials of the Jedi"
    ],
    "id": 95,
    "sort_title": "Into the Light",
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "title": "The Crystal Crown",
    "author": [
      "Tessa Gratton"
    ],
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "07/29/2025",
    "pub_date_all": null,
    "pub_summary": "An exciting adventure starring fan-favorite Jedi Padawans Jecki and Yord from the Disney+ live-action series, The Acolyte.\n\nWhile their Jedi Masters clean up a political mess left by one of their own, Jedi Padawan Jecki and her least favorite Padawan Yord are drawn into a planet-wide coming-of-age ritual as featured guests. The first ritual goes well, but when the event is interrupted, Jecki and Yord will have to use all of their abilities and work together to keep each other — and their new friends — safe from danger.\n\nThis young adult novel is Star Wars meets The Hunger Games and offers fans of The Acolyte a chance to spend more time with two of their favorite characters from the show.",
    "pages": 448,
    "isbn": "9781368070126",
    "asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/1/18/TheAcolyte-TheCrystalCrown-Cover.jpg/revision/latest/scale-to-width-down/500?cb=20250524051956",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "audio_asin": null,
    "timeline_text": "134 BBY",
    "sort_timeline_yavin": -134,
    "series": [
      "The Acolyte"
    ],
    "id": 96,
    "sort_title": "Crystal Crown",
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 97,
    "title": "The Last Order",
    "sort_title": "Last Order",
    "author": [
      "Kwame Mbalia"
    ],
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Young Adult",
    "pub_date": "10/21/2025",
    "pub_date_all": null,
    "pub_summary": "New York Times best-selling author Kwame Mbalia makes his Star Wars debut with this exciting YA novel!\n\nFollowing the end of Star Wars: The Rise of Skywalker, the Resistance rescues a ship full of young passengers who had been kidnapped by the First Order. As Finn and Jannah set out to find the First Order officer responsible before he can endanger any more children, the two former stormtroopers must wrestle with their own complicated pasts as soldiers of the oppressive regime.\n\nTake a deep dive into the pasts of popular characters Finn and Jannah in this richly-drawn, action-packed story that fans have been asking for.",
    "pages": 464,
    "isbn": "9781368065610",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/e/e7/TheLastOrder-Cover.jpg/revision/latest/scale-to-width-down/500?cb=20250517001950",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "35 ABY",
    "sort_timeline_yavin": 35,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "id": 98,
    "title": "Eyes Like Stars",
    "sort_title": "Eyes Like Stars",
    "author": [
      "Ashley Poston"
    ],
    "publisher": "Delacorte Press",
    "audience": "Young Adult",
    "pub_date": "07/01/2026",
    "pub_date_all": null,
    "pub_summary": "New York Times best-selling author Ashley Poston is writing the first official Star Wars romance novel, Eyes Like Stars. NYCC got the first look at the dreamlike cover for the young adult novel, which features a couple in search of their happily ever after in the galaxy far, far away. The charming young adult romance, set about a year and a half before Star Wars: The Force Awakens, features all-new characters, a mysterious artifact, and the fearsome First Order. (Summer 2026)",
    "pages": null,
    "isbn": null,
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/c/cd/EyesLikeStars-Cover.jpg/revision/latest/scale-to-width-down/499?cb=20251011165956",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "33 ABY",
    "sort_timeline_yavin": 33,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": []
  },
  {
    "title": "Rise of the Rebels",
    "author": [
      "Michael Kogge"
    ],
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Junior Reader",
    "pub_date": "08/05/2014",
    "pub_date_all": null,
    "pub_summary": "Your favorite Star Wars Rebels heroes are ready to fight the evil Empire! Kanan, Hera and trusty old Chopper battle TIE fighters while Sabine uses her artistic talents to outsmart Stormtroopers. Zeb never misses an opportunity to take down troopers, and Ezra scores a special souvenir at the crash site of an Imperial fighter.",
    "pages": 128,
    "isbn": "9781484702703",
    "asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/9/93/RiseoftheRebels.png/revision/latest/scale-to-width-down/500?cb=20140815184328",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "audio_asin": null,
    "timeline_text": "5 BBY",
    "sort_timeline_yavin": -5,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novelization",
    "stories": [],
    "id": 99,
    "sort_title": "Rise of the Rebels"
  },
  {
    "title": "Ezra's Gamble",
    "author": [
      "Ryder Windham"
    ],
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Junior Reader",
    "pub_date": "08/05/2014",
    "pub_date_all": null,
    "pub_summary": "Fourteen year-old Ezra Bridger lives alone on the Outer Rim planet of Lothal. He fends for himself by picking up odd jobs and hustling the unsuspecting Stormtrooper. But when Arena Day arrives - an underground tournament where mighty beasts battle to the finish and all the swindlers, gamblers and no-gooders come from all corners of the planet to make a profit - Ezra is whisked into an unlikely partnership with the fearsome bounty hunter Bossk and enmeshed in a high-stakes chase against an endless fleet of troopers. Ezra isn't willing to trust anyone, but he soon learns that surviving doesn't always mean just fending for himself.",
    "pages": 154,
    "isbn": "1484702727",
    "asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/f/fc/EzrasGamble.png/revision/latest/scale-to-width-down/500?cb=20140815185723",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "audio_asin": null,
    "timeline_text": "5 BBY",
    "sort_timeline_yavin": -5,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": [],
    "id": 100,
    "sort_title": "Ezra's Gamble"
  },
  {
    "title": "Servants of the Empire: Edge of the Galaxy",
    "author": [
      "Jason Fry"
    ],
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Junior Reader",
    "pub_date": "10/21/2014",
    "pub_date_all": null,
    "pub_summary": "Zare Leonis seems destined to become a poster boy for the Empire. His sister Dhara has been accepted into the esteemed Imperial Academy on Lothal and Zare is confident he'll join her in a year's time. But a year can bring plenty of unwelcome changes. Not only does he begin to uncover the Empire's destructive plans for Lothal and the livelihood of its people, but his unease hits home when Dhara goes mysteriously missing. Zare is forced to question everything and rethink what it means to be a good servant of the Empire.",
    "pages": 176,
    "isbn": "9781484704851",
    "asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/4/47/Servants-Edge.png/revision/latest/scale-to-width-down/500?cb=20140814010943",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "audio_asin": null,
    "timeline_text": "6 BBY–5 BBY",
    "sort_timeline_yavin": -6,
    "series": [
      "Star Wars Rebels: Servants of the Empire"
    ],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novel",
    "stories": [],
    "id": 101,
    "sort_title": "Servants of the Empire: Edge of the Galaxy"
  },
  {
    "title": "The Rebellion Begins",
    "author": [
      "Michael Kogge"
    ],
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Junior Reader",
    "pub_date": "10/21/2014",
    "pub_date_all": null,
    "pub_summary": "Ezra Bridger knows how to take care of himself. Growing up in the shadow of the Galactic Empire, Ezra has always stolen what he can to survive--and to mess with the Empire. But when one of Ezra's heists goes terribly wrong, he finds himself thrown together with a team of rebels. Lead by brash maverick Kanan Jarrus and fearless pilot Hera Syndulla, the rebels are on a mission to free enslaved Wookiees from an Imperial prison. Now Ezra must decide whether to go back to his simple life on Lothal, or join the rebels in their fight for freedom.",
    "pages": 160,
    "isbn": "9781484714751",
    "asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/0/00/TheRebellionBegins.png/revision/latest/scale-to-width-down/500?cb=20140907205529",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "audio_asin": null,
    "timeline_text": "5 BBY",
    "sort_timeline_yavin": -5,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novelization",
    "stories": [],
    "id": 102,
    "sort_title": "Rebellion Begins"
  },
  {
    "id": 103,
    "title": "Droids in Distress",
    "sort_title": "Droids in Distress",
    "author": [
      "Michael Kogge"
    ],
    "publisher": "Disney–Lucasfilm Press",
    "audience": "Junior Reader",
    "pub_date": "11/18/2014",
    "pub_date_all": null,
    "pub_summary": "The heroes of Star Wars Rebels are back with more action-packed adventures! Follow them on their journey to save Wookiees as they narrowly escape a terrible Imperial trap. They also meet beloved droids R2-D2 and C-3PO—who are on a mysterious mission to help the Empire! Chopper proves that even a clunky old droid can play a big role in saving the galaxy. But one mission leads to the next for our rebel heroes, and they must ultimately face their biggest enemy yet—the Inquisitor!",
    "pages": 128,
    "isbn": "1484704665",
    "asin": null,
    "audio_asin": null,
    "cover_url": "https://static.wikia.nocookie.net/starwars/images/0/01/DroidsinDistress.png/revision/latest/scale-to-width-down/500?cb=20140812010702",
    "audio_narrator": null,
    "audio_publisher": null,
    "audio_runtime": null,
    "timeline_text": "5 BBY",
    "sort_timeline_yavin": -5,
    "series": [],
    "series_order": {},
    "continuity": "Canon",
    "book_type": "Novelization",
    "stories": []
  }
]